package cn.datawe.constant;

import java.util.HashMap;
import java.util.LinkedHashMap;
import java.util.Map;

import cn.datawe.util.ValidatorUtil;

/**
 * 枚举类:东北地区行政区划
 * <br>数据更新日期:2016-08-24
 * 
 * @author LiuJiaLe
 * 
 */
public enum ChinaNortheastAreaCodeEnum {

	ITEM210000("210000", "辽宁省", "", ""),
	ITEM210100("210100", "辽宁省", "沈阳市", ""),
	ITEM210102("210102", "辽宁省", "沈阳市", "和平区"),
	ITEM210103("210103", "辽宁省", "沈阳市", "沈河区"),
	ITEM210104("210104", "辽宁省", "沈阳市", "大东区"),
	ITEM210105("210105", "辽宁省", "沈阳市", "皇姑区"),
	ITEM210106("210106", "辽宁省", "沈阳市", "铁西区"),
	ITEM210111("210111", "辽宁省", "沈阳市", "苏家屯区"),
	ITEM210112("210112", "辽宁省", "沈阳市", "东陵区"),
	ITEM210113("210113", "辽宁省", "沈阳市", "沈北新区"),
	ITEM210114("210114", "辽宁省", "沈阳市", "于洪区"),
	ITEM210115("210115", "辽宁省", "沈阳市", "辽中区"),
	ITEM210123("210123", "辽宁省", "沈阳市", "康平县"),
	ITEM210124("210124", "辽宁省", "沈阳市", "法库县"),
	ITEM210181("210181", "辽宁省", "沈阳市", "新民市"),
	ITEM210200("210200", "辽宁省", "大连市", ""),
	ITEM210202("210202", "辽宁省", "大连市", "中山区"),
	ITEM210203("210203", "辽宁省", "大连市", "西岗区"),
	ITEM210204("210204", "辽宁省", "大连市", "沙河口区"),
	ITEM210211("210211", "辽宁省", "大连市", "甘井子区"),
	ITEM210212("210212", "辽宁省", "大连市", "旅顺口区"),
	ITEM210213("210213", "辽宁省", "大连市", "金州区"),
	ITEM210224("210224", "辽宁省", "大连市", "长海县"),
	ITEM210281("210281", "辽宁省", "大连市", "瓦房店市"),
	ITEM210214("210214", "辽宁省", "大连市", "普兰店区"),
	ITEM210283("210283", "辽宁省", "大连市", "庄河市"),
	ITEM210300("210300", "辽宁省", "鞍山市", ""),
	ITEM210302("210302", "辽宁省", "鞍山市", "铁东区"),
	ITEM210303("210303", "辽宁省", "鞍山市", "铁西区"),
	ITEM210304("210304", "辽宁省", "鞍山市", "立山区"),
	ITEM210311("210311", "辽宁省", "鞍山市", "千山区"),
	ITEM210321("210321", "辽宁省", "鞍山市", "台安县"),
	ITEM210323("210323", "辽宁省", "鞍山市", "岫岩满族自治县"),
	ITEM210381("210381", "辽宁省", "鞍山市", "海城市"),
	ITEM210400("210400", "辽宁省", "抚顺市", ""),
	ITEM210402("210402", "辽宁省", "抚顺市", "新抚区"),
	ITEM210403("210403", "辽宁省", "抚顺市", "东洲区"),
	ITEM210404("210404", "辽宁省", "抚顺市", "望花区"),
	ITEM210411("210411", "辽宁省", "抚顺市", "顺城区"),
	ITEM210421("210421", "辽宁省", "抚顺市", "抚顺县"),
	ITEM210422("210422", "辽宁省", "抚顺市", "新宾满族自治县"),
	ITEM210423("210423", "辽宁省", "抚顺市", "清原满族自治县"),
	ITEM210500("210500", "辽宁省", "本溪市", ""),
	ITEM210502("210502", "辽宁省", "本溪市", "平山区"),
	ITEM210503("210503", "辽宁省", "本溪市", "溪湖区"),
	ITEM210504("210504", "辽宁省", "本溪市", "明山区"),
	ITEM210505("210505", "辽宁省", "本溪市", "南芬区"),
	ITEM210521("210521", "辽宁省", "本溪市", "本溪满族自治县"),
	ITEM210522("210522", "辽宁省", "本溪市", "桓仁满族自治县"),
	ITEM210600("210600", "辽宁省", "丹东市", ""),
	ITEM210602("210602", "辽宁省", "丹东市", "元宝区"),
	ITEM210603("210603", "辽宁省", "丹东市", "振兴区"),
	ITEM210604("210604", "辽宁省", "丹东市", "振安区"),
	ITEM210624("210624", "辽宁省", "丹东市", "宽甸满族自治县"),
	ITEM210681("210681", "辽宁省", "丹东市", "东港市"),
	ITEM210682("210682", "辽宁省", "丹东市", "凤城市"),
	ITEM210700("210700", "辽宁省", "锦州市", ""),
	ITEM210702("210702", "辽宁省", "锦州市", "古塔区"),
	ITEM210703("210703", "辽宁省", "锦州市", "凌河区"),
	ITEM210711("210711", "辽宁省", "锦州市", "太和区"),
	ITEM210726("210726", "辽宁省", "锦州市", "黑山县"),
	ITEM210727("210727", "辽宁省", "锦州市", "义县"),
	ITEM210781("210781", "辽宁省", "锦州市", "凌海市"),
	ITEM210782("210782", "辽宁省", "锦州市", "北镇市"),
	ITEM210800("210800", "辽宁省", "营口市", ""),
	ITEM210802("210802", "辽宁省", "营口市", "站前区"),
	ITEM210803("210803", "辽宁省", "营口市", "西市区"),
	ITEM210804("210804", "辽宁省", "营口市", "鲅鱼圈区"),
	ITEM210811("210811", "辽宁省", "营口市", "老边区"),
	ITEM210881("210881", "辽宁省", "营口市", "盖州市"),
	ITEM210882("210882", "辽宁省", "营口市", "大石桥市"),
	ITEM210900("210900", "辽宁省", "阜新市", ""),
	ITEM210902("210902", "辽宁省", "阜新市", "海州区"),
	ITEM210903("210903", "辽宁省", "阜新市", "新邱区"),
	ITEM210904("210904", "辽宁省", "阜新市", "太平区"),
	ITEM210905("210905", "辽宁省", "阜新市", "清河门区"),
	ITEM210911("210911", "辽宁省", "阜新市", "细河区"),
	ITEM210921("210921", "辽宁省", "阜新市", "阜新蒙古族自治县"),
	ITEM210922("210922", "辽宁省", "阜新市", "彰武县"),
	ITEM211000("211000", "辽宁省", "辽阳市", ""),
	ITEM211002("211002", "辽宁省", "辽阳市", "白塔区"),
	ITEM211003("211003", "辽宁省", "辽阳市", "文圣区"),
	ITEM211004("211004", "辽宁省", "辽阳市", "宏伟区"),
	ITEM211005("211005", "辽宁省", "辽阳市", "弓长岭区"),
	ITEM211011("211011", "辽宁省", "辽阳市", "太子河区"),
	ITEM211021("211021", "辽宁省", "辽阳市", "辽阳县"),
	ITEM211081("211081", "辽宁省", "辽阳市", "灯塔市"),
	ITEM211100("211100", "辽宁省", "盘锦市", ""),
	ITEM211102("211102", "辽宁省", "盘锦市", "双台子区"),
	ITEM211103("211103", "辽宁省", "盘锦市", "兴隆台区"),
	ITEM211121("211121", "辽宁省", "盘锦市", "大洼县"),
	ITEM211122("211122", "辽宁省", "盘锦市", "盘山县"),
	ITEM211200("211200", "辽宁省", "铁岭市", ""),
	ITEM211202("211202", "辽宁省", "铁岭市", "银州区"),
	ITEM211204("211204", "辽宁省", "铁岭市", "清河区"),
	ITEM211221("211221", "辽宁省", "铁岭市", "铁岭县"),
	ITEM211223("211223", "辽宁省", "铁岭市", "西丰县"),
	ITEM211224("211224", "辽宁省", "铁岭市", "昌图县"),
	ITEM211281("211281", "辽宁省", "铁岭市", "调兵山市"),
	ITEM211282("211282", "辽宁省", "铁岭市", "开原市"),
	ITEM211300("211300", "辽宁省", "朝阳市", ""),
	ITEM211302("211302", "辽宁省", "朝阳市", "双塔区"),
	ITEM211303("211303", "辽宁省", "朝阳市", "龙城区"),
	ITEM211321("211321", "辽宁省", "朝阳市", "朝阳县"),
	ITEM211322("211322", "辽宁省", "朝阳市", "建平县"),
	ITEM211324("211324", "辽宁省", "朝阳市", "喀喇沁左翼蒙古族自治县"),
	ITEM211381("211381", "辽宁省", "朝阳市", "北票市"),
	ITEM211382("211382", "辽宁省", "朝阳市", "凌源市"),
	ITEM211400("211400", "辽宁省", "葫芦岛市", ""),
	ITEM211402("211402", "辽宁省", "葫芦岛市", "连山区"),
	ITEM211403("211403", "辽宁省", "葫芦岛市", "龙港区"),
	ITEM211404("211404", "辽宁省", "葫芦岛市", "南票区"),
	ITEM211421("211421", "辽宁省", "葫芦岛市", "绥中县"),
	ITEM211422("211422", "辽宁省", "葫芦岛市", "建昌县"),
	ITEM211481("211481", "辽宁省", "葫芦岛市", "兴城市"),
	
	ITEM220000("220000", "吉林省", "", ""),
	ITEM220100("220100", "吉林省", "长春市", ""),
	ITEM220102("220102", "吉林省", "长春市", "南关区"),
	ITEM220103("220103", "吉林省", "长春市", "宽城区"),
	ITEM220104("220104", "吉林省", "长春市", "朝阳区"),
	ITEM220105("220105", "吉林省", "长春市", "二道区"),
	ITEM220106("220106", "吉林省", "长春市", "绿园区"),
	ITEM220112("220112", "吉林省", "长春市", "双阳区"),
	ITEM220113("220113", "吉林省", "长春市", "九台区"),
	ITEM220122("220122", "吉林省", "长春市", "农安县"),
	ITEM220182("220182", "吉林省", "长春市", "榆树市"),
	ITEM220183("220183", "吉林省", "长春市", "德惠市"),
	ITEM220200("220200", "吉林省", "吉林市", ""),
	ITEM220202("220202", "吉林省", "吉林市", "昌邑区"),
	ITEM220203("220203", "吉林省", "吉林市", "龙潭区"),
	ITEM220204("220204", "吉林省", "吉林市", "船营区"),
	ITEM220211("220211", "吉林省", "吉林市", "丰满区"),
	ITEM220221("220221", "吉林省", "吉林市", "永吉县"),
	ITEM220281("220281", "吉林省", "吉林市", "蛟河市"),
	ITEM220282("220282", "吉林省", "吉林市", "桦甸市"),
	ITEM220283("220283", "吉林省", "吉林市", "舒兰市"),
	ITEM220284("220284", "吉林省", "吉林市", "磐石市"),
	ITEM220300("220300", "吉林省", "四平市", ""),
	ITEM220302("220302", "吉林省", "四平市", "铁西区"),
	ITEM220303("220303", "吉林省", "四平市", "铁东区"),
	ITEM220322("220322", "吉林省", "四平市", "梨树县"),
	ITEM220323("220323", "吉林省", "四平市", "伊通满族自治县"),
	ITEM220381("220381", "吉林省", "四平市", "公主岭市"),
	ITEM220382("220382", "吉林省", "四平市", "双辽市"),
	ITEM220400("220400", "吉林省", "辽源市", ""),
	ITEM220402("220402", "吉林省", "辽源市", "龙山区"),
	ITEM220403("220403", "吉林省", "辽源市", "西安区"),
	ITEM220421("220421", "吉林省", "辽源市", "东丰县"),
	ITEM220422("220422", "吉林省", "辽源市", "东辽县"),
	ITEM220500("220500", "吉林省", "通化市", ""),
	ITEM220502("220502", "吉林省", "通化市", "东昌区"),
	ITEM220503("220503", "吉林省", "通化市", "二道江区"),
	ITEM220521("220521", "吉林省", "通化市", "通化县"),
	ITEM220523("220523", "吉林省", "通化市", "辉南县"),
	ITEM220524("220524", "吉林省", "通化市", "柳河县"),
	ITEM220581("220581", "吉林省", "通化市", "梅河口市"),
	ITEM220582("220582", "吉林省", "通化市", "集安市"),
	ITEM220600("220600", "吉林省", "白山市", ""),
	ITEM220602("220602", "吉林省", "白山市", "浑江区"),
	ITEM220605("220605", "吉林省", "白山市", "江源区"),
	ITEM220621("220621", "吉林省", "白山市", "抚松县"),
	ITEM220622("220622", "吉林省", "白山市", "靖宇县"),
	ITEM220623("220623", "吉林省", "白山市", "长白朝鲜族自治县"),
	ITEM220681("220681", "吉林省", "白山市", "临江市"),
	ITEM220700("220700", "吉林省", "松原市", ""),
	ITEM220702("220702", "吉林省", "松原市", "宁江区"),
	ITEM220721("220721", "吉林省", "松原市", "前郭尔罗斯蒙古族自治县"),
	ITEM220722("220722", "吉林省", "松原市", "长岭县"),
	ITEM220723("220723", "吉林省", "松原市", "乾安县"),
	ITEM220781("220781", "吉林省", "松原市", "扶余市"),
	ITEM220800("220800", "吉林省", "白城市", ""),
	ITEM220802("220802", "吉林省", "白城市", "洮北区"),
	ITEM220821("220821", "吉林省", "白城市", "镇赉县"),
	ITEM220822("220822", "吉林省", "白城市", "通榆县"),
	ITEM220881("220881", "吉林省", "白城市", "洮南市"),
	ITEM220882("220882", "吉林省", "白城市", "大安市"),
	ITEM222400("222400", "吉林省", "延边朝鲜族自治州", ""),
	ITEM222401("222401", "吉林省", "延边朝鲜族自治州", "延吉市"),
	ITEM222402("222402", "吉林省", "延边朝鲜族自治州", "图们市"),
	ITEM222403("222403", "吉林省", "延边朝鲜族自治州", "敦化市"),
	ITEM222404("222404", "吉林省", "延边朝鲜族自治州", "珲春市"),
	ITEM222405("222405", "吉林省", "延边朝鲜族自治州", "龙井市"),
	ITEM222406("222406", "吉林省", "延边朝鲜族自治州", "和龙市"),
	ITEM222424("222424", "吉林省", "延边朝鲜族自治州", "汪清县"),
	ITEM222426("222426", "吉林省", "延边朝鲜族自治州", "安图县"),
	
	ITEM230000("230000", "黑龙江省", "", ""),
	ITEM230100("230100", "黑龙江省", "哈尔滨市", ""),
	ITEM230102("230102", "黑龙江省", "哈尔滨市", "道里区"),
	ITEM230103("230103", "黑龙江省", "哈尔滨市", "南岗区"),
	ITEM230104("230104", "黑龙江省", "哈尔滨市", "道外区"),
	ITEM230108("230108", "黑龙江省", "哈尔滨市", "平房区"),
	ITEM230109("230109", "黑龙江省", "哈尔滨市", "松北区"),
	ITEM230110("230110", "黑龙江省", "哈尔滨市", "香坊区"),
	ITEM230111("230111", "黑龙江省", "哈尔滨市", "呼兰区"),
	ITEM230112("230112", "黑龙江省", "哈尔滨市", "阿城区"),
	ITEM230113("230113", "黑龙江省", "哈尔滨市", "双城区"),
	ITEM230123("230123", "黑龙江省", "哈尔滨市", "依兰县"),
	ITEM230124("230124", "黑龙江省", "哈尔滨市", "方正县"),
	ITEM230125("230125", "黑龙江省", "哈尔滨市", "宾县"),
	ITEM230126("230126", "黑龙江省", "哈尔滨市", "巴彦县"),
	ITEM230127("230127", "黑龙江省", "哈尔滨市", "木兰县"),
	ITEM230128("230128", "黑龙江省", "哈尔滨市", "通河县"),
	ITEM230129("230129", "黑龙江省", "哈尔滨市", "延寿县"),
	ITEM230183("230183", "黑龙江省", "哈尔滨市", "尚志市"),
	ITEM230184("230184", "黑龙江省", "哈尔滨市", "五常市"),
	ITEM230200("230200", "黑龙江省", "齐齐哈尔市", ""),
	ITEM230202("230202", "黑龙江省", "齐齐哈尔市", "龙沙区"),
	ITEM230203("230203", "黑龙江省", "齐齐哈尔市", "建华区"),
	ITEM230204("230204", "黑龙江省", "齐齐哈尔市", "铁锋区"),
	ITEM230205("230205", "黑龙江省", "齐齐哈尔市", "昂昂溪区"),
	ITEM230206("230206", "黑龙江省", "齐齐哈尔市", "富拉尔基区"),
	ITEM230207("230207", "黑龙江省", "齐齐哈尔市", "碾子山区"),
	ITEM230208("230208", "黑龙江省", "齐齐哈尔市", "梅里斯达斡尔族区"),
	ITEM230221("230221", "黑龙江省", "齐齐哈尔市", "龙江县"),
	ITEM230223("230223", "黑龙江省", "齐齐哈尔市", "依安县"),
	ITEM230224("230224", "黑龙江省", "齐齐哈尔市", "泰来县"),
	ITEM230225("230225", "黑龙江省", "齐齐哈尔市", "甘南县"),
	ITEM230227("230227", "黑龙江省", "齐齐哈尔市", "富裕县"),
	ITEM230229("230229", "黑龙江省", "齐齐哈尔市", "克山县"),
	ITEM230230("230230", "黑龙江省", "齐齐哈尔市", "克东县"),
	ITEM230231("230231", "黑龙江省", "齐齐哈尔市", "拜泉县"),
	ITEM230281("230281", "黑龙江省", "齐齐哈尔市", "讷河市"),
	ITEM230300("230300", "黑龙江省", "鸡西市", ""),
	ITEM230302("230302", "黑龙江省", "鸡西市", "鸡冠区"),
	ITEM230303("230303", "黑龙江省", "鸡西市", "恒山区"),
	ITEM230304("230304", "黑龙江省", "鸡西市", "滴道区"),
	ITEM230305("230305", "黑龙江省", "鸡西市", "梨树区"),
	ITEM230306("230306", "黑龙江省", "鸡西市", "城子河区"),
	ITEM230307("230307", "黑龙江省", "鸡西市", "麻山区"),
	ITEM230321("230321", "黑龙江省", "鸡西市", "鸡东县"),
	ITEM230381("230381", "黑龙江省", "鸡西市", "虎林市"),
	ITEM230382("230382", "黑龙江省", "鸡西市", "密山市"),
	ITEM230400("230400", "黑龙江省", "鹤岗市", ""),
	ITEM230402("230402", "黑龙江省", "鹤岗市", "向阳区"),
	ITEM230403("230403", "黑龙江省", "鹤岗市", "工农区"),
	ITEM230404("230404", "黑龙江省", "鹤岗市", "南山区"),
	ITEM230405("230405", "黑龙江省", "鹤岗市", "兴安区"),
	ITEM230406("230406", "黑龙江省", "鹤岗市", "东山区"),
	ITEM230407("230407", "黑龙江省", "鹤岗市", "兴山区"),
	ITEM230421("230421", "黑龙江省", "鹤岗市", "萝北县"),
	ITEM230422("230422", "黑龙江省", "鹤岗市", "绥滨县"),
	ITEM230500("230500", "黑龙江省", "双鸭山市", ""),
	ITEM230502("230502", "黑龙江省", "双鸭山市", "尖山区"),
	ITEM230503("230503", "黑龙江省", "双鸭山市", "岭东区"),
	ITEM230505("230505", "黑龙江省", "双鸭山市", "四方台区"),
	ITEM230506("230506", "黑龙江省", "双鸭山市", "宝山区"),
	ITEM230521("230521", "黑龙江省", "双鸭山市", "集贤县"),
	ITEM230522("230522", "黑龙江省", "双鸭山市", "友谊县"),
	ITEM230523("230523", "黑龙江省", "双鸭山市", "宝清县"),
	ITEM230524("230524", "黑龙江省", "双鸭山市", "饶河县"),
	ITEM230600("230600", "黑龙江省", "大庆市", ""),
	ITEM230602("230602", "黑龙江省", "大庆市", "萨尔图区"),
	ITEM230603("230603", "黑龙江省", "大庆市", "龙凤区"),
	ITEM230604("230604", "黑龙江省", "大庆市", "让胡路区"),
	ITEM230605("230605", "黑龙江省", "大庆市", "红岗区"),
	ITEM230606("230606", "黑龙江省", "大庆市", "大同区"),
	ITEM230621("230621", "黑龙江省", "大庆市", "肇州县"),
	ITEM230622("230622", "黑龙江省", "大庆市", "肇源县"),
	ITEM230623("230623", "黑龙江省", "大庆市", "林甸县"),
	ITEM230624("230624", "黑龙江省", "大庆市", "杜尔伯特蒙古族自治县"),
	ITEM230700("230700", "黑龙江省", "伊春市", ""),
	ITEM230702("230702", "黑龙江省", "伊春市", "伊春区"),
	ITEM230703("230703", "黑龙江省", "伊春市", "南岔区"),
	ITEM230704("230704", "黑龙江省", "伊春市", "友好区"),
	ITEM230705("230705", "黑龙江省", "伊春市", "西林区"),
	ITEM230706("230706", "黑龙江省", "伊春市", "翠峦区"),
	ITEM230707("230707", "黑龙江省", "伊春市", "新青区"),
	ITEM230708("230708", "黑龙江省", "伊春市", "美溪区"),
	ITEM230709("230709", "黑龙江省", "伊春市", "金山屯区"),
	ITEM230710("230710", "黑龙江省", "伊春市", "五营区"),
	ITEM230711("230711", "黑龙江省", "伊春市", "乌马河区"),
	ITEM230712("230712", "黑龙江省", "伊春市", "汤旺河区"),
	ITEM230713("230713", "黑龙江省", "伊春市", "带岭区"),
	ITEM230714("230714", "黑龙江省", "伊春市", "乌伊岭区"),
	ITEM230715("230715", "黑龙江省", "伊春市", "红星区"),
	ITEM230716("230716", "黑龙江省", "伊春市", "上甘岭区"),
	ITEM230722("230722", "黑龙江省", "伊春市", "嘉荫县"),
	ITEM230781("230781", "黑龙江省", "伊春市", "铁力市"),
	ITEM230800("230800", "黑龙江省", "佳木斯市", ""),
	ITEM230803("230803", "黑龙江省", "佳木斯市", "向阳区"),
	ITEM230804("230804", "黑龙江省", "佳木斯市", "前进区"),
	ITEM230805("230805", "黑龙江省", "佳木斯市", "东风区"),
	ITEM230811("230811", "黑龙江省", "佳木斯市", "郊区"),
	ITEM230822("230822", "黑龙江省", "佳木斯市", "桦南县"),
	ITEM230826("230826", "黑龙江省", "佳木斯市", "桦川县"),
	ITEM230828("230828", "黑龙江省", "佳木斯市", "汤原县"),
	ITEM230881("230881", "黑龙江省", "佳木斯市", "同江市"),
	ITEM230882("230882", "黑龙江省", "佳木斯市", "富锦市"),
	ITEM230883("230883", "黑龙江省", "佳木斯市", "抚远市"),// 230833->230883, 抚远县->抚远市
	ITEM230900("230900", "黑龙江省", "七台河市", ""),
	ITEM230902("230902", "黑龙江省", "七台河市", "新兴区"),
	ITEM230903("230903", "黑龙江省", "七台河市", "桃山区"),
	ITEM230904("230904", "黑龙江省", "七台河市", "茄子河区"),
	ITEM230921("230921", "黑龙江省", "七台河市", "勃利县"),
	ITEM231000("231000", "黑龙江省", "牡丹江市", ""),
	ITEM231002("231002", "黑龙江省", "牡丹江市", "东安区"),
	ITEM231003("231003", "黑龙江省", "牡丹江市", "阳明区"),
	ITEM231004("231004", "黑龙江省", "牡丹江市", "爱民区"),
	ITEM231005("231005", "黑龙江省", "牡丹江市", "西安区"),
	ITEM231025("231025", "黑龙江省", "牡丹江市", "林口县"),
	ITEM231081("231081", "黑龙江省", "牡丹江市", "绥芬河市"),
	ITEM231083("231083", "黑龙江省", "牡丹江市", "海林市"),
	ITEM231084("231084", "黑龙江省", "牡丹江市", "宁安市"),
	ITEM231085("231085", "黑龙江省", "牡丹江市", "穆棱市"),
	ITEM231086("231086", "黑龙江省", "牡丹江市", "东宁市"),
	ITEM231100("231100", "黑龙江省", "黑河市", ""),
	ITEM231102("231102", "黑龙江省", "黑河市", "爱辉区"),
	ITEM231121("231121", "黑龙江省", "黑河市", "嫩江县"),
	ITEM231123("231123", "黑龙江省", "黑河市", "逊克县"),
	ITEM231124("231124", "黑龙江省", "黑河市", "孙吴县"),
	ITEM231181("231181", "黑龙江省", "黑河市", "北安市"),
	ITEM231182("231182", "黑龙江省", "黑河市", "五大连池市"),
	ITEM231200("231200", "黑龙江省", "绥化市", ""),
	ITEM231202("231202", "黑龙江省", "绥化市", "北林区"),
	ITEM231221("231221", "黑龙江省", "绥化市", "望奎县"),
	ITEM231222("231222", "黑龙江省", "绥化市", "兰西县"),
	ITEM231223("231223", "黑龙江省", "绥化市", "青冈县"),
	ITEM231224("231224", "黑龙江省", "绥化市", "庆安县"),
	ITEM231225("231225", "黑龙江省", "绥化市", "明水县"),
	ITEM231226("231226", "黑龙江省", "绥化市", "绥棱县"),
	ITEM231281("231281", "黑龙江省", "绥化市", "安达市"),
	ITEM231282("231282", "黑龙江省", "绥化市", "肇东市"),
	ITEM231283("231283", "黑龙江省", "绥化市", "海伦市"),
	ITEM232700("232700", "黑龙江省", "大兴安岭地区", ""),
	ITEM232721("232721", "黑龙江省", "大兴安岭地区", "呼玛县"),
	ITEM232722("232722", "黑龙江省", "大兴安岭地区", "塔河县"),
	ITEM232723("232723", "黑龙江省", "大兴安岭地区", "漠河县"),
	;

	private String code;
	private String firstDistrict;
	private String secondDistrict;
	private String thirdDistrict;

	private ChinaNortheastAreaCodeEnum(String code, String firstDistrict, String secondDistrict, String thirdDistrict) {
		this.code = code;
		this.firstDistrict = firstDistrict;
		this.secondDistrict = secondDistrict;
		this.thirdDistrict = thirdDistrict;
	}

	public String getCode() {
		return code;
	}

	public String getFirstDistrict() {
		return firstDistrict;
	}

	public String getSecondDistrict() {
		return secondDistrict;
	}
	
	public String getThirdDistrict() {
		return thirdDistrict;
	}
	
	public String getFullName() {
		
		return firstDistrict.concat(secondDistrict).concat(thirdDistrict);
	}
	
	public static Map<Object, Object> getResult(String code) {

		if (ValidatorUtil.isAreaCode(code)) {

			for (ChinaNortheastAreaCodeEnum e : ChinaNortheastAreaCodeEnum.values()) {

				if (code.equals(e.getCode())) {

					return getResult(e);
				}
			}
		}
		return null;
	}
	
	public static String getCode(String name) {
		
		if (ValidatorUtil.isNotEmptyIgnoreBlank(name)) {
			
			String fullName = null;
			for (ChinaNortheastAreaCodeEnum e : ChinaNortheastAreaCodeEnum.values()) {
				
				fullName = e.getFirstDistrict().concat(e.getSecondDistrict()).concat(e.getThirdDistrict());
				if (fullName.equals(name)) {
					
					return e.getCode();
				}
			}
		}
		return null;
	}
	
	public static String getName(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaNortheastAreaCodeEnum e : ChinaNortheastAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return getName(e);
				}
			}
		}
		return null;
	}
	
	public static String getFullName(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaNortheastAreaCodeEnum e : ChinaNortheastAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return e.getFirstDistrict().concat(e.getSecondDistrict()).concat(e.getThirdDistrict());
				}
			}
		}
		return null;
	}
	
	public static String matchCode(String name) {
		
		final String REGEX = "朝鲜族自治州|地区|省|市|区|县";
		String code = null;
		String str1 = null;
		String str2 = null;
		String str3 = null;
		Map<String, String> map1 = new HashMap<String, String>();
		Map<String, String> map2 = new LinkedHashMap<String, String>();
		Map<String, String> map3 = new HashMap<String, String>();
		if (ValidatorUtil.isNotEmptyIgnoreBlank(name)) {
			
			code = matchSpecial(name);
			if (null == code) {
				
				for (ChinaNortheastAreaCodeEnum e : ChinaNortheastAreaCodeEnum.values()) {
					
					str1 = e.getFirstDistrict();
					str2 = e.getSecondDistrict();
					str3 = e.getThirdDistrict();
					if (ValidatorUtil.isNotEmpty(str3)) {
						
						map3.put(e.getCode(), (str1.concat(str2).concat(str3)).replaceAll(REGEX, ""));
						map2.put(e.getCode(), (str1.concat(str3)).replaceAll(REGEX, ""));
					}
					if (ValidatorUtil.isEmpty(str3) && ValidatorUtil.isNotEmpty(str2)) {
						
						map2.put(e.getCode(), (str1.concat(str2)).replaceAll(REGEX, ""));
					}
					if (ValidatorUtil.isAllEmpty(str2, str3)) {
						
						map1.put(e.getCode(), str1.replaceAll(REGEX, ""));
					}
				}
				
				name = name.replaceAll(REGEX, "");
				code = getCode(name, map1, map2, map3);
				if (null == code) {
					
					name = name.replaceAll("(?s)(.)(?=.*\\1)", "");
					code = getCode(name, map1, map2, map3);
				}
			}
		}
		return code;
	}
	
	private static String getCode(String name, Map<String, String> map1, Map<String, String> map2, Map<String, String> map3) {
		
		String code = matchCode(name, map3);
		if (null == code) {
			
			code = matchCode(name, map2);
		}
		if (null == code) {
			
			code = matchCode(name, map1);
		}
		return code;
	}
	
	private static String matchCode(String name, Map<String, String> map) {
		
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.equals(entry.getValue())) {
				
				return entry.getKey();
			}
		}
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.startsWith(entry.getValue())) {
				
				return entry.getKey();
			}
		}
		return null;
	}
	
	private static String matchSpecial(String name) {
		
		if (name.startsWith("辽宁")) {
			
			if (name.contains(ChinaNortheastAreaCodeEnum.ITEM210421.getThirdDistrict())) {
				// 辽宁省抚顺市抚顺县
				return ChinaNortheastAreaCodeEnum.ITEM210421.getCode();
			}
			if (name.contains(ChinaNortheastAreaCodeEnum.ITEM211021.getThirdDistrict())) {
				// 辽宁省辽阳市辽阳县
				return ChinaNortheastAreaCodeEnum.ITEM211021.getCode();
			}
			if (name.contains(ChinaNortheastAreaCodeEnum.ITEM211221.getThirdDistrict())) {
				// 辽宁省铁岭市铁岭县
				return ChinaNortheastAreaCodeEnum.ITEM211221.getCode();
			}
			if (name.contains(ChinaNortheastAreaCodeEnum.ITEM211321.getThirdDistrict())) {
				// 辽宁省朝阳市朝阳县
				return ChinaNortheastAreaCodeEnum.ITEM211321.getCode();
			}
		}
		if (name.startsWith("吉林")) {
			
			if (name.contains(ChinaNortheastAreaCodeEnum.ITEM220521.getThirdDistrict())) {
				// 吉林省通化市通化县
				return ChinaNortheastAreaCodeEnum.ITEM220521.getCode();
			}
		}
		if (name.startsWith("黑龙江")) {
			
			if (name.contains(ChinaNortheastAreaCodeEnum.ITEM230702.getThirdDistrict())) {
				// 黑龙江省伊春市伊春区
				return ChinaNortheastAreaCodeEnum.ITEM230702.getCode();
			}
		}
		return null;
	}
	
	private static String getName(ChinaNortheastAreaCodeEnum e) {
		
		String name = e.getThirdDistrict();
		if (ValidatorUtil.isEmpty(name)) {
			
			name = e.getSecondDistrict();
		}
		if (ValidatorUtil.isEmpty(name)) {
			
			name = e.getFirstDistrict();
		}
		return ValidatorUtil.isEmpty(name) ? null : name;
	}
	
	private static Map<Object, Object> getResult(ChinaNortheastAreaCodeEnum e) {
		
		String district = null;
		Map<Object, Object> map = new HashMap<Object, Object>();
		map.put("code", e.getCode());
		
		district = e.getFirstDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("firstDistrict", district);
		}
		district = e.getSecondDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("secondDistrict", district);
		}
		district = e.getThirdDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("thirdDistrict", district);
		}
		return map;
	}
}
