package cn.datawe.constant;

import java.util.HashMap;
import java.util.LinkedHashMap;
import java.util.Map;

import cn.datawe.util.ValidatorUtil;

/**
 * 枚举类:西南地区行政区划
 * <br>数据更新日期:2016-08-24
 * 
 * @author LiuJiaLe
 * 
 */
public enum ChinaSouthwestAreaCodeEnum {

	ITEM500000("500000", "重庆市", "", ""),
	ITEM500101("500101", "重庆市", "万州区", ""),
	ITEM500102("500102", "重庆市", "涪陵区", ""),
	ITEM500103("500103", "重庆市", "渝中区", ""),
	ITEM500104("500104", "重庆市", "大渡口区", ""),
	ITEM500105("500105", "重庆市", "江北区", ""),
	ITEM500106("500106", "重庆市", "沙坪坝区", ""),
	ITEM500107("500107", "重庆市", "九龙坡区", ""),
	ITEM500108("500108", "重庆市", "南岸区", ""),
	ITEM500109("500109", "重庆市", "北碚区", ""),
	ITEM500110("500110", "重庆市", "綦江区", ""),
	ITEM500111("500111", "重庆市", "大足区", ""),
	ITEM500112("500112", "重庆市", "渝北区", ""),
	ITEM500113("500113", "重庆市", "巴南区", ""),
	ITEM500114("500114", "重庆市", "黔江区", ""),
	ITEM500115("500115", "重庆市", "长寿区", ""),
	ITEM500116("500116", "重庆市", "江津区", ""),
	ITEM500117("500117", "重庆市", "合川区", ""),
	ITEM500118("500118", "重庆市", "永川区", ""),
	ITEM500119("500119", "重庆市", "南川区", ""),
	ITEM500120("500120", "重庆市", "璧山区", ""),
	ITEM500151("500151", "重庆市", "铜梁区", ""),
	ITEM500152("500152", "重庆市", "潼南区", ""),
	ITEM500153("500153", "重庆市", "荣昌区", ""),
	ITEM500154("500154", "重庆市", "开州区", ""),
	ITEM500228("500228", "重庆市", "梁平县", ""),
	ITEM500229("500229", "重庆市", "城口县", ""),
	ITEM500230("500230", "重庆市", "丰都县", ""),
	ITEM500231("500231", "重庆市", "垫江县", ""),
	ITEM500232("500232", "重庆市", "武隆县", ""),
	ITEM500233("500233", "重庆市", "忠县", ""),
	ITEM500234("500234", "重庆市", "开县", ""),
	ITEM500235("500235", "重庆市", "云阳县", ""),
	ITEM500236("500236", "重庆市", "奉节县", ""),
	ITEM500237("500237", "重庆市", "巫山县", ""),
	ITEM500238("500238", "重庆市", "巫溪县", ""),
	ITEM500240("500240", "重庆市", "石柱土家族自治县", ""),
	ITEM500241("500241", "重庆市", "秀山土家族苗族自治县", ""),
	ITEM500242("500242", "重庆市", "酉阳土家族苗族自治县", ""),
	ITEM500243("500243", "重庆市", "彭水苗族土家族自治县", ""),
	
	ITEM510000("510000", "四川省", "", ""),
	ITEM510100("510100", "四川省", "成都市", ""),
	ITEM510104("510104", "四川省", "成都市", "锦江区"),
	ITEM510105("510105", "四川省", "成都市", "青羊区"),
	ITEM510106("510106", "四川省", "成都市", "金牛区"),
	ITEM510107("510107", "四川省", "成都市", "武侯区"),
	ITEM510108("510108", "四川省", "成都市", "成华区"),
	ITEM510112("510112", "四川省", "成都市", "龙泉驿区"),
	ITEM510113("510113", "四川省", "成都市", "青白江区"),
	ITEM510114("510114", "四川省", "成都市", "新都区"),
	ITEM510115("510115", "四川省", "成都市", "温江区"),
	ITEM510116("510116", "四川省", "成都市", "双流区"),
	ITEM510121("510121", "四川省", "成都市", "金堂县"),
	ITEM510124("510124", "四川省", "成都市", "郫县"),
	ITEM510129("510129", "四川省", "成都市", "大邑县"),
	ITEM510131("510131", "四川省", "成都市", "蒲江县"),
	ITEM510132("510132", "四川省", "成都市", "新津县"),
	ITEM510180("510180", "四川省", "成都市", "简阳市"),// 512081->510180, 资阳市->成都市
	ITEM510181("510181", "四川省", "成都市", "都江堰市"),
	ITEM510182("510182", "四川省", "成都市", "彭州市"),
	ITEM510183("510183", "四川省", "成都市", "邛崃市"),
	ITEM510184("510184", "四川省", "成都市", "崇州市"),
	ITEM510300("510300", "四川省", "自贡市", ""),
	ITEM510302("510302", "四川省", "自贡市", "自流井区"),
	ITEM510303("510303", "四川省", "自贡市", "贡井区"),
	ITEM510304("510304", "四川省", "自贡市", "大安区"),
	ITEM510311("510311", "四川省", "自贡市", "沿滩区"),
	ITEM510321("510321", "四川省", "自贡市", "荣县"),
	ITEM510322("510322", "四川省", "自贡市", "富顺县"),
	ITEM510400("510400", "四川省", "攀枝花市", ""),
	ITEM510402("510402", "四川省", "攀枝花市", "东区"),
	ITEM510403("510403", "四川省", "攀枝花市", "西区"),
	ITEM510411("510411", "四川省", "攀枝花市", "仁和区"),
	ITEM510421("510421", "四川省", "攀枝花市", "米易县"),
	ITEM510422("510422", "四川省", "攀枝花市", "盐边县"),
	ITEM510500("510500", "四川省", "泸州市", ""),
	ITEM510502("510502", "四川省", "泸州市", "江阳区"),
	ITEM510503("510503", "四川省", "泸州市", "纳溪区"),
	ITEM510504("510504", "四川省", "泸州市", "龙马潭区"),
	ITEM510521("510521", "四川省", "泸州市", "泸县"),
	ITEM510522("510522", "四川省", "泸州市", "合江县"),
	ITEM510524("510524", "四川省", "泸州市", "叙永县"),
	ITEM510525("510525", "四川省", "泸州市", "古蔺县"),
	ITEM510600("510600", "四川省", "德阳市", ""),
	ITEM510603("510603", "四川省", "德阳市", "旌阳区"),
	ITEM510623("510623", "四川省", "德阳市", "中江县"),
	ITEM510626("510626", "四川省", "德阳市", "罗江县"),
	ITEM510681("510681", "四川省", "德阳市", "广汉市"),
	ITEM510682("510682", "四川省", "德阳市", "什邡市"),
	ITEM510683("510683", "四川省", "德阳市", "绵竹市"),
	ITEM510700("510700", "四川省", "绵阳市", ""),
	ITEM510703("510703", "四川省", "绵阳市", "涪城区"),
	ITEM510704("510704", "四川省", "绵阳市", "游仙区"),
	ITEM510705("510705", "四川省", "绵阳市", "安州区"),
	ITEM510722("510722", "四川省", "绵阳市", "三台县"),
	ITEM510723("510723", "四川省", "绵阳市", "盐亭县"),
	ITEM510724("510724", "四川省", "绵阳市", "安县"),
	ITEM510725("510725", "四川省", "绵阳市", "梓潼县"),
	ITEM510726("510726", "四川省", "绵阳市", "北川羌族自治县"),
	ITEM510727("510727", "四川省", "绵阳市", "平武县"),
	ITEM510781("510781", "四川省", "绵阳市", "江油市"),
	ITEM510800("510800", "四川省", "广元市", ""),
	ITEM510802("510802", "四川省", "广元市", "利州区"),
	ITEM510811("510811", "四川省", "广元市", "昭化区"),
	ITEM510812("510812", "四川省", "广元市", "朝天区"),
	ITEM510821("510821", "四川省", "广元市", "旺苍县"),
	ITEM510822("510822", "四川省", "广元市", "青川县"),
	ITEM510823("510823", "四川省", "广元市", "剑阁县"),
	ITEM510824("510824", "四川省", "广元市", "苍溪县"),
	ITEM510900("510900", "四川省", "遂宁市", ""),
	ITEM510903("510903", "四川省", "遂宁市", "船山区"),
	ITEM510904("510904", "四川省", "遂宁市", "安居区"),
	ITEM510921("510921", "四川省", "遂宁市", "蓬溪县"),
	ITEM510922("510922", "四川省", "遂宁市", "射洪县"),
	ITEM510923("510923", "四川省", "遂宁市", "大英县"),
	ITEM511000("511000", "四川省", "内江市", ""),
	ITEM511002("511002", "四川省", "内江市", "市中区"),
	ITEM511011("511011", "四川省", "内江市", "东兴区"),
	ITEM511024("511024", "四川省", "内江市", "威远县"),
	ITEM511025("511025", "四川省", "内江市", "资中县"),
	ITEM511028("511028", "四川省", "内江市", "隆昌县"),
	ITEM511100("511100", "四川省", "乐山市", ""),
	ITEM511102("511102", "四川省", "乐山市", "市中区"),
	ITEM511111("511111", "四川省", "乐山市", "沙湾区"),
	ITEM511112("511112", "四川省", "乐山市", "五通桥区"),
	ITEM511113("511113", "四川省", "乐山市", "金口河区"),
	ITEM511123("511123", "四川省", "乐山市", "犍为县"),
	ITEM511124("511124", "四川省", "乐山市", "井研县"),
	ITEM511126("511126", "四川省", "乐山市", "夹江县"),
	ITEM511129("511129", "四川省", "乐山市", "沐川县"),
	ITEM511132("511132", "四川省", "乐山市", "峨边彝族自治县"),
	ITEM511133("511133", "四川省", "乐山市", "马边彝族自治县"),
	ITEM511181("511181", "四川省", "乐山市", "峨眉山市"),
	ITEM511300("511300", "四川省", "南充市", ""),
	ITEM511302("511302", "四川省", "南充市", "顺庆区"),
	ITEM511303("511303", "四川省", "南充市", "高坪区"),
	ITEM511304("511304", "四川省", "南充市", "嘉陵区"),
	ITEM511321("511321", "四川省", "南充市", "南部县"),
	ITEM511322("511322", "四川省", "南充市", "营山县"),
	ITEM511323("511323", "四川省", "南充市", "蓬安县"),
	ITEM511324("511324", "四川省", "南充市", "仪陇县"),
	ITEM511325("511325", "四川省", "南充市", "西充县"),
	ITEM511381("511381", "四川省", "南充市", "阆中市"),
	ITEM511400("511400", "四川省", "眉山市", ""),
	ITEM511402("511402", "四川省", "眉山市", "东坡区"),
	ITEM511403("511403", "四川省", "眉山市", "彭山区"),
	ITEM511421("511421", "四川省", "眉山市", "仁寿县"),
	ITEM511423("511423", "四川省", "眉山市", "洪雅县"),
	ITEM511424("511424", "四川省", "眉山市", "丹棱县"),
	ITEM511425("511425", "四川省", "眉山市", "青神县"),
	ITEM511500("511500", "四川省", "宜宾市", ""),
	ITEM511502("511502", "四川省", "宜宾市", "翠屏区"),
	ITEM511503("511503", "四川省", "宜宾市", "南溪区"),
	ITEM511521("511521", "四川省", "宜宾市", "宜宾县"),
	ITEM511523("511523", "四川省", "宜宾市", "江安县"),
	ITEM511524("511524", "四川省", "宜宾市", "长宁县"),
	ITEM511525("511525", "四川省", "宜宾市", "高县"),
	ITEM511526("511526", "四川省", "宜宾市", "珙县"),
	ITEM511527("511527", "四川省", "宜宾市", "筠连县"),
	ITEM511528("511528", "四川省", "宜宾市", "兴文县"),
	ITEM511529("511529", "四川省", "宜宾市", "屏山县"),
	ITEM511600("511600", "四川省", "广安市", ""),
	ITEM511602("511602", "四川省", "广安市", "广安区"),
	ITEM511603("511603", "四川省", "广安市", "前锋区"),
	ITEM511621("511621", "四川省", "广安市", "岳池县"),
	ITEM511622("511622", "四川省", "广安市", "武胜县"),
	ITEM511623("511623", "四川省", "广安市", "邻水县"),
	ITEM511681("511681", "四川省", "广安市", "华蓥市"),
	ITEM511700("511700", "四川省", "达州市", ""),
	ITEM511702("511702", "四川省", "达州市", "通川区"),
	ITEM511703("511703", "四川省", "达州市", "达川区"),
	ITEM511722("511722", "四川省", "达州市", "宣汉县"),
	ITEM511723("511723", "四川省", "达州市", "开江县"),
	ITEM511724("511724", "四川省", "达州市", "大竹县"),
	ITEM511725("511725", "四川省", "达州市", "渠县"),
	ITEM511781("511781", "四川省", "达州市", "万源市"),
	ITEM511800("511800", "四川省", "雅安市", ""),
	ITEM511802("511802", "四川省", "雅安市", "雨城区"),
	ITEM511803("511803", "四川省", "雅安市", "名山区"),
	ITEM511822("511822", "四川省", "雅安市", "荥经县"),
	ITEM511823("511823", "四川省", "雅安市", "汉源县"),
	ITEM511824("511824", "四川省", "雅安市", "石棉县"),
	ITEM511825("511825", "四川省", "雅安市", "天全县"),
	ITEM511826("511826", "四川省", "雅安市", "芦山县"),
	ITEM511827("511827", "四川省", "雅安市", "宝兴县"),
	ITEM511900("511900", "四川省", "巴中市", ""),
	ITEM511902("511902", "四川省", "巴中市", "巴州区"),
	ITEM511903("511903", "四川省", "巴中市", "恩阳区"),
	ITEM511921("511921", "四川省", "巴中市", "通江县"),
	ITEM511922("511922", "四川省", "巴中市", "南江县"),
	ITEM511923("511923", "四川省", "巴中市", "平昌县"),
	ITEM512000("512000", "四川省", "资阳市", ""),
	ITEM512002("512002", "四川省", "资阳市", "雁江区"),
	ITEM512021("512021", "四川省", "资阳市", "安岳县"),
	ITEM512022("512022", "四川省", "资阳市", "乐至县"),
	ITEM513200("513200", "四川省", "阿坝藏族羌族自治州", ""),
	ITEM513201("513201", "四川省", "阿坝藏族羌族自治州", "马尔康区"),
	ITEM513221("513221", "四川省", "阿坝藏族羌族自治州", "汶川县"),
	ITEM513222("513222", "四川省", "阿坝藏族羌族自治州", "理县"),
	ITEM513223("513223", "四川省", "阿坝藏族羌族自治州", "茂县"),
	ITEM513224("513224", "四川省", "阿坝藏族羌族自治州", "松潘县"),
	ITEM513225("513225", "四川省", "阿坝藏族羌族自治州", "九寨沟县"),
	ITEM513226("513226", "四川省", "阿坝藏族羌族自治州", "金川县"),
	ITEM513227("513227", "四川省", "阿坝藏族羌族自治州", "小金县"),
	ITEM513228("513228", "四川省", "阿坝藏族羌族自治州", "黑水县"),
	ITEM513230("513230", "四川省", "阿坝藏族羌族自治州", "壤塘县"),
	ITEM513231("513231", "四川省", "阿坝藏族羌族自治州", "阿坝县"),
	ITEM513232("513232", "四川省", "阿坝藏族羌族自治州", "若尔盖县"),
	ITEM513233("513233", "四川省", "阿坝藏族羌族自治州", "红原县"),
	ITEM513300("513300", "四川省", "甘孜藏族自治州", ""),
	ITEM513301("513301", "四川省", "甘孜藏族自治州", "康定市"),
	ITEM513322("513322", "四川省", "甘孜藏族自治州", "泸定县"),
	ITEM513323("513323", "四川省", "甘孜藏族自治州", "丹巴县"),
	ITEM513324("513324", "四川省", "甘孜藏族自治州", "九龙县"),
	ITEM513325("513325", "四川省", "甘孜藏族自治州", "雅江县"),
	ITEM513326("513326", "四川省", "甘孜藏族自治州", "道孚县"),
	ITEM513327("513327", "四川省", "甘孜藏族自治州", "炉霍县"),
	ITEM513328("513328", "四川省", "甘孜藏族自治州", "甘孜县"),
	ITEM513329("513329", "四川省", "甘孜藏族自治州", "新龙县"),
	ITEM513330("513330", "四川省", "甘孜藏族自治州", "德格县"),
	ITEM513331("513331", "四川省", "甘孜藏族自治州", "白玉县"),
	ITEM513332("513332", "四川省", "甘孜藏族自治州", "石渠县"),
	ITEM513333("513333", "四川省", "甘孜藏族自治州", "色达县"),
	ITEM513334("513334", "四川省", "甘孜藏族自治州", "理塘县"),
	ITEM513335("513335", "四川省", "甘孜藏族自治州", "巴塘县"),
	ITEM513336("513336", "四川省", "甘孜藏族自治州", "乡城县"),
	ITEM513337("513337", "四川省", "甘孜藏族自治州", "稻城县"),
	ITEM513338("513338", "四川省", "甘孜藏族自治州", "得荣县"),
	ITEM513400("513400", "四川省", "凉山彝族自治州", ""),
	ITEM513401("513401", "四川省", "凉山彝族自治州", "西昌市"),
	ITEM513422("513422", "四川省", "凉山彝族自治州", "木里藏族自治县"),
	ITEM513423("513423", "四川省", "凉山彝族自治州", "盐源县"),
	ITEM513424("513424", "四川省", "凉山彝族自治州", "德昌县"),
	ITEM513425("513425", "四川省", "凉山彝族自治州", "会理县"),
	ITEM513426("513426", "四川省", "凉山彝族自治州", "会东县"),
	ITEM513427("513427", "四川省", "凉山彝族自治州", "宁南县"),
	ITEM513428("513428", "四川省", "凉山彝族自治州", "普格县"),
	ITEM513429("513429", "四川省", "凉山彝族自治州", "布拖县"),
	ITEM513430("513430", "四川省", "凉山彝族自治州", "金阳县"),
	ITEM513431("513431", "四川省", "凉山彝族自治州", "昭觉县"),
	ITEM513432("513432", "四川省", "凉山彝族自治州", "喜德县"),
	ITEM513433("513433", "四川省", "凉山彝族自治州", "冕宁县"),
	ITEM513434("513434", "四川省", "凉山彝族自治州", "越西县"),
	ITEM513435("513435", "四川省", "凉山彝族自治州", "甘洛县"),
	ITEM513436("513436", "四川省", "凉山彝族自治州", "美姑县"),
	ITEM513437("513437", "四川省", "凉山彝族自治州", "雷波县"),
	
	ITEM520000("520000", "贵州省", "", ""),
	ITEM520100("520100", "贵州省", "贵阳市", ""),
	ITEM520102("520102", "贵州省", "贵阳市", "南明区"),
	ITEM520103("520103", "贵州省", "贵阳市", "云岩区"),
	ITEM520111("520111", "贵州省", "贵阳市", "花溪区"),
	ITEM520112("520112", "贵州省", "贵阳市", "乌当区"),
	ITEM520113("520113", "贵州省", "贵阳市", "白云区"),
	ITEM520115("520115", "贵州省", "贵阳市", "观山湖区"),
	ITEM520121("520121", "贵州省", "贵阳市", "开阳县"),
	ITEM520122("520122", "贵州省", "贵阳市", "息烽县"),
	ITEM520123("520123", "贵州省", "贵阳市", "修文县"),
	ITEM520181("520181", "贵州省", "贵阳市", "清镇市"),
	ITEM520200("520200", "贵州省", "六盘水市", ""),
	ITEM520201("520201", "贵州省", "六盘水市", "钟山区"),
	ITEM520203("520203", "贵州省", "六盘水市", "六枝特区"),
	ITEM520221("520221", "贵州省", "六盘水市", "水城县"),
	ITEM520222("520222", "贵州省", "六盘水市", "盘县"),
	ITEM520300("520300", "贵州省", "遵义市", ""),
	ITEM520302("520302", "贵州省", "遵义市", "红花岗区"),
	ITEM520303("520303", "贵州省", "遵义市", "汇川区"),
	ITEM520321("520321", "贵州省", "遵义市", "遵义县"),
	ITEM520322("520322", "贵州省", "遵义市", "桐梓县"),
	ITEM520323("520323", "贵州省", "遵义市", "绥阳县"),
	ITEM520324("520324", "贵州省", "遵义市", "正安县"),
	ITEM520325("520325", "贵州省", "遵义市", "道真仡佬族苗族自治县"),
	ITEM520326("520326", "贵州省", "遵义市", "务川仡佬族苗族自治县"),
	ITEM520327("520327", "贵州省", "遵义市", "凤冈县"),
	ITEM520328("520328", "贵州省", "遵义市", "湄潭县"),
	ITEM520329("520329", "贵州省", "遵义市", "余庆县"),
	ITEM520330("520330", "贵州省", "遵义市", "习水县"),
	ITEM520381("520381", "贵州省", "遵义市", "赤水市"),
	ITEM520382("520382", "贵州省", "遵义市", "仁怀市"),
	ITEM520400("520400", "贵州省", "安顺市", ""),
	ITEM520402("520402", "贵州省", "安顺市", "西秀区"),
	ITEM520403("520403", "贵州省", "安顺市", "平坝区"),
	ITEM520422("520422", "贵州省", "安顺市", "普定县"),
	ITEM520423("520423", "贵州省", "安顺市", "镇宁布依族苗族自治县"),
	ITEM520424("520424", "贵州省", "安顺市", "关岭布依族苗族自治县"),
	ITEM520425("520425", "贵州省", "安顺市", "紫云苗族布依族自治县"),
	ITEM520500("520500", "贵州省", "毕节市", ""),
	ITEM520502("520502", "贵州省", "毕节市", "七星关区"),
	ITEM520521("520521", "贵州省", "毕节市", "大方县"),
	ITEM520522("520522", "贵州省", "毕节市", "黔西县"),
	ITEM520523("520523", "贵州省", "毕节市", "金沙县"),
	ITEM520524("520524", "贵州省", "毕节市", "织金县"),
	ITEM520525("520525", "贵州省", "毕节市", "纳雍县"),
	ITEM520526("520526", "贵州省", "毕节市", "威宁彝族回族苗族自治县"),
	ITEM520527("520527", "贵州省", "毕节市", "赫章县"),
	ITEM520600("520600", "贵州省", "铜仁市", ""),
	ITEM520602("520602", "贵州省", "铜仁市", "碧江区"),
	ITEM520603("520603", "贵州省", "铜仁市", "万山区"),
	ITEM520621("520621", "贵州省", "铜仁市", "江口县"),
	ITEM520622("520622", "贵州省", "铜仁市", "玉屏侗族自治县"),
	ITEM520623("520623", "贵州省", "铜仁市", "石阡县"),
	ITEM520624("520624", "贵州省", "铜仁市", "思南县"),
	ITEM520625("520625", "贵州省", "铜仁市", "印江土家族苗族自治县"),
	ITEM520626("520626", "贵州省", "铜仁市", "德江县"),
	ITEM520627("520627", "贵州省", "铜仁市", "沿河土家族自治县"),
	ITEM520628("520628", "贵州省", "铜仁市", "松桃苗族自治县"),
	ITEM522300("522300", "贵州省", "黔西南布依族苗族自治州", ""),
	ITEM522301("522301", "贵州省", "黔西南布依族苗族自治州", "兴义市"),
	ITEM522322("522322", "贵州省", "黔西南布依族苗族自治州", "兴仁县"),
	ITEM522323("522323", "贵州省", "黔西南布依族苗族自治州", "普安县"),
	ITEM522324("522324", "贵州省", "黔西南布依族苗族自治州", "晴隆县"),
	ITEM522325("522325", "贵州省", "黔西南布依族苗族自治州", "贞丰县"),
	ITEM522326("522326", "贵州省", "黔西南布依族苗族自治州", "望谟县"),
	ITEM522327("522327", "贵州省", "黔西南布依族苗族自治州", "册亨县"),
	ITEM522328("522328", "贵州省", "黔西南布依族苗族自治州", "安龙县"),
	ITEM522600("522600", "贵州省", "黔东南苗族侗族自治州", ""),
	ITEM522601("522601", "贵州省", "黔东南苗族侗族自治州", "凯里市"),
	ITEM522622("522622", "贵州省", "黔东南苗族侗族自治州", "黄平县"),
	ITEM522623("522623", "贵州省", "黔东南苗族侗族自治州", "施秉县"),
	ITEM522624("522624", "贵州省", "黔东南苗族侗族自治州", "三穗县"),
	ITEM522625("522625", "贵州省", "黔东南苗族侗族自治州", "镇远县"),
	ITEM522626("522626", "贵州省", "黔东南苗族侗族自治州", "岑巩县"),
	ITEM522627("522627", "贵州省", "黔东南苗族侗族自治州", "天柱县"),
	ITEM522628("522628", "贵州省", "黔东南苗族侗族自治州", "锦屏县"),
	ITEM522629("522629", "贵州省", "黔东南苗族侗族自治州", "剑河县"),
	ITEM522630("522630", "贵州省", "黔东南苗族侗族自治州", "台江县"),
	ITEM522631("522631", "贵州省", "黔东南苗族侗族自治州", "黎平县"),
	ITEM522632("522632", "贵州省", "黔东南苗族侗族自治州", "榕江县"),
	ITEM522633("522633", "贵州省", "黔东南苗族侗族自治州", "从江县"),
	ITEM522634("522634", "贵州省", "黔东南苗族侗族自治州", "雷山县"),
	ITEM522635("522635", "贵州省", "黔东南苗族侗族自治州", "麻江县"),
	ITEM522636("522636", "贵州省", "黔东南苗族侗族自治州", "丹寨县"),
	ITEM522700("522700", "贵州省", "黔南布依族苗族自治州", ""),
	ITEM522701("522701", "贵州省", "黔南布依族苗族自治州", "都匀市"),
	ITEM522702("522702", "贵州省", "黔南布依族苗族自治州", "福泉市"),
	ITEM522722("522722", "贵州省", "黔南布依族苗族自治州", "荔波县"),
	ITEM522723("522723", "贵州省", "黔南布依族苗族自治州", "贵定县"),
	ITEM522725("522725", "贵州省", "黔南布依族苗族自治州", "瓮安县"),
	ITEM522726("522726", "贵州省", "黔南布依族苗族自治州", "独山县"),
	ITEM522727("522727", "贵州省", "黔南布依族苗族自治州", "平塘县"),
	ITEM522728("522728", "贵州省", "黔南布依族苗族自治州", "罗甸县"),
	ITEM522729("522729", "贵州省", "黔南布依族苗族自治州", "长顺县"),
	ITEM522730("522730", "贵州省", "黔南布依族苗族自治州", "龙里县"),
	ITEM522731("522731", "贵州省", "黔南布依族苗族自治州", "惠水县"),
	ITEM522732("522732", "贵州省", "黔南布依族苗族自治州", "三都水族自治县"),
	
	ITEM530000("530000", "云南省", "", ""),
	ITEM530100("530100", "云南省", "昆明市", ""),
	ITEM530102("530102", "云南省", "昆明市", "五华区"),
	ITEM530103("530103", "云南省", "昆明市", "盘龙区"),
	ITEM530111("530111", "云南省", "昆明市", "官渡区"),
	ITEM530112("530112", "云南省", "昆明市", "西山区"),
	ITEM530113("530113", "云南省", "昆明市", "东川区"),
	ITEM530114("530114", "云南省", "昆明市", "呈贡区"),
	ITEM530122("530122", "云南省", "昆明市", "晋宁县"),
	ITEM530124("530124", "云南省", "昆明市", "富民县"),
	ITEM530125("530125", "云南省", "昆明市", "宜良县"),
	ITEM530126("530126", "云南省", "昆明市", "石林彝族自治县"),
	ITEM530127("530127", "云南省", "昆明市", "嵩明县"),
	ITEM530128("530128", "云南省", "昆明市", "禄劝彝族苗族自治县"),
	ITEM530129("530129", "云南省", "昆明市", "寻甸回族彝族自治县"),
	ITEM530181("530181", "云南省", "昆明市", "安宁市"),
	ITEM530300("530300", "云南省", "曲靖市", ""),
	ITEM530302("530302", "云南省", "曲靖市", "麒麟区"),
	ITEM530303("530303", "云南省", "曲靖市", "沾益区"),
	ITEM530321("530321", "云南省", "曲靖市", "马龙县"),
	ITEM530322("530322", "云南省", "曲靖市", "陆良县"),
	ITEM530323("530323", "云南省", "曲靖市", "师宗县"),
	ITEM530324("530324", "云南省", "曲靖市", "罗平县"),
	ITEM530325("530325", "云南省", "曲靖市", "富源县"),
	ITEM530326("530326", "云南省", "曲靖市", "会泽县"),
	ITEM530381("530381", "云南省", "曲靖市", "宣威市"),
	ITEM530400("530400", "云南省", "玉溪市", ""),
	ITEM530402("530402", "云南省", "玉溪市", "红塔区"),
	ITEM530403("530403", "云南省", "玉溪市", "江川区"),
	ITEM530422("530422", "云南省", "玉溪市", "澄江县"),
	ITEM530423("530423", "云南省", "玉溪市", "通海县"),
	ITEM530424("530424", "云南省", "玉溪市", "华宁县"),
	ITEM530425("530425", "云南省", "玉溪市", "易门县"),
	ITEM530426("530426", "云南省", "玉溪市", "峨山彝族自治县"),
	ITEM530427("530427", "云南省", "玉溪市", "新平彝族傣族自治县"),
	ITEM530428("530428", "云南省", "玉溪市", "元江哈尼族彝族傣族自治县"),
	ITEM530500("530500", "云南省", "保山市", ""),
	ITEM530502("530502", "云南省", "保山市", "隆阳区"),
	ITEM530521("530521", "云南省", "保山市", "施甸县"),
	ITEM530581("530581", "云南省", "保山市", "腾冲市"),
	ITEM530523("530523", "云南省", "保山市", "龙陵县"),
	ITEM530524("530524", "云南省", "保山市", "昌宁县"),
	ITEM530600("530600", "云南省", "昭通市", ""),
	ITEM530602("530602", "云南省", "昭通市", "昭阳区"),
	ITEM530621("530621", "云南省", "昭通市", "鲁甸县"),
	ITEM530622("530622", "云南省", "昭通市", "巧家县"),
	ITEM530623("530623", "云南省", "昭通市", "盐津县"),
	ITEM530624("530624", "云南省", "昭通市", "大关县"),
	ITEM530625("530625", "云南省", "昭通市", "永善县"),
	ITEM530626("530626", "云南省", "昭通市", "绥江县"),
	ITEM530627("530627", "云南省", "昭通市", "镇雄县"),
	ITEM530628("530628", "云南省", "昭通市", "彝良县"),
	ITEM530629("530629", "云南省", "昭通市", "威信县"),
	ITEM530630("530630", "云南省", "昭通市", "水富县"),
	ITEM530700("530700", "云南省", "丽江市", ""),
	ITEM530702("530702", "云南省", "丽江市", "古城区"),
	ITEM530721("530721", "云南省", "丽江市", "玉龙纳西族自治县"),
	ITEM530722("530722", "云南省", "丽江市", "永胜县"),
	ITEM530723("530723", "云南省", "丽江市", "华坪县"),
	ITEM530724("530724", "云南省", "丽江市", "宁蒗彝族自治县"),
	ITEM530800("530800", "云南省", "普洱市", ""),
	ITEM530802("530802", "云南省", "普洱市", "思茅区"),
	ITEM530821("530821", "云南省", "普洱市", "宁洱哈尼族彝族自治县"),
	ITEM530822("530822", "云南省", "普洱市", "墨江哈尼族自治县"),
	ITEM530823("530823", "云南省", "普洱市", "景东彝族自治县"),
	ITEM530824("530824", "云南省", "普洱市", "景谷傣族彝族自治县"),
	ITEM530825("530825", "云南省", "普洱市", "镇沅彝族哈尼族拉祜族自治县"),
	ITEM530826("530826", "云南省", "普洱市", "江城哈尼族彝族自治县"),
	ITEM530827("530827", "云南省", "普洱市", "孟连傣族拉祜族佤族自治县"),
	ITEM530828("530828", "云南省", "普洱市", "澜沧拉祜族自治县"),
	ITEM530829("530829", "云南省", "普洱市", "西盟佤族自治县"),
	ITEM530900("530900", "云南省", "临沧市", ""),
	ITEM530902("530902", "云南省", "临沧市", "临翔区"),
	ITEM530921("530921", "云南省", "临沧市", "凤庆县"),
	ITEM530922("530922", "云南省", "临沧市", "云县"),
	ITEM530923("530923", "云南省", "临沧市", "永德县"),
	ITEM530924("530924", "云南省", "临沧市", "镇康县"),
	ITEM530925("530925", "云南省", "临沧市", "双江拉祜族佤族布朗族傣族自治县"),
	ITEM530926("530926", "云南省", "临沧市", "耿马傣族佤族自治县"),
	ITEM530927("530927", "云南省", "临沧市", "沧源佤族自治县"),
	ITEM532300("532300", "云南省", "楚雄彝族自治州", ""),
	ITEM532301("532301", "云南省", "楚雄彝族自治州", "楚雄市"),
	ITEM532322("532322", "云南省", "楚雄彝族自治州", "双柏县"),
	ITEM532323("532323", "云南省", "楚雄彝族自治州", "牟定县"),
	ITEM532324("532324", "云南省", "楚雄彝族自治州", "南华县"),
	ITEM532325("532325", "云南省", "楚雄彝族自治州", "姚安县"),
	ITEM532326("532326", "云南省", "楚雄彝族自治州", "大姚县"),
	ITEM532327("532327", "云南省", "楚雄彝族自治州", "永仁县"),
	ITEM532328("532328", "云南省", "楚雄彝族自治州", "元谋县"),
	ITEM532329("532329", "云南省", "楚雄彝族自治州", "武定县"),
	ITEM532331("532331", "云南省", "楚雄彝族自治州", "禄丰县"),
	ITEM532500("532500", "云南省", "红河哈尼族彝族自治州", ""),
	ITEM532501("532501", "云南省", "红河哈尼族彝族自治州", "个旧市"),
	ITEM532502("532502", "云南省", "红河哈尼族彝族自治州", "开远市"),
	ITEM532503("532503", "云南省", "红河哈尼族彝族自治州", "蒙自市"),
	ITEM532504("532504", "云南省", "红河哈尼族彝族自治州", "弥勒市"),
	ITEM532523("532523", "云南省", "红河哈尼族彝族自治州", "屏边苗族自治县"),
	ITEM532524("532524", "云南省", "红河哈尼族彝族自治州", "建水县"),
	ITEM532525("532525", "云南省", "红河哈尼族彝族自治州", "石屏县"),
	ITEM532527("532527", "云南省", "红河哈尼族彝族自治州", "泸西县"),
	ITEM532528("532528", "云南省", "红河哈尼族彝族自治州", "元阳县"),
	ITEM532529("532529", "云南省", "红河哈尼族彝族自治州", "红河县"),
	ITEM532530("532530", "云南省", "红河哈尼族彝族自治州", "金平苗族瑶族傣族自治县"),
	ITEM532531("532531", "云南省", "红河哈尼族彝族自治州", "绿春县"),
	ITEM532532("532532", "云南省", "红河哈尼族彝族自治州", "河口瑶族自治县"),
	ITEM532600("532600", "云南省", "文山壮族苗族自治州", ""),
	ITEM532601("532601", "云南省", "文山壮族苗族自治州", "文山市"),
	ITEM532622("532622", "云南省", "文山壮族苗族自治州", "砚山县"),
	ITEM532623("532623", "云南省", "文山壮族苗族自治州", "西畴县"),
	ITEM532624("532624", "云南省", "文山壮族苗族自治州", "麻栗坡县"),
	ITEM532625("532625", "云南省", "文山壮族苗族自治州", "马关县"),
	ITEM532626("532626", "云南省", "文山壮族苗族自治州", "丘北县"),
	ITEM532627("532627", "云南省", "文山壮族苗族自治州", "广南县"),
	ITEM532628("532628", "云南省", "文山壮族苗族自治州", "富宁县"),
	ITEM532800("532800", "云南省", "西双版纳傣族自治州", ""),
	ITEM532801("532801", "云南省", "西双版纳傣族自治州", "景洪市"),
	ITEM532822("532822", "云南省", "西双版纳傣族自治州", "勐海县"),
	ITEM532823("532823", "云南省", "西双版纳傣族自治州", "勐腊县"),
	ITEM532900("532900", "云南省", "大理白族自治州", ""),
	ITEM532901("532901", "云南省", "大理白族自治州", "大理市"),
	ITEM532922("532922", "云南省", "大理白族自治州", "漾濞彝族自治县"),
	ITEM532923("532923", "云南省", "大理白族自治州", "祥云县"),
	ITEM532924("532924", "云南省", "大理白族自治州", "宾川县"),
	ITEM532925("532925", "云南省", "大理白族自治州", "弥渡县"),
	ITEM532926("532926", "云南省", "大理白族自治州", "南涧彝族自治县"),
	ITEM532927("532927", "云南省", "大理白族自治州", "巍山彝族回族自治县"),
	ITEM532928("532928", "云南省", "大理白族自治州", "永平县"),
	ITEM532929("532929", "云南省", "大理白族自治州", "云龙县"),
	ITEM532930("532930", "云南省", "大理白族自治州", "洱源县"),
	ITEM532931("532931", "云南省", "大理白族自治州", "剑川县"),
	ITEM532932("532932", "云南省", "大理白族自治州", "鹤庆县"),
	ITEM533100("533100", "云南省", "德宏傣族景颇族自治州", ""),
	ITEM533102("533102", "云南省", "德宏傣族景颇族自治州", "瑞丽市"),
	ITEM533103("533103", "云南省", "德宏傣族景颇族自治州", "芒市"),
	ITEM533122("533122", "云南省", "德宏傣族景颇族自治州", "梁河县"),
	ITEM533123("533123", "云南省", "德宏傣族景颇族自治州", "盈江县"),
	ITEM533124("533124", "云南省", "德宏傣族景颇族自治州", "陇川县"),
	ITEM533300("533300", "云南省", "怒江傈僳族自治州", ""),
	ITEM533301("533301", "云南省", "怒江傈僳族自治州", "泸水市"),// 533321->533301, 泸水县->泸水市
	ITEM533323("533323", "云南省", "怒江傈僳族自治州", "福贡县"),
	ITEM533324("533324", "云南省", "怒江傈僳族自治州", "贡山独龙族怒族自治县"),
	ITEM533325("533325", "云南省", "怒江傈僳族自治州", "兰坪白族普米族自治县"),
	ITEM533400("533400", "云南省", "迪庆藏族自治州", ""),
	ITEM533401("533401", "云南省", "迪庆藏族自治州", "香格里拉市"),
	ITEM533422("533422", "云南省", "迪庆藏族自治州", "德钦县"),
	ITEM533423("533423", "云南省", "迪庆藏族自治州", "维西傈僳族自治县"),
	
	ITEM540000("540000", "西藏自治区", "", ""),
	ITEM540100("540100", "西藏自治区", "拉萨市", ""),
	ITEM540102("540102", "西藏自治区", "拉萨市", "城关区"),
	ITEM540103("540103", "西藏自治区", "拉萨市", "堆龙德庆区"),
	ITEM540121("540121", "西藏自治区", "拉萨市", "林周县"),
	ITEM540122("540122", "西藏自治区", "拉萨市", "当雄县"),
	ITEM540123("540123", "西藏自治区", "拉萨市", "尼木县"),
	ITEM540124("540124", "西藏自治区", "拉萨市", "曲水县"),
	ITEM540126("540126", "西藏自治区", "拉萨市", "达孜县"),
	ITEM540127("540127", "西藏自治区", "拉萨市", "墨竹工卡县"),
	ITEM540200("540200", "西藏自治区", "日喀则市", ""),
	ITEM540202("540202", "西藏自治区", "日喀则市", "桑珠孜区"),
	ITEM540221("540221", "西藏自治区", "日喀则市", "南木林县"),
	ITEM540222("540222", "西藏自治区", "日喀则市", "江孜县"),
	ITEM540223("540223", "西藏自治区", "日喀则市", "定日县"),
	ITEM540224("540224", "西藏自治区", "日喀则市", "萨迦县"),
	ITEM540225("540225", "西藏自治区", "日喀则市", "拉孜县"),
	ITEM540226("540226", "西藏自治区", "日喀则市", "昂仁县"),
	ITEM540227("540227", "西藏自治区", "日喀则市", "谢通门县"),
	ITEM540228("540228", "西藏自治区", "日喀则市", "白朗县"),
	ITEM540229("540229", "西藏自治区", "日喀则市", "仁布县"),
	ITEM540230("540230", "西藏自治区", "日喀则市", "康马县"),
	ITEM540231("540231", "西藏自治区", "日喀则市", "定结县"),
	ITEM540232("540232", "西藏自治区", "日喀则市", "仲巴县"),
	ITEM540233("540233", "西藏自治区", "日喀则市", "亚东县"),
	ITEM540234("540234", "西藏自治区", "日喀则市", "吉隆县"),
	ITEM540235("540235", "西藏自治区", "日喀则市", "聂拉木县"),
	ITEM540236("540236", "西藏自治区", "日喀则市", "萨嘎县"),
	ITEM540237("540237", "西藏自治区", "日喀则市", "岗巴县"),
	ITEM540300("540300", "西藏自治区", "昌都市", ""),
	ITEM540302("540302", "西藏自治区", "昌都市", "卡若区"),
	ITEM540321("540321", "西藏自治区", "昌都市", "江达县"),
	ITEM540322("540322", "西藏自治区", "昌都市", "贡觉县"),
	ITEM540323("540323", "西藏自治区", "昌都市", "类乌齐县"),
	ITEM540324("540324", "西藏自治区", "昌都市", "丁青县"),
	ITEM540325("540325", "西藏自治区", "昌都市", "察雅县"),
	ITEM540326("540326", "西藏自治区", "昌都市", "八宿县"),
	ITEM540327("540327", "西藏自治区", "昌都市", "左贡县"),
	ITEM540328("540328", "西藏自治区", "昌都市", "芒康县"),
	ITEM540329("540329", "西藏自治区", "昌都市", "洛隆县"),
	ITEM540330("540330", "西藏自治区", "昌都市", "边坝县"),
	ITEM540400("540400", "西藏自治区", "林芝市", ""),
	ITEM540402("540402", "西藏自治区", "林芝市", "巴宜区"),
	ITEM540421("540421", "西藏自治区", "林芝市", "工布江达县"),
	ITEM540422("540422", "西藏自治区", "林芝市", "米林县"),
	ITEM540423("540423", "西藏自治区", "林芝市", "墨脱县"),
	ITEM540424("540424", "西藏自治区", "林芝市", "波密县"),
	ITEM540425("540425", "西藏自治区", "林芝市", "察隅县"),
	ITEM540426("540426", "西藏自治区", "林芝市", "朗县"),
	ITEM540500("540500", "西藏自治区", "山南市", ""),// 542200->540500, 山南地区->山南市
	ITEM540502("540502", "西藏自治区", "山南市", "乃东区"),// 542221->540502, 山南地区->山南市, 乃东县->乃东区
	ITEM540521("540521", "西藏自治区", "山南市", "扎囊县"),// 542222->540521, 山南地区->山南市
	ITEM540522("540522", "西藏自治区", "山南市", "贡嘎县"),// 542223->540522, 山南地区->山南市
	ITEM540523("540523", "西藏自治区", "山南市", "桑日县"),// 542224->540523, 山南地区->山南市
	ITEM540524("540524", "西藏自治区", "山南市", "琼结县"),// 542225->540524, 山南地区->山南市
	ITEM540525("540525", "西藏自治区", "山南市", "曲松县"),// 542226->540525, 山南地区->山南市
	ITEM540526("540526", "西藏自治区", "山南市", "措美县"),// 542227->540526, 山南地区->山南市
	ITEM540527("540527", "西藏自治区", "山南市", "洛扎县"),// 542228->540527, 山南地区->山南市
	ITEM540528("540528", "西藏自治区", "山南市", "加查县"),// 542229->540528, 山南地区->山南市
	ITEM540529("540529", "西藏自治区", "山南市", "隆子县"),// 542231->540529, 山南地区->山南市
	ITEM540530("540530", "西藏自治区", "山南市", "错那县"),// 542232->540530, 山南地区->山南市
	ITEM540531("540531", "西藏自治区", "山南市", "浪卡子县"),// 542233->540531, 山南地区->山南市
	ITEM542400("542400", "西藏自治区", "那曲地区", ""),
	ITEM542421("542421", "西藏自治区", "那曲地区", "那曲县"),
	ITEM542422("542422", "西藏自治区", "那曲地区", "嘉黎县"),
	ITEM542423("542423", "西藏自治区", "那曲地区", "比如县"),
	ITEM542424("542424", "西藏自治区", "那曲地区", "聂荣县"),
	ITEM542425("542425", "西藏自治区", "那曲地区", "安多县"),
	ITEM542426("542426", "西藏自治区", "那曲地区", "申扎县"),
	ITEM542427("542427", "西藏自治区", "那曲地区", "索县"),
	ITEM542428("542428", "西藏自治区", "那曲地区", "班戈县"),
	ITEM542429("542429", "西藏自治区", "那曲地区", "巴青县"),
	ITEM542430("542430", "西藏自治区", "那曲地区", "尼玛县"),
	ITEM542431("542431", "西藏自治区", "那曲地区", "双湖县"),
	ITEM542500("542500", "西藏自治区", "阿里地区", ""),
	ITEM542521("542521", "西藏自治区", "阿里地区", "普兰县"),
	ITEM542522("542522", "西藏自治区", "阿里地区", "札达县"),
	ITEM542523("542523", "西藏自治区", "阿里地区", "噶尔县"),
	ITEM542524("542524", "西藏自治区", "阿里地区", "日土县"),
	ITEM542525("542525", "西藏自治区", "阿里地区", "革吉县"),
	ITEM542526("542526", "西藏自治区", "阿里地区", "改则县"),
	ITEM542527("542527", "西藏自治区", "阿里地区", "措勤县"),
	;

	private String code;
	private String firstDistrict;
	private String secondDistrict;
	private String thirdDistrict;

	private ChinaSouthwestAreaCodeEnum(String code, String firstDistrict, String secondDistrict, String thirdDistrict) {
		this.code = code;
		this.firstDistrict = firstDistrict;
		this.secondDistrict = secondDistrict;
		this.thirdDistrict = thirdDistrict;
	}

	public String getCode() {
		return code;
	}

	public String getFirstDistrict() {
		return firstDistrict;
	}

	public String getSecondDistrict() {
		return secondDistrict;
	}
	
	public String getThirdDistrict() {
		return thirdDistrict;
	}
	
	public String getFullName() {
		
		return firstDistrict.concat(secondDistrict).concat(thirdDistrict);
	}
	
	public static Map<Object, Object> getResult(String code) {

		if (ValidatorUtil.isAreaCode(code)) {

			for (ChinaSouthwestAreaCodeEnum e : ChinaSouthwestAreaCodeEnum.values()) {

				if (code.equals(e.getCode())) {

					return getResult(e);
				}
			}
		}
		return null;
	}
	
	public static String getCode(String name) {
		
		if (ValidatorUtil.isNotEmptyIgnoreBlank(name)) {
			
			String fullName = null;
			for (ChinaSouthwestAreaCodeEnum e : ChinaSouthwestAreaCodeEnum.values()) {
				
				fullName = e.getFirstDistrict().concat(e.getSecondDistrict()).concat(e.getThirdDistrict());
				if (fullName.equals(name)) {
					
					return e.getCode();
				}
			}
		}
		return null;
	}
	
	public static String getName(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaSouthwestAreaCodeEnum e : ChinaSouthwestAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return getName(e);
				}
			}
		}
		return null;
	}
	
	public static String getFullName(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaSouthwestAreaCodeEnum e : ChinaSouthwestAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return e.getFirstDistrict().concat(e.getSecondDistrict()).concat(e.getThirdDistrict());
				}
			}
		}
		return null;
	}
	
	public static String matchCode(String name) {
		
		final String REGEX = "自治区|藏族羌族自治州|布依族苗族自治州|苗族侗族自治州|哈尼族彝族自治州|壮族苗族自治州|傣族景颇族自治州|傈僳族自治州|傣族自治州|白族自治州|藏族自治州|彝族自治州|地区|拉祜族佤族布朗族傣族自治县|彝族回族苗族自治县|哈尼族彝族傣族自治县|彝族哈尼族拉祜族自治县|傣族拉祜族佤族自治县|苗族瑶族傣族自治县|土家族苗族自治县|苗族土家族自治县|仡佬族苗族自治县|布依族苗族自治县|苗族布依族自治县|彝族苗族自治县|回族彝族自治县|彝族傣族自治县|哈尼族彝族自治县|傣族彝族自治县|傣族佤族自治县|彝族回族自治县|独龙族怒族自治县|白族普米族自治县|纳西族自治县|土家族自治县|羌族自治县|彝族自治县|藏族自治县|侗族自治县|苗族自治县|水族自治县|哈尼族自治县|拉祜族自治县|佤族自治县|瑶族自治县|傈僳族自治县|省|市|区|县";
		String code = null;
		String str1 = null;
		String str2 = null;
		String str3 = null;
		Map<String, String> map1 = new HashMap<String, String>();
		Map<String, String> map2 = new LinkedHashMap<String, String>();
		Map<String, String> map3 = new HashMap<String, String>();
		if (ValidatorUtil.isNotEmptyIgnoreBlank(name)) {
			
			code = matchSpecial(name);
			if (null == code) {
				
				for (ChinaSouthwestAreaCodeEnum e : ChinaSouthwestAreaCodeEnum.values()) {
					
					str1 = e.getFirstDistrict();
					str2 = e.getSecondDistrict();
					str3 = e.getThirdDistrict();
					if (ValidatorUtil.isNotEmpty(str3)) {
						
						map3.put(e.getCode(), (str1.concat(str2).concat(str3)).replaceAll(REGEX, ""));
						map2.put(e.getCode(), (str1.concat(str3)).replaceAll(REGEX, ""));
					}
					if (ValidatorUtil.isEmpty(str3) && ValidatorUtil.isNotEmpty(str2)) {
						
						map2.put(e.getCode(), (str1.concat(str2)).replaceAll(REGEX, ""));
					}
					if (ValidatorUtil.isAllEmpty(str2, str3)) {
						
						map1.put(e.getCode(), str1.replaceAll(REGEX, ""));
					}
				}
				
				name = name.replaceAll(REGEX, "");
				code = getCode(name, map1, map2, map3);
				if (null == code) {
					
					name = name.replaceAll("(?s)(.)(?=.*\\1)", "");
					code = getCode(name, map1, map2, map3);
				}
			}
		}
		return code;
	}
	
	private static String getCode(String name, Map<String, String> map1, Map<String, String> map2, Map<String, String> map3) {
		
		String code = matchCode(name, map3);
		if (null == code) {
			
			code = matchCode(name, map2);
		}
		if (null == code) {
			
			code = matchCode(name, map1);
		}
		return code;
	}
	
	private static String matchCode(String name, Map<String, String> map) {
		
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.equals(entry.getValue())) {
				
				return entry.getKey();
			}
		}
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.startsWith(entry.getValue())) {
				
				return entry.getKey();
			}
		}
		return null;
	}
	
	private static String matchSpecial(String name) {
		
		if (name.startsWith("四川")) {
			
			if (name.contains(ChinaSouthwestAreaCodeEnum.ITEM511521.getThirdDistrict())) {
				// 四川省宜宾市宜宾县
				return ChinaSouthwestAreaCodeEnum.ITEM511521.getCode();
			}
			if (name.contains(ChinaSouthwestAreaCodeEnum.ITEM511602.getThirdDistrict())) {
				// 四川省广安市广安区
				return ChinaSouthwestAreaCodeEnum.ITEM511602.getCode();
			}
			if (name.contains(ChinaSouthwestAreaCodeEnum.ITEM513231.getThirdDistrict())) {
				// 四川省阿坝藏族羌族自治州阿坝县
				return ChinaSouthwestAreaCodeEnum.ITEM513231.getCode();
			}
			if (name.contains(ChinaSouthwestAreaCodeEnum.ITEM513328.getThirdDistrict())) {
				// 四川省甘孜藏族自治州甘孜县
				return ChinaSouthwestAreaCodeEnum.ITEM513328.getCode();
			}
		}
		if (name.startsWith("贵州")) {
			
			if (name.contains(ChinaSouthwestAreaCodeEnum.ITEM520321.getThirdDistrict())) {
				// 贵州省遵义市遵义县
				return ChinaSouthwestAreaCodeEnum.ITEM520321.getCode();
			}
		}
		if (name.startsWith("云南")) {
			
			if (name.contains(ChinaSouthwestAreaCodeEnum.ITEM532301.getThirdDistrict())) {
				// 云南省楚雄彝族自治州楚雄市
				return ChinaSouthwestAreaCodeEnum.ITEM532301.getCode();
			}
			if (name.contains(ChinaSouthwestAreaCodeEnum.ITEM532529.getThirdDistrict())) {
				// 云南省红河哈尼族彝族自治州红河县
				return ChinaSouthwestAreaCodeEnum.ITEM532529.getCode();
			}
			if (name.contains(ChinaSouthwestAreaCodeEnum.ITEM532601.getThirdDistrict())) {
				// 云南省文山壮族苗族自治州文山市
				return ChinaSouthwestAreaCodeEnum.ITEM532601.getCode();
			}
			if (name.contains(ChinaSouthwestAreaCodeEnum.ITEM532901.getThirdDistrict())) {
				// 云南省大理白族自治州大理市
				return ChinaSouthwestAreaCodeEnum.ITEM532901.getCode();
			}
		}
		if (name.startsWith("西藏")) {
			
			if (name.contains(ChinaSouthwestAreaCodeEnum.ITEM542421.getThirdDistrict())) {
				// 西藏自治区那曲地区那曲县
				return ChinaSouthwestAreaCodeEnum.ITEM542421.getCode();
			}
		}
		return null;
	}
	
	private static String getName(ChinaSouthwestAreaCodeEnum e) {
		
		String name = e.getThirdDistrict();
		if (ValidatorUtil.isEmptyIgnoreBlank(name)) {
			
			name = e.getSecondDistrict();
		}
		if (ValidatorUtil.isEmptyIgnoreBlank(name)) {
			
			name = e.getFirstDistrict();
		}
		return ValidatorUtil.isEmptyIgnoreBlank(name) ? null : name;
	}
	
	private static Map<Object, Object> getResult(ChinaSouthwestAreaCodeEnum e) {

		String district = null;
		Map<Object, Object> map = new HashMap<Object, Object>();
		map.put("code", e.getCode());
		
		district = e.getFirstDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("firstDistrict", district);
		}
		district = e.getSecondDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("secondDistrict", district);
		}
		district = e.getThirdDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("thirdDistrict", district);
		}
		return map;
	}
}
