package cn.datawe.constant;

import java.util.HashMap;
import java.util.LinkedHashMap;
import java.util.Map;

import cn.datawe.util.ValidatorUtil;

/**
 * 枚举类:华东地区行政区划
 * <br>数据更新日期:2016-08-24
 * 
 * @author LiuJiaLe
 * 
 */
public enum ChinaEastAreaCodeEnum {

	ITEM310000("310000", "上海市", "", ""),
	ITEM310101("310101", "上海市", "黄浦区", ""),
	ITEM310104("310104", "上海市", "徐汇区", ""),
	ITEM310105("310105", "上海市", "长宁区", ""),
	ITEM310106("310106", "上海市", "静安区", ""),
	ITEM310107("310107", "上海市", "普陀区", ""),
	ITEM310109("310109", "上海市", "虹口区", ""),
	ITEM310110("310110", "上海市", "杨浦区", ""),
	ITEM310112("310112", "上海市", "闵行区", ""),
	ITEM310113("310113", "上海市", "宝山区", ""),
	ITEM310114("310114", "上海市", "嘉定区", ""),
	ITEM310115("310115", "上海市", "浦东新区", ""),
	ITEM310116("310116", "上海市", "金山区", ""),
	ITEM310117("310117", "上海市", "松江区", ""),
	ITEM310118("310118", "上海市", "青浦区", ""),
	ITEM310120("310120", "上海市", "奉贤区", ""),
	ITEM310230("310230", "上海市", "崇明县", ""),
	
	ITEM320000("320000", "江苏省", "", ""),
	ITEM320100("320100", "江苏省", "南京市", ""),
	ITEM320102("320102", "江苏省", "南京市", "玄武区"),
	ITEM320104("320104", "江苏省", "南京市", "秦淮区"),
	ITEM320105("320105", "江苏省", "南京市", "建邺区"),
	ITEM320106("320106", "江苏省", "南京市", "鼓楼区"),
	ITEM320111("320111", "江苏省", "南京市", "浦口区"),
	ITEM320113("320113", "江苏省", "南京市", "栖霞区"),
	ITEM320114("320114", "江苏省", "南京市", "雨花台区"),
	ITEM320115("320115", "江苏省", "南京市", "江宁区"),
	ITEM320116("320116", "江苏省", "南京市", "六合区"),
	ITEM320117("320117", "江苏省", "南京市", "溧水区"),
	ITEM320118("320118", "江苏省", "南京市", "高淳区"),
	ITEM320200("320200", "江苏省", "无锡市", ""),
	ITEM320205("320205", "江苏省", "无锡市", "锡山区"),
	ITEM320206("320206", "江苏省", "无锡市", "惠山区"),
	ITEM320211("320211", "江苏省", "无锡市", "滨湖区"),
	ITEM320213("320213", "江苏省", "无锡市", "梁溪区"),
	ITEM320214("320214", "江苏省", "无锡市", "新吴区"),
	ITEM320281("320281", "江苏省", "无锡市", "江阴市"),
	ITEM320282("320282", "江苏省", "无锡市", "宜兴市"),
	ITEM320300("320300", "江苏省", "徐州市", ""),
	ITEM320302("320302", "江苏省", "徐州市", "鼓楼区"),
	ITEM320303("320303", "江苏省", "徐州市", "云龙区"),
	ITEM320305("320305", "江苏省", "徐州市", "贾汪区"),
	ITEM320311("320311", "江苏省", "徐州市", "泉山区"),
	ITEM320312("320312", "江苏省", "徐州市", "铜山区"),
	ITEM320321("320321", "江苏省", "徐州市", "丰县"),
	ITEM320322("320322", "江苏省", "徐州市", "沛县"),
	ITEM320324("320324", "江苏省", "徐州市", "睢宁县"),
	ITEM320381("320381", "江苏省", "徐州市", "新沂市"),
	ITEM320382("320382", "江苏省", "徐州市", "邳州市"),
	ITEM320400("320400", "江苏省", "常州市", ""),
	ITEM320402("320402", "江苏省", "常州市", "天宁区"),
	ITEM320404("320404", "江苏省", "常州市", "钟楼区"),
	ITEM320411("320411", "江苏省", "常州市", "新北区"),
	ITEM320412("320412", "江苏省", "常州市", "武进区"),
	ITEM320413("320413", "江苏省", "常州市", "金坛区"),
	ITEM320481("320481", "江苏省", "常州市", "溧阳市"),
	ITEM320500("320500", "江苏省", "苏州市", ""),
	ITEM320505("320505", "江苏省", "苏州市", "虎丘区"),
	ITEM320506("320506", "江苏省", "苏州市", "吴中区"),
	ITEM320507("320507", "江苏省", "苏州市", "相城区"),
	ITEM320508("320508", "江苏省", "苏州市", "姑苏区"),
	ITEM320509("320509", "江苏省", "苏州市", "吴江区"),
	ITEM320581("320581", "江苏省", "苏州市", "常熟市"),
	ITEM320582("320582", "江苏省", "苏州市", "张家港市"),
	ITEM320583("320583", "江苏省", "苏州市", "昆山市"),
	ITEM320585("320585", "江苏省", "苏州市", "太仓市"),
	ITEM320600("320600", "江苏省", "南通市", ""),
	ITEM320602("320602", "江苏省", "南通市", "崇川区"),
	ITEM320611("320611", "江苏省", "南通市", "港闸区"),
	ITEM320612("320612", "江苏省", "南通市", "通州区"),
	ITEM320621("320621", "江苏省", "南通市", "海安县"),
	ITEM320623("320623", "江苏省", "南通市", "如东县"),
	ITEM320681("320681", "江苏省", "南通市", "启东市"),
	ITEM320682("320682", "江苏省", "南通市", "如皋市"),
	ITEM320684("320684", "江苏省", "南通市", "海门市"),
	ITEM320700("320700", "江苏省", "连云港市", ""),
	ITEM320703("320703", "江苏省", "连云港市", "连云区"),
	ITEM320706("320706", "江苏省", "连云港市", "海州区"),
	ITEM320707("320707", "江苏省", "连云港市", "赣榆区"),
	ITEM320722("320722", "江苏省", "连云港市", "东海县"),
	ITEM320723("320723", "江苏省", "连云港市", "灌云县"),
	ITEM320724("320724", "江苏省", "连云港市", "灌南县"),
	ITEM320800("320800", "江苏省", "淮安市", ""),
	ITEM320802("320802", "江苏省", "淮安市", "清河区"),
	ITEM320803("320803", "江苏省", "淮安市", "淮安区"),
	ITEM320804("320804", "江苏省", "淮安市", "淮阴区"),
	ITEM320811("320811", "江苏省", "淮安市", "清浦区"),
	ITEM320813("320813", "江苏省", "淮安市", "洪泽区"),// 320829->320813, 洪泽县->洪泽区
	ITEM320826("320826", "江苏省", "淮安市", "涟水县"),
	ITEM320830("320830", "江苏省", "淮安市", "盱眙县"),
	ITEM320831("320831", "江苏省", "淮安市", "金湖县"),
	ITEM320900("320900", "江苏省", "盐城市", ""),
	ITEM320902("320902", "江苏省", "盐城市", "亭湖区"),
	ITEM320903("320903", "江苏省", "盐城市", "盐都区"),
	ITEM320904("320904", "江苏省", "盐城市", "大丰区"),
	ITEM320921("320921", "江苏省", "盐城市", "响水县"),
	ITEM320922("320922", "江苏省", "盐城市", "滨海县"),
	ITEM320923("320923", "江苏省", "盐城市", "阜宁县"),
	ITEM320924("320924", "江苏省", "盐城市", "射阳县"),
	ITEM320925("320925", "江苏省", "盐城市", "建湖县"),
	ITEM320981("320981", "江苏省", "盐城市", "东台市"),
	ITEM321000("321000", "江苏省", "扬州市", ""),
	ITEM321002("321002", "江苏省", "扬州市", "广陵区"),
	ITEM321003("321003", "江苏省", "扬州市", "邗江区"),
	ITEM321012("321012", "江苏省", "扬州市", "江都区"),
	ITEM321023("321023", "江苏省", "扬州市", "宝应县"),
	ITEM321081("321081", "江苏省", "扬州市", "仪征市"),
	ITEM321084("321084", "江苏省", "扬州市", "高邮市"),
	ITEM321100("321100", "江苏省", "镇江市", ""),
	ITEM321102("321102", "江苏省", "镇江市", "京口区"),
	ITEM321111("321111", "江苏省", "镇江市", "润州区"),
	ITEM321112("321112", "江苏省", "镇江市", "丹徒区"),
	ITEM321181("321181", "江苏省", "镇江市", "丹阳市"),
	ITEM321182("321182", "江苏省", "镇江市", "扬中市"),
	ITEM321183("321183", "江苏省", "镇江市", "句容市"),
	ITEM321200("321200", "江苏省", "泰州市", ""),
	ITEM321202("321202", "江苏省", "泰州市", "海陵区"),
	ITEM321203("321203", "江苏省", "泰州市", "高港区"),
	ITEM321204("321204", "江苏省", "泰州市", "姜堰区"),
	ITEM321281("321281", "江苏省", "泰州市", "兴化市"),
	ITEM321282("321282", "江苏省", "泰州市", "靖江市"),
	ITEM321283("321283", "江苏省", "泰州市", "泰兴市"),
	ITEM321300("321300", "江苏省", "宿迁市", ""),
	ITEM321302("321302", "江苏省", "宿迁市", "宿城区"),
	ITEM321311("321311", "江苏省", "宿迁市", "宿豫区"),
	ITEM321322("321322", "江苏省", "宿迁市", "沭阳县"),
	ITEM321323("321323", "江苏省", "宿迁市", "泗阳县"),
	ITEM321324("321324", "江苏省", "宿迁市", "泗洪县"),
	
	ITEM330000("330000", "浙江省", "", ""),
	ITEM330100("330100", "浙江省", "杭州市", ""),
	ITEM330102("330102", "浙江省", "杭州市", "上城区"),
	ITEM330103("330103", "浙江省", "杭州市", "下城区"),
	ITEM330104("330104", "浙江省", "杭州市", "江干区"),
	ITEM330105("330105", "浙江省", "杭州市", "拱墅区"),
	ITEM330106("330106", "浙江省", "杭州市", "西湖区"),
	ITEM330108("330108", "浙江省", "杭州市", "滨江区"),
	ITEM330109("330109", "浙江省", "杭州市", "萧山区"),
	ITEM330110("330110", "浙江省", "杭州市", "余杭区"),
	ITEM330111("330111", "浙江省", "杭州市", "富阳区"),
	ITEM330122("330122", "浙江省", "杭州市", "桐庐县"),
	ITEM330127("330127", "浙江省", "杭州市", "淳安县"),
	ITEM330182("330182", "浙江省", "杭州市", "建德市"),
	ITEM330185("330185", "浙江省", "杭州市", "临安市"),
	ITEM330200("330200", "浙江省", "宁波市", ""),
	ITEM330203("330203", "浙江省", "宁波市", "海曙区"),
	ITEM330204("330204", "浙江省", "宁波市", "江东区"),
	ITEM330205("330205", "浙江省", "宁波市", "江北区"),
	ITEM330206("330206", "浙江省", "宁波市", "北仑区"),
	ITEM330211("330211", "浙江省", "宁波市", "镇海区"),
	ITEM330212("330212", "浙江省", "宁波市", "鄞州区"),
	ITEM330225("330225", "浙江省", "宁波市", "象山县"),
	ITEM330226("330226", "浙江省", "宁波市", "宁海县"),
	ITEM330281("330281", "浙江省", "宁波市", "余姚市"),
	ITEM330282("330282", "浙江省", "宁波市", "慈溪市"),
	ITEM330283("330283", "浙江省", "宁波市", "奉化市"),
	ITEM330300("330300", "浙江省", "温州市", ""),
	ITEM330302("330302", "浙江省", "温州市", "鹿城区"),
	ITEM330303("330303", "浙江省", "温州市", "龙湾区"),
	ITEM330304("330304", "浙江省", "温州市", "瓯海区"),
	ITEM330305("330305", "浙江省", "温州市", "洞头区"),
	ITEM330324("330324", "浙江省", "温州市", "永嘉县"),
	ITEM330326("330326", "浙江省", "温州市", "平阳县"),
	ITEM330327("330327", "浙江省", "温州市", "苍南县"),
	ITEM330328("330328", "浙江省", "温州市", "文成县"),
	ITEM330329("330329", "浙江省", "温州市", "泰顺县"),
	ITEM330381("330381", "浙江省", "温州市", "瑞安市"),
	ITEM330382("330382", "浙江省", "温州市", "乐清市"),
	ITEM330400("330400", "浙江省", "嘉兴市", ""),
	ITEM330402("330402", "浙江省", "嘉兴市", "南湖区"),
	ITEM330411("330411", "浙江省", "嘉兴市", "秀洲区"),
	ITEM330421("330421", "浙江省", "嘉兴市", "嘉善县"),
	ITEM330424("330424", "浙江省", "嘉兴市", "海盐县"),
	ITEM330481("330481", "浙江省", "嘉兴市", "海宁市"),
	ITEM330482("330482", "浙江省", "嘉兴市", "平湖市"),
	ITEM330483("330483", "浙江省", "嘉兴市", "桐乡市"),
	ITEM330500("330500", "浙江省", "湖州市", ""),
	ITEM330502("330502", "浙江省", "湖州市", "吴兴区"),
	ITEM330503("330503", "浙江省", "湖州市", "南浔区"),
	ITEM330521("330521", "浙江省", "湖州市", "德清县"),
	ITEM330522("330522", "浙江省", "湖州市", "长兴县"),
	ITEM330523("330523", "浙江省", "湖州市", "安吉县"),
	ITEM330600("330600", "浙江省", "绍兴市", ""),
	ITEM330602("330602", "浙江省", "绍兴市", "越城区"),
	ITEM330603("330603", "浙江省", "绍兴市", "柯桥区"),
	ITEM330604("330604", "浙江省", "绍兴市", "上虞区"),
	ITEM330624("330624", "浙江省", "绍兴市", "新昌县"),
	ITEM330681("330681", "浙江省", "绍兴市", "诸暨市"),
	ITEM330683("330683", "浙江省", "绍兴市", "嵊州市"),
	ITEM330700("330700", "浙江省", "金华市", ""),
	ITEM330702("330702", "浙江省", "金华市", "婺城区"),
	ITEM330703("330703", "浙江省", "金华市", "金东区"),
	ITEM330723("330723", "浙江省", "金华市", "武义县"),
	ITEM330726("330726", "浙江省", "金华市", "浦江县"),
	ITEM330727("330727", "浙江省", "金华市", "磐安县"),
	ITEM330781("330781", "浙江省", "金华市", "兰溪市"),
	ITEM330782("330782", "浙江省", "金华市", "义乌市"),
	ITEM330783("330783", "浙江省", "金华市", "东阳市"),
	ITEM330784("330784", "浙江省", "金华市", "永康市"),
	ITEM330800("330800", "浙江省", "衢州市", ""),
	ITEM330802("330802", "浙江省", "衢州市", "柯城区"),
	ITEM330803("330803", "浙江省", "衢州市", "衢江区"),
	ITEM330822("330822", "浙江省", "衢州市", "常山县"),
	ITEM330824("330824", "浙江省", "衢州市", "开化县"),
	ITEM330825("330825", "浙江省", "衢州市", "龙游县"),
	ITEM330881("330881", "浙江省", "衢州市", "江山市"),
	ITEM330900("330900", "浙江省", "舟山市", ""),
	ITEM330902("330902", "浙江省", "舟山市", "定海区"),
	ITEM330903("330903", "浙江省", "舟山市", "普陀区"),
	ITEM330921("330921", "浙江省", "舟山市", "岱山县"),
	ITEM330922("330922", "浙江省", "舟山市", "嵊泗县"),
	ITEM331000("331000", "浙江省", "台州市", ""),
	ITEM331002("331002", "浙江省", "台州市", "椒江区"),
	ITEM331003("331003", "浙江省", "台州市", "黄岩区"),
	ITEM331004("331004", "浙江省", "台州市", "路桥区"),
	ITEM331021("331021", "浙江省", "台州市", "玉环县"),
	ITEM331022("331022", "浙江省", "台州市", "三门县"),
	ITEM331023("331023", "浙江省", "台州市", "天台县"),
	ITEM331024("331024", "浙江省", "台州市", "仙居县"),
	ITEM331081("331081", "浙江省", "台州市", "温岭市"),
	ITEM331082("331082", "浙江省", "台州市", "临海市"),
	ITEM331100("331100", "浙江省", "丽水市", ""),
	ITEM331102("331102", "浙江省", "丽水市", "莲都区"),
	ITEM331121("331121", "浙江省", "丽水市", "青田县"),
	ITEM331122("331122", "浙江省", "丽水市", "缙云县"),
	ITEM331123("331123", "浙江省", "丽水市", "遂昌县"),
	ITEM331124("331124", "浙江省", "丽水市", "松阳县"),
	ITEM331125("331125", "浙江省", "丽水市", "云和县"),
	ITEM331126("331126", "浙江省", "丽水市", "庆元县"),
	ITEM331127("331127", "浙江省", "丽水市", "景宁畲族自治县"),
	ITEM331181("331181", "浙江省", "丽水市", "龙泉市"),
	
	ITEM340000("340000", "安徽省", "", ""),
	ITEM340100("340100", "安徽省", "合肥市", ""),
	ITEM340102("340102", "安徽省", "合肥市", "瑶海区"),
	ITEM340103("340103", "安徽省", "合肥市", "庐阳区"),
	ITEM340104("340104", "安徽省", "合肥市", "蜀山区"),
	ITEM340111("340111", "安徽省", "合肥市", "包河区"),
	ITEM340121("340121", "安徽省", "合肥市", "长丰县"),
	ITEM340122("340122", "安徽省", "合肥市", "肥东县"),
	ITEM340123("340123", "安徽省", "合肥市", "肥西县"),
	ITEM340124("340124", "安徽省", "合肥市", "庐江县"),
	ITEM340181("340181", "安徽省", "合肥市", "巢湖市"),
	ITEM340200("340200", "安徽省", "芜湖市", ""),
	ITEM340202("340202", "安徽省", "芜湖市", "镜湖区"),
	ITEM340203("340203", "安徽省", "芜湖市", "弋江区"),
	ITEM340207("340207", "安徽省", "芜湖市", "鸠江区"),
	ITEM340208("340208", "安徽省", "芜湖市", "三山区"),
	ITEM340221("340221", "安徽省", "芜湖市", "芜湖县"),
	ITEM340222("340222", "安徽省", "芜湖市", "繁昌县"),
	ITEM340223("340223", "安徽省", "芜湖市", "南陵县"),
	ITEM340225("340225", "安徽省", "芜湖市", "无为县"),
	ITEM340300("340300", "安徽省", "蚌埠市", ""),
	ITEM340302("340302", "安徽省", "蚌埠市", "龙子湖区"),
	ITEM340303("340303", "安徽省", "蚌埠市", "蚌山区"),
	ITEM340304("340304", "安徽省", "蚌埠市", "禹会区"),
	ITEM340311("340311", "安徽省", "蚌埠市", "淮上区"),
	ITEM340321("340321", "安徽省", "蚌埠市", "怀远县"),
	ITEM340322("340322", "安徽省", "蚌埠市", "五河县"),
	ITEM340323("340323", "安徽省", "蚌埠市", "固镇县"),
	ITEM340400("340400", "安徽省", "淮南市", ""),
	ITEM340402("340402", "安徽省", "淮南市", "大通区"),
	ITEM340403("340403", "安徽省", "淮南市", "田家庵区"),
	ITEM340404("340404", "安徽省", "淮南市", "谢家集区"),
	ITEM340405("340405", "安徽省", "淮南市", "八公山区"),
	ITEM340406("340406", "安徽省", "淮南市", "潘集区"),
	ITEM340421("340421", "安徽省", "淮南市", "凤台县"),
	ITEM340422("340422", "安徽省", "淮南市", "寿县"),
	ITEM340500("340500", "安徽省", "马鞍山市", ""),
	ITEM340503("340503", "安徽省", "马鞍山市", "花山区"),
	ITEM340504("340504", "安徽省", "马鞍山市", "雨山区"),
	ITEM340506("340506", "安徽省", "马鞍山市", "博望区"),
	ITEM340521("340521", "安徽省", "马鞍山市", "当涂县"),
	ITEM340522("340522", "安徽省", "马鞍山市", "含山县"),
	ITEM340523("340523", "安徽省", "马鞍山市", "和县"),
	ITEM340600("340600", "安徽省", "淮北市", ""),
	ITEM340602("340602", "安徽省", "淮北市", "杜集区"),
	ITEM340603("340603", "安徽省", "淮北市", "相山区"),
	ITEM340604("340604", "安徽省", "淮北市", "烈山区"),
	ITEM340621("340621", "安徽省", "淮北市", "濉溪县"),
	ITEM340700("340700", "安徽省", "铜陵市", ""),
	ITEM340705("340705", "安徽省", "铜陵市", "铜官区"),
	ITEM340706("340706", "安徽省", "铜陵市", "义安区"),
	ITEM340711("340711", "安徽省", "铜陵市", "郊区"),
	ITEM340722("340722", "安徽省", "铜陵市", "枞阳县"),
	ITEM340800("340800", "安徽省", "安庆市", ""),
	ITEM340802("340802", "安徽省", "安庆市", "迎江区"),
	ITEM340803("340803", "安徽省", "安庆市", "大观区"),
	ITEM340811("340811", "安徽省", "安庆市", "宜秀区"),
	ITEM340822("340822", "安徽省", "安庆市", "怀宁县"),
	ITEM340824("340824", "安徽省", "安庆市", "潜山县"),
	ITEM340825("340825", "安徽省", "安庆市", "太湖县"),
	ITEM340826("340826", "安徽省", "安庆市", "宿松县"),
	ITEM340827("340827", "安徽省", "安庆市", "望江县"),
	ITEM340828("340828", "安徽省", "安庆市", "岳西县"),
	ITEM340881("340881", "安徽省", "安庆市", "桐城市"),
	ITEM341000("341000", "安徽省", "黄山市", ""),
	ITEM341002("341002", "安徽省", "黄山市", "屯溪区"),
	ITEM341003("341003", "安徽省", "黄山市", "黄山区"),
	ITEM341004("341004", "安徽省", "黄山市", "徽州区"),
	ITEM341021("341021", "安徽省", "黄山市", "歙县"),
	ITEM341022("341022", "安徽省", "黄山市", "休宁县"),
	ITEM341023("341023", "安徽省", "黄山市", "黟县"),
	ITEM341024("341024", "安徽省", "黄山市", "祁门县"),
	ITEM341100("341100", "安徽省", "滁州市", ""),
	ITEM341102("341102", "安徽省", "滁州市", "琅琊区"),
	ITEM341103("341103", "安徽省", "滁州市", "南谯区"),
	ITEM341122("341122", "安徽省", "滁州市", "来安县"),
	ITEM341124("341124", "安徽省", "滁州市", "全椒县"),
	ITEM341125("341125", "安徽省", "滁州市", "定远县"),
	ITEM341126("341126", "安徽省", "滁州市", "凤阳县"),
	ITEM341181("341181", "安徽省", "滁州市", "天长市"),
	ITEM341182("341182", "安徽省", "滁州市", "明光市"),
	ITEM341200("341200", "安徽省", "阜阳市", ""),
	ITEM341202("341202", "安徽省", "阜阳市", "颍州区"),
	ITEM341203("341203", "安徽省", "阜阳市", "颍东区"),
	ITEM341204("341204", "安徽省", "阜阳市", "颍泉区"),
	ITEM341221("341221", "安徽省", "阜阳市", "临泉县"),
	ITEM341222("341222", "安徽省", "阜阳市", "太和县"),
	ITEM341225("341225", "安徽省", "阜阳市", "阜南县"),
	ITEM341226("341226", "安徽省", "阜阳市", "颍上县"),
	ITEM341282("341282", "安徽省", "阜阳市", "界首市"),
	ITEM341300("341300", "安徽省", "宿州市", ""),
	ITEM341302("341302", "安徽省", "宿州市", "埇桥区"),
	ITEM341321("341321", "安徽省", "宿州市", "砀山县"),
	ITEM341322("341322", "安徽省", "宿州市", "萧县"),
	ITEM341323("341323", "安徽省", "宿州市", "灵璧县"),
	ITEM341324("341324", "安徽省", "宿州市", "泗县"),
	ITEM341500("341500", "安徽省", "六安市", ""),
	ITEM341502("341502", "安徽省", "六安市", "金安区"),
	ITEM341503("341503", "安徽省", "六安市", "裕安区"),
	ITEM341504("341504", "安徽省", "六安市", "叶集区"),
	ITEM341522("341522", "安徽省", "六安市", "霍邱县"),
	ITEM341523("341523", "安徽省", "六安市", "舒城县"),
	ITEM341524("341524", "安徽省", "六安市", "金寨县"),
	ITEM341525("341525", "安徽省", "六安市", "霍山县"),
	ITEM341600("341600", "安徽省", "亳州市", ""),
	ITEM341602("341602", "安徽省", "亳州市", "谯城区"),
	ITEM341621("341621", "安徽省", "亳州市", "涡阳县"),
	ITEM341622("341622", "安徽省", "亳州市", "蒙城县"),
	ITEM341623("341623", "安徽省", "亳州市", "利辛县"),
	ITEM341700("341700", "安徽省", "池州市", ""),
	ITEM341702("341702", "安徽省", "池州市", "贵池区"),
	ITEM341721("341721", "安徽省", "池州市", "东至县"),
	ITEM341722("341722", "安徽省", "池州市", "石台县"),
	ITEM341723("341723", "安徽省", "池州市", "青阳县"),
	ITEM341800("341800", "安徽省", "宣城市", ""),
	ITEM341802("341802", "安徽省", "宣城市", "宣州区"),
	ITEM341821("341821", "安徽省", "宣城市", "郎溪县"),
	ITEM341822("341822", "安徽省", "宣城市", "广德县"),
	ITEM341823("341823", "安徽省", "宣城市", "泾县"),
	ITEM341824("341824", "安徽省", "宣城市", "绩溪县"),
	ITEM341825("341825", "安徽省", "宣城市", "旌德县"),
	ITEM341881("341881", "安徽省", "宣城市", "宁国市"),
	
	ITEM350000("350000", "福建省", "", ""),
	ITEM350100("350100", "福建省", "福州市", ""),
	ITEM350102("350102", "福建省", "福州市", "鼓楼区"),
	ITEM350103("350103", "福建省", "福州市", "台江区"),
	ITEM350104("350104", "福建省", "福州市", "仓山区"),
	ITEM350105("350105", "福建省", "福州市", "马尾区"),
	ITEM350111("350111", "福建省", "福州市", "晋安区"),
	ITEM350121("350121", "福建省", "福州市", "闽侯县"),
	ITEM350122("350122", "福建省", "福州市", "连江县"),
	ITEM350123("350123", "福建省", "福州市", "罗源县"),
	ITEM350124("350124", "福建省", "福州市", "闽清县"),
	ITEM350125("350125", "福建省", "福州市", "永泰县"),
	ITEM350128("350128", "福建省", "福州市", "平潭县"),
	ITEM350181("350181", "福建省", "福州市", "福清市"),
	ITEM350182("350182", "福建省", "福州市", "长乐市"),
	ITEM350200("350200", "福建省", "厦门市", ""),
	ITEM350203("350203", "福建省", "厦门市", "思明区"),
	ITEM350205("350205", "福建省", "厦门市", "海沧区"),
	ITEM350206("350206", "福建省", "厦门市", "湖里区"),
	ITEM350211("350211", "福建省", "厦门市", "集美区"),
	ITEM350212("350212", "福建省", "厦门市", "同安区"),
	ITEM350213("350213", "福建省", "厦门市", "翔安区"),
	ITEM350300("350300", "福建省", "莆田市", ""),
	ITEM350302("350302", "福建省", "莆田市", "城厢区"),
	ITEM350303("350303", "福建省", "莆田市", "涵江区"),
	ITEM350304("350304", "福建省", "莆田市", "荔城区"),
	ITEM350305("350305", "福建省", "莆田市", "秀屿区"),
	ITEM350322("350322", "福建省", "莆田市", "仙游县"),
	ITEM350400("350400", "福建省", "三明市", ""),
	ITEM350402("350402", "福建省", "三明市", "梅列区"),
	ITEM350403("350403", "福建省", "三明市", "三元区"),
	ITEM350421("350421", "福建省", "三明市", "明溪县"),
	ITEM350423("350423", "福建省", "三明市", "清流县"),
	ITEM350424("350424", "福建省", "三明市", "宁化县"),
	ITEM350425("350425", "福建省", "三明市", "大田县"),
	ITEM350426("350426", "福建省", "三明市", "尤溪县"),
	ITEM350427("350427", "福建省", "三明市", "沙县"),
	ITEM350428("350428", "福建省", "三明市", "将乐县"),
	ITEM350429("350429", "福建省", "三明市", "泰宁县"),
	ITEM350430("350430", "福建省", "三明市", "建宁县"),
	ITEM350481("350481", "福建省", "三明市", "永安市"),
	ITEM350500("350500", "福建省", "泉州市", ""),
	ITEM350502("350502", "福建省", "泉州市", "鲤城区"),
	ITEM350503("350503", "福建省", "泉州市", "丰泽区"),
	ITEM350504("350504", "福建省", "泉州市", "洛江区"),
	ITEM350505("350505", "福建省", "泉州市", "泉港区"),
	ITEM350521("350521", "福建省", "泉州市", "惠安县"),
	ITEM350524("350524", "福建省", "泉州市", "安溪县"),
	ITEM350525("350525", "福建省", "泉州市", "永春县"),
	ITEM350526("350526", "福建省", "泉州市", "德化县"),
	ITEM350527("350527", "福建省", "泉州市", "金门县"),
	ITEM350581("350581", "福建省", "泉州市", "石狮市"),
	ITEM350582("350582", "福建省", "泉州市", "晋江市"),
	ITEM350583("350583", "福建省", "泉州市", "南安市"),
	ITEM350600("350600", "福建省", "漳州市", ""),
	ITEM350602("350602", "福建省", "漳州市", "芗城区"),
	ITEM350603("350603", "福建省", "漳州市", "龙文区"),
	ITEM350622("350622", "福建省", "漳州市", "云霄县"),
	ITEM350623("350623", "福建省", "漳州市", "漳浦县"),
	ITEM350624("350624", "福建省", "漳州市", "诏安县"),
	ITEM350625("350625", "福建省", "漳州市", "长泰县"),
	ITEM350626("350626", "福建省", "漳州市", "东山县"),
	ITEM350627("350627", "福建省", "漳州市", "南靖县"),
	ITEM350628("350628", "福建省", "漳州市", "平和县"),
	ITEM350629("350629", "福建省", "漳州市", "华安县"),
	ITEM350681("350681", "福建省", "漳州市", "龙海市"),
	ITEM350700("350700", "福建省", "南平市", ""),
	ITEM350702("350702", "福建省", "南平市", "延平区"),
	ITEM350703("350703", "福建省", "南平市", "建阳区"),
	ITEM350721("350721", "福建省", "南平市", "顺昌县"),
	ITEM350722("350722", "福建省", "南平市", "浦城县"),
	ITEM350723("350723", "福建省", "南平市", "光泽县"),
	ITEM350724("350724", "福建省", "南平市", "松溪县"),
	ITEM350725("350725", "福建省", "南平市", "政和县"),
	ITEM350781("350781", "福建省", "南平市", "邵武市"),
	ITEM350782("350782", "福建省", "南平市", "武夷山市"),
	ITEM350783("350783", "福建省", "南平市", "建瓯市"),
	ITEM350800("350800", "福建省", "龙岩市", ""),
	ITEM350802("350802", "福建省", "龙岩市", "新罗区"),
	ITEM350803("350803", "福建省", "龙岩市", "永定区"),
	ITEM350821("350821", "福建省", "龙岩市", "长汀县"),
	ITEM350823("350823", "福建省", "龙岩市", "上杭县"),
	ITEM350824("350824", "福建省", "龙岩市", "武平县"),
	ITEM350825("350825", "福建省", "龙岩市", "连城县"),
	ITEM350881("350881", "福建省", "龙岩市", "漳平市"),
	ITEM350900("350900", "福建省", "宁德市", ""),
	ITEM350902("350902", "福建省", "宁德市", "蕉城区"),
	ITEM350921("350921", "福建省", "宁德市", "霞浦县"),
	ITEM350922("350922", "福建省", "宁德市", "古田县"),
	ITEM350923("350923", "福建省", "宁德市", "屏南县"),
	ITEM350924("350924", "福建省", "宁德市", "寿宁县"),
	ITEM350925("350925", "福建省", "宁德市", "周宁县"),
	ITEM350926("350926", "福建省", "宁德市", "柘荣县"),
	ITEM350981("350981", "福建省", "宁德市", "福安市"),
	ITEM350982("350982", "福建省", "宁德市", "福鼎市"),
	
	ITEM360000("360000", "江西省", "", ""),
	ITEM360100("360100", "江西省", "南昌市", ""),
	ITEM360102("360102", "江西省", "南昌市", "东湖区"),
	ITEM360103("360103", "江西省", "南昌市", "西湖区"),
	ITEM360104("360104", "江西省", "南昌市", "青云谱区"),
	ITEM360105("360105", "江西省", "南昌市", "湾里区"),
	ITEM360111("360111", "江西省", "南昌市", "青山湖区"),
	ITEM360112("360112", "江西省", "南昌市", "新建区"),
	ITEM360121("360121", "江西省", "南昌市", "南昌县"),
	ITEM360123("360123", "江西省", "南昌市", "安义县"),
	ITEM360124("360124", "江西省", "南昌市", "进贤县"),
	ITEM360200("360200", "江西省", "景德镇市", ""),
	ITEM360202("360202", "江西省", "景德镇市", "昌江区"),
	ITEM360203("360203", "江西省", "景德镇市", "珠山区"),
	ITEM360222("360222", "江西省", "景德镇市", "浮梁县"),
	ITEM360281("360281", "江西省", "景德镇市", "乐平市"),
	ITEM360300("360300", "江西省", "萍乡市", ""),
	ITEM360302("360302", "江西省", "萍乡市", "安源区"),
	ITEM360313("360313", "江西省", "萍乡市", "湘东区"),
	ITEM360321("360321", "江西省", "萍乡市", "莲花县"),
	ITEM360322("360322", "江西省", "萍乡市", "上栗县"),
	ITEM360323("360323", "江西省", "萍乡市", "芦溪县"),
	ITEM360400("360400", "江西省", "九江市", ""),
	ITEM360402("360402", "江西省", "九江市", "庐山区"),
	ITEM360403("360403", "江西省", "九江市", "浔阳区"),
	ITEM360421("360421", "江西省", "九江市", "九江县"),
	ITEM360423("360423", "江西省", "九江市", "武宁县"),
	ITEM360424("360424", "江西省", "九江市", "修水县"),
	ITEM360425("360425", "江西省", "九江市", "永修县"),
	ITEM360426("360426", "江西省", "九江市", "德安县"),
	ITEM360427("360427", "江西省", "九江市", "星子县"),
	ITEM360428("360428", "江西省", "九江市", "都昌县"),
	ITEM360429("360429", "江西省", "九江市", "湖口县"),
	ITEM360430("360430", "江西省", "九江市", "彭泽县"),
	ITEM360481("360481", "江西省", "九江市", "瑞昌市"),
	ITEM360482("360482", "江西省", "九江市", "共青城市"),
	ITEM360500("360500", "江西省", "新余市", ""),
	ITEM360502("360502", "江西省", "新余市", "渝水区"),
	ITEM360521("360521", "江西省", "新余市", "分宜县"),
	ITEM360600("360600", "江西省", "鹰潭市", ""),
	ITEM360602("360602", "江西省", "鹰潭市", "月湖区"),
	ITEM360622("360622", "江西省", "鹰潭市", "余江县"),
	ITEM360681("360681", "江西省", "鹰潭市", "贵溪市"),
	ITEM360700("360700", "江西省", "赣州市", ""),
	ITEM360702("360702", "江西省", "赣州市", "章贡区"),
	ITEM360703("360703", "江西省", "赣州市", "南康区"),
	ITEM360721("360721", "江西省", "赣州市", "赣县"),
	ITEM360722("360722", "江西省", "赣州市", "信丰县"),
	ITEM360723("360723", "江西省", "赣州市", "大余县"),
	ITEM360724("360724", "江西省", "赣州市", "上犹县"),
	ITEM360725("360725", "江西省", "赣州市", "崇义县"),
	ITEM360726("360726", "江西省", "赣州市", "安远县"),
	ITEM360727("360727", "江西省", "赣州市", "龙南县"),
	ITEM360728("360728", "江西省", "赣州市", "定南县"),
	ITEM360729("360729", "江西省", "赣州市", "全南县"),
	ITEM360730("360730", "江西省", "赣州市", "宁都县"),
	ITEM360731("360731", "江西省", "赣州市", "于都县"),
	ITEM360732("360732", "江西省", "赣州市", "兴国县"),
	ITEM360733("360733", "江西省", "赣州市", "会昌县"),
	ITEM360734("360734", "江西省", "赣州市", "寻乌县"),
	ITEM360735("360735", "江西省", "赣州市", "石城县"),
	ITEM360781("360781", "江西省", "赣州市", "瑞金市"),
	ITEM360800("360800", "江西省", "吉安市", ""),
	ITEM360802("360802", "江西省", "吉安市", "吉州区"),
	ITEM360803("360803", "江西省", "吉安市", "青原区"),
	ITEM360821("360821", "江西省", "吉安市", "吉安县"),
	ITEM360822("360822", "江西省", "吉安市", "吉水县"),
	ITEM360823("360823", "江西省", "吉安市", "峡江县"),
	ITEM360824("360824", "江西省", "吉安市", "新干县"),
	ITEM360825("360825", "江西省", "吉安市", "永丰县"),
	ITEM360826("360826", "江西省", "吉安市", "泰和县"),
	ITEM360827("360827", "江西省", "吉安市", "遂川县"),
	ITEM360828("360828", "江西省", "吉安市", "万安县"),
	ITEM360829("360829", "江西省", "吉安市", "安福县"),
	ITEM360830("360830", "江西省", "吉安市", "永新县"),
	ITEM360881("360881", "江西省", "吉安市", "井冈山市"),
	ITEM360900("360900", "江西省", "宜春市", ""),
	ITEM360902("360902", "江西省", "宜春市", "袁州区"),
	ITEM360921("360921", "江西省", "宜春市", "奉新县"),
	ITEM360922("360922", "江西省", "宜春市", "万载县"),
	ITEM360923("360923", "江西省", "宜春市", "上高县"),
	ITEM360924("360924", "江西省", "宜春市", "宜丰县"),
	ITEM360925("360925", "江西省", "宜春市", "靖安县"),
	ITEM360926("360926", "江西省", "宜春市", "铜鼓县"),
	ITEM360981("360981", "江西省", "宜春市", "丰城市"),
	ITEM360982("360982", "江西省", "宜春市", "樟树市"),
	ITEM360983("360983", "江西省", "宜春市", "高安市"),
	ITEM361000("361000", "江西省", "抚州市", ""),
	ITEM361002("361002", "江西省", "抚州市", "临川区"),
	ITEM361021("361021", "江西省", "抚州市", "南城县"),
	ITEM361022("361022", "江西省", "抚州市", "黎川县"),
	ITEM361023("361023", "江西省", "抚州市", "南丰县"),
	ITEM361024("361024", "江西省", "抚州市", "崇仁县"),
	ITEM361025("361025", "江西省", "抚州市", "乐安县"),
	ITEM361026("361026", "江西省", "抚州市", "宜黄县"),
	ITEM361027("361027", "江西省", "抚州市", "金溪县"),
	ITEM361028("361028", "江西省", "抚州市", "资溪县"),
	ITEM361029("361029", "江西省", "抚州市", "东乡县"),
	ITEM361030("361030", "江西省", "抚州市", "广昌县"),
	ITEM361100("361100", "江西省", "上饶市", ""),
	ITEM361102("361102", "江西省", "上饶市", "信州区"),
	ITEM361121("361121", "江西省", "上饶市", "上饶县"),
	ITEM361103("361103", "江西省", "上饶市", "广丰区"),
	ITEM361123("361123", "江西省", "上饶市", "玉山县"),
	ITEM361124("361124", "江西省", "上饶市", "铅山县"),
	ITEM361125("361125", "江西省", "上饶市", "横峰县"),
	ITEM361126("361126", "江西省", "上饶市", "弋阳县"),
	ITEM361127("361127", "江西省", "上饶市", "余干县"),
	ITEM361128("361128", "江西省", "上饶市", "鄱阳县"),
	ITEM361129("361129", "江西省", "上饶市", "万年县"),
	ITEM361130("361130", "江西省", "上饶市", "婺源县"),
	ITEM361181("361181", "江西省", "上饶市", "德兴市"),
	
	ITEM370000("370000", "山东省", "", ""),
	ITEM370100("370100", "山东省", "济南市", ""),
	ITEM370102("370102", "山东省", "济南市", "历下区"),
	ITEM370103("370103", "山东省", "济南市", "市中区"),
	ITEM370104("370104", "山东省", "济南市", "槐荫区"),
	ITEM370105("370105", "山东省", "济南市", "天桥区"),
	ITEM370112("370112", "山东省", "济南市", "历城区"),
	ITEM370113("370113", "山东省", "济南市", "长清区"),
	ITEM370124("370124", "山东省", "济南市", "平阴县"),
	ITEM370125("370125", "山东省", "济南市", "济阳县"),
	ITEM370126("370126", "山东省", "济南市", "商河县"),
	ITEM370181("370181", "山东省", "济南市", "章丘市"),
	ITEM370200("370200", "山东省", "青岛市", ""),
	ITEM370202("370202", "山东省", "青岛市", "市南区"),
	ITEM370203("370203", "山东省", "青岛市", "市北区"),
	ITEM370211("370211", "山东省", "青岛市", "黄岛区"),
	ITEM370212("370212", "山东省", "青岛市", "崂山区"),
	ITEM370213("370213", "山东省", "青岛市", "李沧区"),
	ITEM370214("370214", "山东省", "青岛市", "城阳区"),
	ITEM370281("370281", "山东省", "青岛市", "胶州市"),
	ITEM370282("370282", "山东省", "青岛市", "即墨市"),
	ITEM370283("370283", "山东省", "青岛市", "平度市"),
	ITEM370285("370285", "山东省", "青岛市", "莱西市"),
	ITEM370300("370300", "山东省", "淄博市", ""),
	ITEM370302("370302", "山东省", "淄博市", "淄川区"),
	ITEM370303("370303", "山东省", "淄博市", "张店区"),
	ITEM370304("370304", "山东省", "淄博市", "博山区"),
	ITEM370305("370305", "山东省", "淄博市", "临淄区"),
	ITEM370306("370306", "山东省", "淄博市", "周村区"),
	ITEM370321("370321", "山东省", "淄博市", "桓台县"),
	ITEM370322("370322", "山东省", "淄博市", "高青县"),
	ITEM370323("370323", "山东省", "淄博市", "沂源县"),
	ITEM370400("370400", "山东省", "枣庄市", ""),
	ITEM370402("370402", "山东省", "枣庄市", "市中区"),
	ITEM370403("370403", "山东省", "枣庄市", "薛城区"),
	ITEM370404("370404", "山东省", "枣庄市", "峄城区"),
	ITEM370405("370405", "山东省", "枣庄市", "台儿庄区"),
	ITEM370406("370406", "山东省", "枣庄市", "山亭区"),
	ITEM370481("370481", "山东省", "枣庄市", "滕州市"),
	ITEM370500("370500", "山东省", "东营市", ""),
	ITEM370502("370502", "山东省", "东营市", "东营区"),
	ITEM370503("370503", "山东省", "东营市", "河口区"),
	ITEM370505("370505", "山东省", "东营市", "垦利区"),// 370521->370505, 垦利县->垦利区
	ITEM370522("370522", "山东省", "东营市", "利津县"),
	ITEM370523("370523", "山东省", "东营市", "广饶县"),
	ITEM370600("370600", "山东省", "烟台市", ""),
	ITEM370602("370602", "山东省", "烟台市", "芝罘区"),
	ITEM370611("370611", "山东省", "烟台市", "福山区"),
	ITEM370612("370612", "山东省", "烟台市", "牟平区"),
	ITEM370613("370613", "山东省", "烟台市", "莱山区"),
	ITEM370634("370634", "山东省", "烟台市", "长岛县"),
	ITEM370681("370681", "山东省", "烟台市", "龙口市"),
	ITEM370682("370682", "山东省", "烟台市", "莱阳市"),
	ITEM370683("370683", "山东省", "烟台市", "莱州市"),
	ITEM370684("370684", "山东省", "烟台市", "蓬莱市"),
	ITEM370685("370685", "山东省", "烟台市", "招远市"),
	ITEM370686("370686", "山东省", "烟台市", "栖霞市"),
	ITEM370687("370687", "山东省", "烟台市", "海阳市"),
	ITEM370700("370700", "山东省", "潍坊市", ""),
	ITEM370702("370702", "山东省", "潍坊市", "潍城区"),
	ITEM370703("370703", "山东省", "潍坊市", "寒亭区"),
	ITEM370704("370704", "山东省", "潍坊市", "坊子区"),
	ITEM370705("370705", "山东省", "潍坊市", "奎文区"),
	ITEM370724("370724", "山东省", "潍坊市", "临朐县"),
	ITEM370725("370725", "山东省", "潍坊市", "昌乐县"),
	ITEM370781("370781", "山东省", "潍坊市", "青州市"),
	ITEM370782("370782", "山东省", "潍坊市", "诸城市"),
	ITEM370783("370783", "山东省", "潍坊市", "寿光市"),
	ITEM370784("370784", "山东省", "潍坊市", "安丘市"),
	ITEM370785("370785", "山东省", "潍坊市", "高密市"),
	ITEM370786("370786", "山东省", "潍坊市", "昌邑市"),
	ITEM370800("370800", "山东省", "济宁市", ""),
	ITEM370811("370811", "山东省", "济宁市", "任城区"),
	ITEM370812("370812", "山东省", "济宁市", "兖州区"),
	ITEM370826("370826", "山东省", "济宁市", "微山县"),
	ITEM370827("370827", "山东省", "济宁市", "鱼台县"),
	ITEM370828("370828", "山东省", "济宁市", "金乡县"),
	ITEM370829("370829", "山东省", "济宁市", "嘉祥县"),
	ITEM370830("370830", "山东省", "济宁市", "汶上县"),
	ITEM370831("370831", "山东省", "济宁市", "泗水县"),
	ITEM370832("370832", "山东省", "济宁市", "梁山县"),
	ITEM370881("370881", "山东省", "济宁市", "曲阜市"),
	ITEM370883("370883", "山东省", "济宁市", "邹城市"),
	ITEM370900("370900", "山东省", "泰安市", ""),
	ITEM370902("370902", "山东省", "泰安市", "泰山区"),
	ITEM370911("370911", "山东省", "泰安市", "岱岳区"),
	ITEM370921("370921", "山东省", "泰安市", "宁阳县"),
	ITEM370923("370923", "山东省", "泰安市", "东平县"),
	ITEM370982("370982", "山东省", "泰安市", "新泰市"),
	ITEM370983("370983", "山东省", "泰安市", "肥城市"),
	ITEM371000("371000", "山东省", "威海市", ""),
	ITEM371002("371002", "山东省", "威海市", "环翠区"),
	ITEM371003("371003", "山东省", "威海市", "文登区"),
	ITEM371082("371082", "山东省", "威海市", "荣成市"),
	ITEM371083("371083", "山东省", "威海市", "乳山市"),
	ITEM371100("371100", "山东省", "日照市", ""),
	ITEM371102("371102", "山东省", "日照市", "东港区"),
	ITEM371103("371103", "山东省", "日照市", "岚山区"),
	ITEM371121("371121", "山东省", "日照市", "五莲县"),
	ITEM371122("371122", "山东省", "日照市", "莒县"),
	ITEM371200("371200", "山东省", "莱芜市", ""),
	ITEM371202("371202", "山东省", "莱芜市", "莱城区"),
	ITEM371203("371203", "山东省", "莱芜市", "钢城区"),
	ITEM371300("371300", "山东省", "临沂市", ""),
	ITEM371302("371302", "山东省", "临沂市", "兰山区"),
	ITEM371311("371311", "山东省", "临沂市", "罗庄区"),
	ITEM371312("371312", "山东省", "临沂市", "河东区"),
	ITEM371321("371321", "山东省", "临沂市", "沂南县"),
	ITEM371322("371322", "山东省", "临沂市", "郯城县"),
	ITEM371323("371323", "山东省", "临沂市", "沂水县"),
	ITEM371324("371324", "山东省", "临沂市", "兰陵县"),
	ITEM371325("371325", "山东省", "临沂市", "费县"),
	ITEM371326("371326", "山东省", "临沂市", "平邑县"),
	ITEM371327("371327", "山东省", "临沂市", "莒南县"),
	ITEM371328("371328", "山东省", "临沂市", "蒙阴县"),
	ITEM371329("371329", "山东省", "临沂市", "临沭县"),
	ITEM371400("371400", "山东省", "德州市", ""),
	ITEM371402("371402", "山东省", "德州市", "德城区"),
	ITEM371403("371403", "山东省", "德州市", "陵城区"),
	ITEM371422("371422", "山东省", "德州市", "宁津县"),
	ITEM371423("371423", "山东省", "德州市", "庆云县"),
	ITEM371424("371424", "山东省", "德州市", "临邑县"),
	ITEM371425("371425", "山东省", "德州市", "齐河县"),
	ITEM371426("371426", "山东省", "德州市", "平原县"),
	ITEM371427("371427", "山东省", "德州市", "夏津县"),
	ITEM371428("371428", "山东省", "德州市", "武城县"),
	ITEM371481("371481", "山东省", "德州市", "乐陵市"),
	ITEM371482("371482", "山东省", "德州市", "禹城市"),
	ITEM371500("371500", "山东省", "聊城市", ""),
	ITEM371502("371502", "山东省", "聊城市", "东昌府区"),
	ITEM371521("371521", "山东省", "聊城市", "阳谷县"),
	ITEM371522("371522", "山东省", "聊城市", "莘县"),
	ITEM371523("371523", "山东省", "聊城市", "茌平县"),
	ITEM371524("371524", "山东省", "聊城市", "东阿县"),
	ITEM371525("371525", "山东省", "聊城市", "冠县"),
	ITEM371526("371526", "山东省", "聊城市", "高唐县"),
	ITEM371581("371581", "山东省", "聊城市", "临清市"),
	ITEM371600("371600", "山东省", "滨州市", ""),
	ITEM371602("371602", "山东省", "滨州市", "滨城区"),
	ITEM371603("371603", "山东省", "滨州市", "沾化区"),
	ITEM371621("371621", "山东省", "滨州市", "惠民县"),
	ITEM371622("371622", "山东省", "滨州市", "阳信县"),
	ITEM371623("371623", "山东省", "滨州市", "无棣县"),
	ITEM371625("371625", "山东省", "滨州市", "博兴县"),
	ITEM371626("371626", "山东省", "滨州市", "邹平县"),
	ITEM371700("371700", "山东省", "菏泽市", ""),
	ITEM371702("371702", "山东省", "菏泽市", "牡丹区"),
	ITEM371703("371703", "山东省", "菏泽市", "定陶区"),// 371727->371703, 定陶县->定陶区
	ITEM371721("371721", "山东省", "菏泽市", "曹县"),
	ITEM371722("371722", "山东省", "菏泽市", "单县"),
	ITEM371723("371723", "山东省", "菏泽市", "成武县"),
	ITEM371724("371724", "山东省", "菏泽市", "巨野县"),
	ITEM371725("371725", "山东省", "菏泽市", "郓城县"),
	ITEM371726("371726", "山东省", "菏泽市", "鄄城县"),
	ITEM371728("371728", "山东省", "菏泽市", "东明县"),
	;

	private String code;
	private String firstDistrict;
	private String secondDistrict;
	private String thirdDistrict;

	private ChinaEastAreaCodeEnum(String code, String firstDistrict, String secondDistrict, String thirdDistrict) {
		this.code = code;
		this.firstDistrict = firstDistrict;
		this.secondDistrict = secondDistrict;
		this.thirdDistrict = thirdDistrict;
	}

	public String getCode() {
		return code;
	}

	public String getFirstDistrict() {
		return firstDistrict;
	}

	public String getSecondDistrict() {
		return secondDistrict;
	}
	
	public String getThirdDistrict() {
		return thirdDistrict;
	}
	
	public String getFullName() {
		
		return firstDistrict.concat(secondDistrict).concat(thirdDistrict);
	}
	
	public static Map<Object, Object> getResult(String code) {

		if (ValidatorUtil.isAreaCode(code)) {

			for (ChinaEastAreaCodeEnum e : ChinaEastAreaCodeEnum.values()) {

				if (code.equals(e.getCode())) {

					return getResult(e);
				}
			}
		}
		return null;
	}
	
	public static String getCode(String name) {
		
		if (ValidatorUtil.isNotEmptyIgnoreBlank(name)) {
			
			String fullName = null;
			for (ChinaEastAreaCodeEnum e : ChinaEastAreaCodeEnum.values()) {
				
				fullName = e.getFirstDistrict().concat(e.getSecondDistrict()).concat(e.getThirdDistrict());
				if (fullName.equals(name)) {
					
					return e.getCode();
				}
			}
		}
		return null;
	}
	
	public static String getName(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaEastAreaCodeEnum e : ChinaEastAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return getName(e);
				}
			}
		}
		return null;
	}
	
	public static String getFullName(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaEastAreaCodeEnum e : ChinaEastAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return e.getFirstDistrict().concat(e.getSecondDistrict()).concat(e.getThirdDistrict());
				}
			}
		}
		return null;
	}
	
	public static String matchCode(String name) {
		
		final String REGEX = "畲族自治县|省|市|区|县";
		String code = null;
		String str1 = null;
		String str2 = null;
		String str3 = null;
		Map<String, String> map1 = new HashMap<String, String>();
		Map<String, String> map2 = new LinkedHashMap<String, String>();
		Map<String, String> map3 = new HashMap<String, String>();
		if (ValidatorUtil.isNotEmptyIgnoreBlank(name)) {
			
			code = matchSpecial(name);
			if (null == code) {
				
				for (ChinaEastAreaCodeEnum e : ChinaEastAreaCodeEnum.values()) {
					
					str1 = e.getFirstDistrict();
					str2 = e.getSecondDistrict();
					str3 = e.getThirdDistrict();
					if (ValidatorUtil.isNotEmpty(str3)) {
						
						map3.put(e.getCode(), (str1.concat(str2).concat(str3)).replaceAll(REGEX, ""));
						map2.put(e.getCode(), (str1.concat(str3)).replaceAll(REGEX, ""));
					}
					if (ValidatorUtil.isEmpty(str3) && ValidatorUtil.isNotEmpty(str2)) {
						
						map2.put(e.getCode(), (str1.concat(str2)).replaceAll(REGEX, ""));
					}
					if (ValidatorUtil.isAllEmpty(str2, str3)) {
						
						map1.put(e.getCode(), str1.replaceAll(REGEX, ""));
					}
				}
				
				name = name.replaceAll(REGEX, "");
				code = getCode(name, map1, map2, map3);
				if (null == code) {
					
					name = name.replaceAll("(?s)(.)(?=.*\\1)", "");
					code = getCode(name, map1, map2, map3);
				}
			}
		}
		return code;
	}
	
	private static String getCode(String name, Map<String, String> map1, Map<String, String> map2, Map<String, String> map3) {
		
		String code = matchCode(name, map3);
		if (null == code) {
			
			code = matchCode(name, map2);
		}
		if (null == code) {
			
			code = matchCode(name, map1);
		}
		return code;
	}
	
	private static String matchCode(String name, Map<String, String> map) {
		
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.equals(entry.getValue())) {
				
				return entry.getKey();
			}
		}
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.startsWith(entry.getValue())) {
				
				return entry.getKey();
			}
		}
		return null;
	}
	
	private static String matchSpecial(String name) {
		
		if (name.startsWith("江苏")) {
			
			if (name.contains(ChinaEastAreaCodeEnum.ITEM320803.getThirdDistrict())) {
				// 江苏省淮安市淮安区
				return ChinaEastAreaCodeEnum.ITEM320803.getCode();
			}
		}
		if (name.startsWith("安徽")) {
			
			if (name.contains(ChinaEastAreaCodeEnum.ITEM340221.getThirdDistrict())) {
				// 安徽省芜湖市芜湖县
				return ChinaEastAreaCodeEnum.ITEM340221.getCode();
			}
			if (name.contains(ChinaEastAreaCodeEnum.ITEM341003.getThirdDistrict())) {
				// 安徽省黄山市黄山区
				return ChinaEastAreaCodeEnum.ITEM341003.getCode();
			}
		}
		if (name.startsWith("江西")) {
			
			if (name.contains(ChinaEastAreaCodeEnum.ITEM360121.getThirdDistrict())) {
				// 江西省南昌市南昌县
				return ChinaEastAreaCodeEnum.ITEM360121.getCode();
			}
			if (name.contains(ChinaEastAreaCodeEnum.ITEM360421.getThirdDistrict())) {
				// 江西省九江市九江县
				return ChinaEastAreaCodeEnum.ITEM360421.getCode();
			}
			if (name.contains(ChinaEastAreaCodeEnum.ITEM360821.getThirdDistrict())) {
				// 江西省吉安市吉安县
				return ChinaEastAreaCodeEnum.ITEM360821.getCode();
			}
			if (name.contains(ChinaEastAreaCodeEnum.ITEM361121.getThirdDistrict())) {
				// 江西省上饶市上饶县
				return ChinaEastAreaCodeEnum.ITEM361121.getCode();
			}
		}
		if (name.startsWith("山东")) {
			
			if (name.contains(ChinaEastAreaCodeEnum.ITEM370502.getThirdDistrict())) {
				// 山东省东营市东营区
				return ChinaEastAreaCodeEnum.ITEM370502.getCode();
			}
		}
		return null;
	}
	
	private static String getName(ChinaEastAreaCodeEnum e) {
		
		String name = e.getThirdDistrict();
		if (ValidatorUtil.isEmpty(name)) {
			
			name = e.getSecondDistrict();
		}
		if (ValidatorUtil.isEmpty(name)) {
			
			name = e.getFirstDistrict();
		}
		return ValidatorUtil.isEmpty(name) ? null : name;
	}
	
	private static Map<Object, Object> getResult(ChinaEastAreaCodeEnum e) {
		
		String district = null;
		Map<Object, Object> map = new HashMap<Object, Object>();
		map.put("code", e.getCode());
		
		district = e.getFirstDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("firstDistrict", district);
		}
		district = e.getSecondDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("secondDistrict", district);
		}
		district = e.getThirdDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("thirdDistrict", district);
		}
		return map;
	}
}
