package cn.datawe.constant;

import java.util.HashMap;
import java.util.LinkedHashMap;
import java.util.Map;

import cn.datawe.util.ValidatorUtil;

/**
 * 枚举类:华中地区行政区划
 * <br>数据更新日期:2016-08-24
 * 
 * @author LiuJiaLe
 * 
 */
public enum ChinaCentralAreaCodeEnum {

	ITEM410000("410000", "河南省", "", ""),
	ITEM410100("410100", "河南省", "郑州市", ""),
	ITEM410102("410102", "河南省", "郑州市", "中原区"),
	ITEM410103("410103", "河南省", "郑州市", "二七区"),
	ITEM410104("410104", "河南省", "郑州市", "管城回族区"),
	ITEM410105("410105", "河南省", "郑州市", "金水区"),
	ITEM410106("410106", "河南省", "郑州市", "上街区"),
	ITEM410108("410108", "河南省", "郑州市", "惠济区"),
	ITEM410122("410122", "河南省", "郑州市", "中牟县"),
	ITEM410181("410181", "河南省", "郑州市", "巩义市"),
	ITEM410182("410182", "河南省", "郑州市", "荥阳市"),
	ITEM410183("410183", "河南省", "郑州市", "新密市"),
	ITEM410184("410184", "河南省", "郑州市", "新郑市"),
	ITEM410185("410185", "河南省", "郑州市", "登封市"),
	ITEM410200("410200", "河南省", "开封市", ""),
	ITEM410202("410202", "河南省", "开封市", "龙亭区"),
	ITEM410203("410203", "河南省", "开封市", "顺河回族区"),
	ITEM410204("410204", "河南省", "开封市", "鼓楼区"),
	ITEM410205("410205", "河南省", "开封市", "禹王台区"),
	ITEM410212("410212", "河南省", "开封市", "祥符区"),
	ITEM410221("410221", "河南省", "开封市", "杞县"),
	ITEM410222("410222", "河南省", "开封市", "通许县"),
	ITEM410223("410223", "河南省", "开封市", "尉氏县"),
	ITEM410225("410225", "河南省", "开封市", "兰考县"),
	ITEM410300("410300", "河南省", "洛阳市", ""),
	ITEM410302("410302", "河南省", "洛阳市", "老城区"),
	ITEM410303("410303", "河南省", "洛阳市", "西工区"),
	ITEM410304("410304", "河南省", "洛阳市", "瀍河回族区"),
	ITEM410305("410305", "河南省", "洛阳市", "涧西区"),
	ITEM410306("410306", "河南省", "洛阳市", "吉利区"),
	ITEM410311("410311", "河南省", "洛阳市", "洛龙区"),
	ITEM410322("410322", "河南省", "洛阳市", "孟津县"),
	ITEM410323("410323", "河南省", "洛阳市", "新安县"),
	ITEM410324("410324", "河南省", "洛阳市", "栾川县"),
	ITEM410325("410325", "河南省", "洛阳市", "嵩县"),
	ITEM410326("410326", "河南省", "洛阳市", "汝阳县"),
	ITEM410327("410327", "河南省", "洛阳市", "宜阳县"),
	ITEM410328("410328", "河南省", "洛阳市", "洛宁县"),
	ITEM410329("410329", "河南省", "洛阳市", "伊川县"),
	ITEM410381("410381", "河南省", "洛阳市", "偃师市"),
	ITEM410400("410400", "河南省", "平顶山市", ""),
	ITEM410402("410402", "河南省", "平顶山市", "新华区"),
	ITEM410403("410403", "河南省", "平顶山市", "卫东区"),
	ITEM410404("410404", "河南省", "平顶山市", "石龙区"),
	ITEM410411("410411", "河南省", "平顶山市", "湛河区"),
	ITEM410421("410421", "河南省", "平顶山市", "宝丰县"),
	ITEM410422("410422", "河南省", "平顶山市", "叶县"),
	ITEM410423("410423", "河南省", "平顶山市", "鲁山县"),
	ITEM410425("410425", "河南省", "平顶山市", "郏县"),
	ITEM410481("410481", "河南省", "平顶山市", "舞钢市"),
	ITEM410482("410482", "河南省", "平顶山市", "汝州市"),
	ITEM410500("410500", "河南省", "安阳市", ""),
	ITEM410502("410502", "河南省", "安阳市", "文峰区"),
	ITEM410503("410503", "河南省", "安阳市", "北关区"),
	ITEM410505("410505", "河南省", "安阳市", "殷都区"),
	ITEM410506("410506", "河南省", "安阳市", "龙安区"),
	ITEM410522("410522", "河南省", "安阳市", "安阳县"),
	ITEM410523("410523", "河南省", "安阳市", "汤阴县"),
	ITEM410526("410526", "河南省", "安阳市", "滑县"),
	ITEM410527("410527", "河南省", "安阳市", "内黄县"),
	ITEM410581("410581", "河南省", "安阳市", "林州市"),
	ITEM410600("410600", "河南省", "鹤壁市", ""),
	ITEM410602("410602", "河南省", "鹤壁市", "鹤山区"),
	ITEM410603("410603", "河南省", "鹤壁市", "山城区"),
	ITEM410611("410611", "河南省", "鹤壁市", "淇滨区"),
	ITEM410621("410621", "河南省", "鹤壁市", "浚县"),
	ITEM410622("410622", "河南省", "鹤壁市", "淇县"),
	ITEM410700("410700", "河南省", "新乡市", ""),
	ITEM410702("410702", "河南省", "新乡市", "红旗区"),
	ITEM410703("410703", "河南省", "新乡市", "卫滨区"),
	ITEM410704("410704", "河南省", "新乡市", "凤泉区"),
	ITEM410711("410711", "河南省", "新乡市", "牧野区"),
	ITEM410721("410721", "河南省", "新乡市", "新乡县"),
	ITEM410724("410724", "河南省", "新乡市", "获嘉县"),
	ITEM410725("410725", "河南省", "新乡市", "原阳县"),
	ITEM410726("410726", "河南省", "新乡市", "延津县"),
	ITEM410727("410727", "河南省", "新乡市", "封丘县"),
	ITEM410728("410728", "河南省", "新乡市", "长垣县"),
	ITEM410781("410781", "河南省", "新乡市", "卫辉市"),
	ITEM410782("410782", "河南省", "新乡市", "辉县市"),
	ITEM410800("410800", "河南省", "焦作市", ""),
	ITEM410802("410802", "河南省", "焦作市", "解放区"),
	ITEM410803("410803", "河南省", "焦作市", "中站区"),
	ITEM410804("410804", "河南省", "焦作市", "马村区"),
	ITEM410811("410811", "河南省", "焦作市", "山阳区"),
	ITEM410821("410821", "河南省", "焦作市", "修武县"),
	ITEM410822("410822", "河南省", "焦作市", "博爱县"),
	ITEM410823("410823", "河南省", "焦作市", "武陟县"),
	ITEM410825("410825", "河南省", "焦作市", "温县"),
	ITEM410882("410882", "河南省", "焦作市", "沁阳市"),
	ITEM410883("410883", "河南省", "焦作市", "孟州市"),
	ITEM410900("410900", "河南省", "濮阳市", ""),
	ITEM410902("410902", "河南省", "濮阳市", "华龙区"),
	ITEM410922("410922", "河南省", "濮阳市", "清丰县"),
	ITEM410923("410923", "河南省", "濮阳市", "南乐县"),
	ITEM410926("410926", "河南省", "濮阳市", "范县"),
	ITEM410927("410927", "河南省", "濮阳市", "台前县"),
	ITEM410928("410928", "河南省", "濮阳市", "濮阳县"),
	ITEM411000("411000", "河南省", "许昌市", ""),
	ITEM411002("411002", "河南省", "许昌市", "魏都区"),
	ITEM411023("411023", "河南省", "许昌市", "许昌县"),
	ITEM411024("411024", "河南省", "许昌市", "鄢陵县"),
	ITEM411025("411025", "河南省", "许昌市", "襄城县"),
	ITEM411081("411081", "河南省", "许昌市", "禹州市"),
	ITEM411082("411082", "河南省", "许昌市", "长葛市"),
	ITEM411100("411100", "河南省", "漯河市", ""),
	ITEM411102("411102", "河南省", "漯河市", "源汇区"),
	ITEM411103("411103", "河南省", "漯河市", "郾城区"),
	ITEM411104("411104", "河南省", "漯河市", "召陵区"),
	ITEM411121("411121", "河南省", "漯河市", "舞阳县"),
	ITEM411122("411122", "河南省", "漯河市", "临颍县"),
	ITEM411200("411200", "河南省", "三门峡市", ""),
	ITEM411202("411202", "河南省", "三门峡市", "湖滨区"),
	ITEM411203("411203", "河南省", "三门峡市", "陕州区"),
	ITEM411221("411221", "河南省", "三门峡市", "渑池县"),
	ITEM411224("411224", "河南省", "三门峡市", "卢氏县"),
	ITEM411281("411281", "河南省", "三门峡市", "义马市"),
	ITEM411282("411282", "河南省", "三门峡市", "灵宝市"),
	ITEM411300("411300", "河南省", "南阳市", ""),
	ITEM411302("411302", "河南省", "南阳市", "宛城区"),
	ITEM411303("411303", "河南省", "南阳市", "卧龙区"),
	ITEM411321("411321", "河南省", "南阳市", "南召县"),
	ITEM411322("411322", "河南省", "南阳市", "方城县"),
	ITEM411323("411323", "河南省", "南阳市", "西峡县"),
	ITEM411324("411324", "河南省", "南阳市", "镇平县"),
	ITEM411325("411325", "河南省", "南阳市", "内乡县"),
	ITEM411326("411326", "河南省", "南阳市", "淅川县"),
	ITEM411327("411327", "河南省", "南阳市", "社旗县"),
	ITEM411328("411328", "河南省", "南阳市", "唐河县"),
	ITEM411329("411329", "河南省", "南阳市", "新野县"),
	ITEM411330("411330", "河南省", "南阳市", "桐柏县"),
	ITEM411381("411381", "河南省", "南阳市", "邓州市"),
	ITEM411400("411400", "河南省", "商丘市", ""),
	ITEM411402("411402", "河南省", "商丘市", "梁园区"),
	ITEM411403("411403", "河南省", "商丘市", "睢阳区"),
	ITEM411421("411421", "河南省", "商丘市", "民权县"),
	ITEM411422("411422", "河南省", "商丘市", "睢县"),
	ITEM411423("411423", "河南省", "商丘市", "宁陵县"),
	ITEM411424("411424", "河南省", "商丘市", "柘城县"),
	ITEM411425("411425", "河南省", "商丘市", "虞城县"),
	ITEM411426("411426", "河南省", "商丘市", "夏邑县"),
	ITEM411481("411481", "河南省", "商丘市", "永城市"),
	ITEM411500("411500", "河南省", "信阳市", ""),
	ITEM411502("411502", "河南省", "信阳市", "浉河区"),
	ITEM411503("411503", "河南省", "信阳市", "平桥区"),
	ITEM411521("411521", "河南省", "信阳市", "罗山县"),
	ITEM411522("411522", "河南省", "信阳市", "光山县"),
	ITEM411523("411523", "河南省", "信阳市", "新县"),
	ITEM411524("411524", "河南省", "信阳市", "商城县"),
	ITEM411525("411525", "河南省", "信阳市", "固始县"),
	ITEM411526("411526", "河南省", "信阳市", "潢川县"),
	ITEM411527("411527", "河南省", "信阳市", "淮滨县"),
	ITEM411528("411528", "河南省", "信阳市", "息县"),
	ITEM411600("411600", "河南省", "周口市", ""),
	ITEM411602("411602", "河南省", "周口市", "川汇区"),
	ITEM411621("411621", "河南省", "周口市", "扶沟县"),
	ITEM411622("411622", "河南省", "周口市", "西华县"),
	ITEM411623("411623", "河南省", "周口市", "商水县"),
	ITEM411624("411624", "河南省", "周口市", "沈丘县"),
	ITEM411625("411625", "河南省", "周口市", "郸城县"),
	ITEM411626("411626", "河南省", "周口市", "淮阳县"),
	ITEM411627("411627", "河南省", "周口市", "太康县"),
	ITEM411628("411628", "河南省", "周口市", "鹿邑县"),
	ITEM411681("411681", "河南省", "周口市", "项城市"),
	ITEM411700("411700", "河南省", "驻马店市", ""),
	ITEM411702("411702", "河南省", "驻马店市", "驿城区"),
	ITEM411721("411721", "河南省", "驻马店市", "西平县"),
	ITEM411722("411722", "河南省", "驻马店市", "上蔡县"),
	ITEM411723("411723", "河南省", "驻马店市", "平舆县"),
	ITEM411724("411724", "河南省", "驻马店市", "正阳县"),
	ITEM411725("411725", "河南省", "驻马店市", "确山县"),
	ITEM411726("411726", "河南省", "驻马店市", "泌阳县"),
	ITEM411727("411727", "河南省", "驻马店市", "汝南县"),
	ITEM411728("411728", "河南省", "驻马店市", "遂平县"),
	ITEM411729("411729", "河南省", "驻马店市", "新蔡县"),
	ITEM419001("419001", "河南省", "济源市", ""),
	
	ITEM420000("420000", "湖北省", "", ""),
	ITEM420100("420100", "湖北省", "武汉市", ""),
	ITEM420102("420102", "湖北省", "武汉市", "江岸区"),
	ITEM420103("420103", "湖北省", "武汉市", "江汉区"),
	ITEM420104("420104", "湖北省", "武汉市", "硚口区"),
	ITEM420105("420105", "湖北省", "武汉市", "汉阳区"),
	ITEM420106("420106", "湖北省", "武汉市", "武昌区"),
	ITEM420107("420107", "湖北省", "武汉市", "青山区"),
	ITEM420111("420111", "湖北省", "武汉市", "洪山区"),
	ITEM420112("420112", "湖北省", "武汉市", "东西湖区"),
	ITEM420113("420113", "湖北省", "武汉市", "汉南区"),
	ITEM420114("420114", "湖北省", "武汉市", "蔡甸区"),
	ITEM420115("420115", "湖北省", "武汉市", "江夏区"),
	ITEM420116("420116", "湖北省", "武汉市", "黄陂区"),
	ITEM420117("420117", "湖北省", "武汉市", "新洲区"),
	ITEM420200("420200", "湖北省", "黄石市", ""),
	ITEM420202("420202", "湖北省", "黄石市", "黄石港区"),
	ITEM420203("420203", "湖北省", "黄石市", "西塞山区"),
	ITEM420204("420204", "湖北省", "黄石市", "下陆区"),
	ITEM420205("420205", "湖北省", "黄石市", "铁山区"),
	ITEM420222("420222", "湖北省", "黄石市", "阳新县"),
	ITEM420281("420281", "湖北省", "黄石市", "大冶市"),
	ITEM420300("420300", "湖北省", "十堰市", ""),
	ITEM420302("420302", "湖北省", "十堰市", "茅箭区"),
	ITEM420303("420303", "湖北省", "十堰市", "张湾区"),
	ITEM420304("420304", "湖北省", "十堰市", "郧阳区"),
	ITEM420322("420322", "湖北省", "十堰市", "郧西县"),
	ITEM420323("420323", "湖北省", "十堰市", "竹山县"),
	ITEM420324("420324", "湖北省", "十堰市", "竹溪县"),
	ITEM420325("420325", "湖北省", "十堰市", "房县"),
	ITEM420381("420381", "湖北省", "十堰市", "丹江口市"),
	ITEM420500("420500", "湖北省", "宜昌市", ""),
	ITEM420502("420502", "湖北省", "宜昌市", "西陵区"),
	ITEM420503("420503", "湖北省", "宜昌市", "伍家岗区"),
	ITEM420504("420504", "湖北省", "宜昌市", "点军区"),
	ITEM420505("420505", "湖北省", "宜昌市", "猇亭区"),
	ITEM420506("420506", "湖北省", "宜昌市", "夷陵区"),
	ITEM420525("420525", "湖北省", "宜昌市", "远安县"),
	ITEM420526("420526", "湖北省", "宜昌市", "兴山县"),
	ITEM420527("420527", "湖北省", "宜昌市", "秭归县"),
	ITEM420528("420528", "湖北省", "宜昌市", "长阳土家族自治县"),
	ITEM420529("420529", "湖北省", "宜昌市", "五峰土家族自治县"),
	ITEM420581("420581", "湖北省", "宜昌市", "宜都市"),
	ITEM420582("420582", "湖北省", "宜昌市", "当阳市"),
	ITEM420583("420583", "湖北省", "宜昌市", "枝江市"),
	ITEM420600("420600", "湖北省", "襄阳市", ""),
	ITEM420602("420602", "湖北省", "襄阳市", "襄城区"),
	ITEM420606("420606", "湖北省", "襄阳市", "樊城区"),
	ITEM420607("420607", "湖北省", "襄阳市", "襄州区"),
	ITEM420624("420624", "湖北省", "襄阳市", "南漳县"),
	ITEM420625("420625", "湖北省", "襄阳市", "谷城县"),
	ITEM420626("420626", "湖北省", "襄阳市", "保康县"),
	ITEM420682("420682", "湖北省", "襄阳市", "老河口市"),
	ITEM420683("420683", "湖北省", "襄阳市", "枣阳市"),
	ITEM420684("420684", "湖北省", "襄阳市", "宜城市"),
	ITEM420700("420700", "湖北省", "鄂州市", ""),
	ITEM420702("420702", "湖北省", "鄂州市", "梁子湖区"),
	ITEM420703("420703", "湖北省", "鄂州市", "华容区"),
	ITEM420704("420704", "湖北省", "鄂州市", "鄂城区"),
	ITEM420800("420800", "湖北省", "荆门市", ""),
	ITEM420802("420802", "湖北省", "荆门市", "东宝区"),
	ITEM420804("420804", "湖北省", "荆门市", "掇刀区"),
	ITEM420821("420821", "湖北省", "荆门市", "京山县"),
	ITEM420822("420822", "湖北省", "荆门市", "沙洋县"),
	ITEM420881("420881", "湖北省", "荆门市", "钟祥市"),
	ITEM420900("420900", "湖北省", "孝感市", ""),
	ITEM420902("420902", "湖北省", "孝感市", "孝南区"),
	ITEM420921("420921", "湖北省", "孝感市", "孝昌县"),
	ITEM420922("420922", "湖北省", "孝感市", "大悟县"),
	ITEM420923("420923", "湖北省", "孝感市", "云梦县"),
	ITEM420981("420981", "湖北省", "孝感市", "应城市"),
	ITEM420982("420982", "湖北省", "孝感市", "安陆市"),
	ITEM420984("420984", "湖北省", "孝感市", "汉川市"),
	ITEM421000("421000", "湖北省", "荆州市", ""),
	ITEM421002("421002", "湖北省", "荆州市", "沙市区"),
	ITEM421003("421003", "湖北省", "荆州市", "荆州区"),
	ITEM421022("421022", "湖北省", "荆州市", "公安县"),
	ITEM421023("421023", "湖北省", "荆州市", "监利县"),
	ITEM421024("421024", "湖北省", "荆州市", "江陵县"),
	ITEM421081("421081", "湖北省", "荆州市", "石首市"),
	ITEM421083("421083", "湖北省", "荆州市", "洪湖市"),
	ITEM421087("421087", "湖北省", "荆州市", "松滋市"),
	ITEM421100("421100", "湖北省", "黄冈市", ""),
	ITEM421102("421102", "湖北省", "黄冈市", "黄州区"),
	ITEM421121("421121", "湖北省", "黄冈市", "团风县"),
	ITEM421122("421122", "湖北省", "黄冈市", "红安县"),
	ITEM421123("421123", "湖北省", "黄冈市", "罗田县"),
	ITEM421124("421124", "湖北省", "黄冈市", "英山县"),
	ITEM421125("421125", "湖北省", "黄冈市", "浠水县"),
	ITEM421126("421126", "湖北省", "黄冈市", "蕲春县"),
	ITEM421127("421127", "湖北省", "黄冈市", "黄梅县"),
	ITEM421181("421181", "湖北省", "黄冈市", "麻城市"),
	ITEM421182("421182", "湖北省", "黄冈市", "武穴市"),
	ITEM421200("421200", "湖北省", "咸宁市", ""),
	ITEM421202("421202", "湖北省", "咸宁市", "咸安区"),
	ITEM421221("421221", "湖北省", "咸宁市", "嘉鱼县"),
	ITEM421222("421222", "湖北省", "咸宁市", "通城县"),
	ITEM421223("421223", "湖北省", "咸宁市", "崇阳县"),
	ITEM421224("421224", "湖北省", "咸宁市", "通山县"),
	ITEM421281("421281", "湖北省", "咸宁市", "赤壁市"),
	ITEM421300("421300", "湖北省", "随州市", ""),
	ITEM421303("421303", "湖北省", "随州市", "曾都区"),
	ITEM421321("421321", "湖北省", "随州市", "随县"),
	ITEM421381("421381", "湖北省", "随州市", "广水市"),
	ITEM422800("422800", "湖北省", "恩施土家族苗族自治州", ""),
	ITEM422801("422801", "湖北省", "恩施土家族苗族自治州", "恩施市"),
	ITEM422802("422802", "湖北省", "恩施土家族苗族自治州", "利川市"),
	ITEM422822("422822", "湖北省", "恩施土家族苗族自治州", "建始县"),
	ITEM422823("422823", "湖北省", "恩施土家族苗族自治州", "巴东县"),
	ITEM422825("422825", "湖北省", "恩施土家族苗族自治州", "宣恩县"),
	ITEM422826("422826", "湖北省", "恩施土家族苗族自治州", "咸丰县"),
	ITEM422827("422827", "湖北省", "恩施土家族苗族自治州", "来凤县"),
	ITEM422828("422828", "湖北省", "恩施土家族苗族自治州", "鹤峰县"),
	ITEM429004("429004", "湖北省", "仙桃市", ""),
	ITEM429005("429005", "湖北省", "潜江市", ""),
	ITEM429006("429006", "湖北省", "天门市", ""),
	ITEM429021("429021", "湖北省", "神农架林区", ""),
	
	ITEM430000("430000", "湖南省", "", ""),
	ITEM430100("430100", "湖南省", "长沙市", ""),
	ITEM430102("430102", "湖南省", "长沙市", "芙蓉区"),
	ITEM430103("430103", "湖南省", "长沙市", "天心区"),
	ITEM430104("430104", "湖南省", "长沙市", "岳麓区"),
	ITEM430105("430105", "湖南省", "长沙市", "开福区"),
	ITEM430111("430111", "湖南省", "长沙市", "雨花区"),
	ITEM430112("430112", "湖南省", "长沙市", "望城区"),
	ITEM430121("430121", "湖南省", "长沙市", "长沙县"),
	ITEM430124("430124", "湖南省", "长沙市", "宁乡县"),
	ITEM430181("430181", "湖南省", "长沙市", "浏阳市"),
	ITEM430200("430200", "湖南省", "株洲市", ""),
	ITEM430202("430202", "湖南省", "株洲市", "荷塘区"),
	ITEM430203("430203", "湖南省", "株洲市", "芦淞区"),
	ITEM430204("430204", "湖南省", "株洲市", "石峰区"),
	ITEM430211("430211", "湖南省", "株洲市", "天元区"),
	ITEM430221("430221", "湖南省", "株洲市", "株洲县"),
	ITEM430223("430223", "湖南省", "株洲市", "攸县"),
	ITEM430224("430224", "湖南省", "株洲市", "茶陵县"),
	ITEM430225("430225", "湖南省", "株洲市", "炎陵县"),
	ITEM430281("430281", "湖南省", "株洲市", "醴陵市"),
	ITEM430300("430300", "湖南省", "湘潭市", ""),
	ITEM430302("430302", "湖南省", "湘潭市", "雨湖区"),
	ITEM430304("430304", "湖南省", "湘潭市", "岳塘区"),
	ITEM430321("430321", "湖南省", "湘潭市", "湘潭县"),
	ITEM430381("430381", "湖南省", "湘潭市", "湘乡市"),
	ITEM430382("430382", "湖南省", "湘潭市", "韶山市"),
	ITEM430400("430400", "湖南省", "衡阳市", ""),
	ITEM430405("430405", "湖南省", "衡阳市", "珠晖区"),
	ITEM430406("430406", "湖南省", "衡阳市", "雁峰区"),
	ITEM430407("430407", "湖南省", "衡阳市", "石鼓区"),
	ITEM430408("430408", "湖南省", "衡阳市", "蒸湘区"),
	ITEM430412("430412", "湖南省", "衡阳市", "南岳区"),
	ITEM430421("430421", "湖南省", "衡阳市", "衡阳县"),
	ITEM430422("430422", "湖南省", "衡阳市", "衡南县"),
	ITEM430423("430423", "湖南省", "衡阳市", "衡山县"),
	ITEM430424("430424", "湖南省", "衡阳市", "衡东县"),
	ITEM430426("430426", "湖南省", "衡阳市", "祁东县"),
	ITEM430481("430481", "湖南省", "衡阳市", "耒阳市"),
	ITEM430482("430482", "湖南省", "衡阳市", "常宁市"),
	ITEM430500("430500", "湖南省", "邵阳市", ""),
	ITEM430502("430502", "湖南省", "邵阳市", "双清区"),
	ITEM430503("430503", "湖南省", "邵阳市", "大祥区"),
	ITEM430511("430511", "湖南省", "邵阳市", "北塔区"),
	ITEM430521("430521", "湖南省", "邵阳市", "邵东县"),
	ITEM430522("430522", "湖南省", "邵阳市", "新邵县"),
	ITEM430523("430523", "湖南省", "邵阳市", "邵阳县"),
	ITEM430524("430524", "湖南省", "邵阳市", "隆回县"),
	ITEM430525("430525", "湖南省", "邵阳市", "洞口县"),
	ITEM430527("430527", "湖南省", "邵阳市", "绥宁县"),
	ITEM430528("430528", "湖南省", "邵阳市", "新宁县"),
	ITEM430529("430529", "湖南省", "邵阳市", "城步苗族自治县"),
	ITEM430581("430581", "湖南省", "邵阳市", "武冈市"),
	ITEM430600("430600", "湖南省", "岳阳市", ""),
	ITEM430602("430602", "湖南省", "岳阳市", "岳阳楼区"),
	ITEM430603("430603", "湖南省", "岳阳市", "云溪区"),
	ITEM430611("430611", "湖南省", "岳阳市", "君山区"),
	ITEM430621("430621", "湖南省", "岳阳市", "岳阳县"),
	ITEM430623("430623", "湖南省", "岳阳市", "华容县"),
	ITEM430624("430624", "湖南省", "岳阳市", "湘阴县"),
	ITEM430626("430626", "湖南省", "岳阳市", "平江县"),
	ITEM430681("430681", "湖南省", "岳阳市", "汨罗市"),
	ITEM430682("430682", "湖南省", "岳阳市", "临湘市"),
	ITEM430700("430700", "湖南省", "常德市", ""),
	ITEM430702("430702", "湖南省", "常德市", "武陵区"),
	ITEM430703("430703", "湖南省", "常德市", "鼎城区"),
	ITEM430721("430721", "湖南省", "常德市", "安乡县"),
	ITEM430722("430722", "湖南省", "常德市", "汉寿县"),
	ITEM430723("430723", "湖南省", "常德市", "澧县"),
	ITEM430724("430724", "湖南省", "常德市", "临澧县"),
	ITEM430725("430725", "湖南省", "常德市", "桃源县"),
	ITEM430726("430726", "湖南省", "常德市", "石门县"),
	ITEM430781("430781", "湖南省", "常德市", "津市市"),
	ITEM430800("430800", "湖南省", "张家界市", ""),
	ITEM430802("430802", "湖南省", "张家界市", "永定区"),
	ITEM430811("430811", "湖南省", "张家界市", "武陵源区"),
	ITEM430821("430821", "湖南省", "张家界市", "慈利县"),
	ITEM430822("430822", "湖南省", "张家界市", "桑植县"),
	ITEM430900("430900", "湖南省", "益阳市", ""),
	ITEM430902("430902", "湖南省", "益阳市", "资阳区"),
	ITEM430903("430903", "湖南省", "益阳市", "赫山区"),
	ITEM430921("430921", "湖南省", "益阳市", "南县"),
	ITEM430922("430922", "湖南省", "益阳市", "桃江县"),
	ITEM430923("430923", "湖南省", "益阳市", "安化县"),
	ITEM430981("430981", "湖南省", "益阳市", "沅江市"),
	ITEM431000("431000", "湖南省", "郴州市", ""),
	ITEM431002("431002", "湖南省", "郴州市", "北湖区"),
	ITEM431003("431003", "湖南省", "郴州市", "苏仙区"),
	ITEM431021("431021", "湖南省", "郴州市", "桂阳县"),
	ITEM431022("431022", "湖南省", "郴州市", "宜章县"),
	ITEM431023("431023", "湖南省", "郴州市", "永兴县"),
	ITEM431024("431024", "湖南省", "郴州市", "嘉禾县"),
	ITEM431025("431025", "湖南省", "郴州市", "临武县"),
	ITEM431026("431026", "湖南省", "郴州市", "汝城县"),
	ITEM431027("431027", "湖南省", "郴州市", "桂东县"),
	ITEM431028("431028", "湖南省", "郴州市", "安仁县"),
	ITEM431081("431081", "湖南省", "郴州市", "资兴市"),
	ITEM431100("431100", "湖南省", "永州市", ""),
	ITEM431102("431102", "湖南省", "永州市", "零陵区"),
	ITEM431103("431103", "湖南省", "永州市", "冷水滩区"),
	ITEM431121("431121", "湖南省", "永州市", "祁阳县"),
	ITEM431122("431122", "湖南省", "永州市", "东安县"),
	ITEM431123("431123", "湖南省", "永州市", "双牌县"),
	ITEM431124("431124", "湖南省", "永州市", "道县"),
	ITEM431125("431125", "湖南省", "永州市", "江永县"),
	ITEM431126("431126", "湖南省", "永州市", "宁远县"),
	ITEM431127("431127", "湖南省", "永州市", "蓝山县"),
	ITEM431128("431128", "湖南省", "永州市", "新田县"),
	ITEM431129("431129", "湖南省", "永州市", "江华瑶族自治县"),
	ITEM431200("431200", "湖南省", "怀化市", ""),
	ITEM431202("431202", "湖南省", "怀化市", "鹤城区"),
	ITEM431221("431221", "湖南省", "怀化市", "中方县"),
	ITEM431222("431222", "湖南省", "怀化市", "沅陵县"),
	ITEM431223("431223", "湖南省", "怀化市", "辰溪县"),
	ITEM431224("431224", "湖南省", "怀化市", "溆浦县"),
	ITEM431225("431225", "湖南省", "怀化市", "会同县"),
	ITEM431226("431226", "湖南省", "怀化市", "麻阳苗族自治县"),
	ITEM431227("431227", "湖南省", "怀化市", "新晃侗族自治县"),
	ITEM431228("431228", "湖南省", "怀化市", "芷江侗族自治县"),
	ITEM431229("431229", "湖南省", "怀化市", "靖州苗族侗族自治县"),
	ITEM431230("431230", "湖南省", "怀化市", "通道侗族自治县"),
	ITEM431281("431281", "湖南省", "怀化市", "洪江市"),
	ITEM431300("431300", "湖南省", "娄底市", ""),
	ITEM431302("431302", "湖南省", "娄底市", "娄星区"),
	ITEM431321("431321", "湖南省", "娄底市", "双峰县"),
	ITEM431322("431322", "湖南省", "娄底市", "新化县"),
	ITEM431381("431381", "湖南省", "娄底市", "冷水江市"),
	ITEM431382("431382", "湖南省", "娄底市", "涟源市"),
	ITEM433100("433100", "湖南省", "湘西土家族苗族自治州", ""),
	ITEM433101("433101", "湖南省", "湘西土家族苗族自治州", "吉首市"),
	ITEM433122("433122", "湖南省", "湘西土家族苗族自治州", "泸溪县"),
	ITEM433123("433123", "湖南省", "湘西土家族苗族自治州", "凤凰县"),
	ITEM433124("433124", "湖南省", "湘西土家族苗族自治州", "花垣县"),
	ITEM433125("433125", "湖南省", "湘西土家族苗族自治州", "保靖县"),
	ITEM433126("433126", "湖南省", "湘西土家族苗族自治州", "古丈县"),
	ITEM433127("433127", "湖南省", "湘西土家族苗族自治州", "永顺县"),
	ITEM433130("433130", "湖南省", "湘西土家族苗族自治州", "龙山县"),
	;

	private String code;
	private String firstDistrict;
	private String secondDistrict;
	private String thirdDistrict;

	private ChinaCentralAreaCodeEnum(String code, String firstDistrict, String secondDistrict, String thirdDistrict) {
		this.code = code;
		this.firstDistrict = firstDistrict;
		this.secondDistrict = secondDistrict;
		this.thirdDistrict = thirdDistrict;
	}

	public String getCode() {
		return code;
	}

	public String getFirstDistrict() {
		return firstDistrict;
	}

	public String getSecondDistrict() {
		return secondDistrict;
	}
	
	public String getThirdDistrict() {
		return thirdDistrict;
	}
	
	public String getFullName() {
		
		return firstDistrict.concat(secondDistrict).concat(thirdDistrict);
	}
	
	public static Map<Object, Object> getResult(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaCentralAreaCodeEnum e : ChinaCentralAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return getResult(e);
				}
			}
		}
		return null;
	}
	
	public static String getCode(String name) {
		
		if (ValidatorUtil.isNotEmptyIgnoreBlank(name)) {
			
			String fullName = null;
			for (ChinaCentralAreaCodeEnum e : ChinaCentralAreaCodeEnum.values()) {
				
				fullName = e.getFirstDistrict().concat(e.getSecondDistrict()).concat(e.getThirdDistrict());
				if (fullName.equals(name)) {
					
					return e.getCode();
				}
			}
		}
		return null;
	}
	
	public static String getName(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaCentralAreaCodeEnum e : ChinaCentralAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return getName(e);
				}
			}
		}
		return null;
	}
	
	public static String getFullName(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaCentralAreaCodeEnum e : ChinaCentralAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return e.getFirstDistrict().concat(e.getSecondDistrict()).concat(e.getThirdDistrict());
				}
			}
		}
		return null;
	}
	
	public static String matchCode(String name) {
		
		final String REGEX = "土家族苗族自治州|苗族侗族自治县|土家族自治县|苗族自治县|瑶族自治县|侗族自治县|省|市|区|县";
		String code = null;
		String str1 = null;
		String str2 = null;
		String str3 = null;
		Map<String, String> map1 = new HashMap<String, String>();
		Map<String, String> map2 = new LinkedHashMap<String, String>();
		Map<String, String> map3 = new HashMap<String, String>();
		if (ValidatorUtil.isNotEmptyIgnoreBlank(name)) {
			
			code = matchSpecial(name);
			if (null == code) {
				
				for (ChinaCentralAreaCodeEnum e : ChinaCentralAreaCodeEnum.values()) {
					
					str1 = e.getFirstDistrict();
					str2 = e.getSecondDistrict();
					str3 = e.getThirdDistrict();
					if (ValidatorUtil.isNotEmpty(str3)) {
						
						map3.put(e.getCode(), (str1.concat(str2).concat(str3)).replaceAll(REGEX, ""));
						map2.put(e.getCode(), (str1.concat(str3)).replaceAll(REGEX, ""));
					}
					if (ValidatorUtil.isEmpty(str3) && ValidatorUtil.isNotEmpty(str2)) {
						
						map2.put(e.getCode(), (str1.concat(str2)).replaceAll(REGEX, ""));
					}
					if (ValidatorUtil.isAllEmpty(str2, str3)) {
						
						map1.put(e.getCode(), str1.replaceAll(REGEX, ""));
					}
				}
				
				name = name.replaceAll(REGEX, "");
				code = getCode(name, map1, map2, map3);
				if (null == code) {
					
					name = name.replaceAll("(?s)(.)(?=.*\\1)", "");
					code = getCode(name, map1, map2, map3);
				}
			}
		}
		return code;
	}
	
	private static String getCode(String name, Map<String, String> map1, Map<String, String> map2, Map<String, String> map3) {
		
		String code = matchCode(name, map3);
		if (null == code) {
			
			code = matchCode(name, map2);
		}
		if (null == code) {
			
			code = matchCode(name, map1);
		}
		return code;
	}
	
	private static String matchCode(String name, Map<String, String> map) {
		
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.equals(entry.getValue())) {
				
				return entry.getKey();
			}
		}
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.startsWith(entry.getValue())) {
				
				return entry.getKey();
			}
		}
		return null;
	}
	
	private static String matchSpecial(String name) {
		
		if (name.startsWith("河南")) {
			
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM410522.getThirdDistrict())) {
				// 河南省安阳市安阳县
				return ChinaCentralAreaCodeEnum.ITEM410522.getCode();
			}
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM410721.getThirdDistrict())) {
				// 河南省新乡市新乡县
				return ChinaCentralAreaCodeEnum.ITEM410721.getCode();
			}
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM410928.getThirdDistrict())) {
				// 河南省濮阳市濮阳县
				return ChinaCentralAreaCodeEnum.ITEM410928.getCode();
			}
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM411023.getThirdDistrict())) {
				// 河南省许昌市许昌县
				return ChinaCentralAreaCodeEnum.ITEM411023.getCode();
			}
		}
		if (name.startsWith("湖北")) {
			
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM421003.getThirdDistrict())) {
				// 湖北省荆州市荆州区
				return ChinaCentralAreaCodeEnum.ITEM421003.getCode();
			}
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM422801.getThirdDistrict())) {
				// 湖北省恩施土家族苗族自治州恩施市
				return ChinaCentralAreaCodeEnum.ITEM422801.getCode();
			}
		}
		if (name.startsWith("湖南")) {
			
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM430121.getThirdDistrict())) {
				// 湖南省长沙市长沙县
				return ChinaCentralAreaCodeEnum.ITEM430121.getCode();
			}
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM430221.getThirdDistrict())) {
				// 湖南省株洲市株洲县
				return ChinaCentralAreaCodeEnum.ITEM430221.getCode();
			}
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM430321.getThirdDistrict())) {
				// 湖南省湘潭市湘潭县
				return ChinaCentralAreaCodeEnum.ITEM430321.getCode();
			}
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM430421.getThirdDistrict())) {
				// 湖南省衡阳市衡阳县
				return ChinaCentralAreaCodeEnum.ITEM430421.getCode();
			}
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM430523.getThirdDistrict())) {
				// 湖南省邵阳市邵阳县
				return ChinaCentralAreaCodeEnum.ITEM430523.getCode();
			}
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM430602.getThirdDistrict()) || name.contains("岳阳楼")) {
				// 湖南省岳阳市岳阳楼区
				return ChinaCentralAreaCodeEnum.ITEM430602.getCode();
			}
			if (name.contains(ChinaCentralAreaCodeEnum.ITEM430621.getThirdDistrict())) {
				// 湖南省岳阳市岳阳县
				return ChinaCentralAreaCodeEnum.ITEM430621.getCode();
			}
		}
		return null;
	}
	
	private static String getName(ChinaCentralAreaCodeEnum e) {
		
		String name = e.getThirdDistrict();
		if (ValidatorUtil.isEmpty(name)) {
			
			name = e.getSecondDistrict();
		}
		if (ValidatorUtil.isEmpty(name)) {
			
			name = e.getFirstDistrict();
		}
		return ValidatorUtil.isEmpty(name) ? null : name;
	}
	
	private static Map<Object, Object> getResult(ChinaCentralAreaCodeEnum e) {
		
		String district = null;
		Map<Object, Object> map = new HashMap<Object, Object>();
		map.put("code", e.getCode());
		
		district = e.getFirstDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("firstDistrict", district);
		}
		district = e.getSecondDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("secondDistrict", district);
		}
		district = e.getThirdDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("thirdDistrict", district);
		}
		return map;
	}
}
