package cn.datawe.constant;

import java.util.HashMap;
import java.util.LinkedHashMap;
import java.util.Map;

import cn.datawe.util.ValidatorUtil;

/**
 * 枚举类:华南地区行政区划
 * <br>数据更新日期:2017-06-16
 * 
 * @author LiuJiaLe
 * 
 */
public enum ChinaSouthAreaCodeEnum {

	ITEM440000("440000", "广东省", "", ""),
	ITEM440100("440100", "广东省", "广州市", ""),
	ITEM440103("440103", "广东省", "广州市", "荔湾区"),
	ITEM440104("440104", "广东省", "广州市", "越秀区"),
	ITEM440105("440105", "广东省", "广州市", "海珠区"),
	ITEM440106("440106", "广东省", "广州市", "天河区"),
	ITEM440111("440111", "广东省", "广州市", "白云区"),
	ITEM440112("440112", "广东省", "广州市", "黄埔区"),
	ITEM440113("440113", "广东省", "广州市", "番禺区"),
	ITEM440114("440114", "广东省", "广州市", "花都区"),
	ITEM440115("440115", "广东省", "广州市", "南沙区"),
	ITEM440117("440117", "广东省", "广州市", "从化区"),
	ITEM440118("440118", "广东省", "广州市", "增城区"),
	ITEM440200("440200", "广东省", "韶关市", ""),
	ITEM440203("440203", "广东省", "韶关市", "武江区"),
	ITEM440204("440204", "广东省", "韶关市", "浈江区"),
	ITEM440205("440205", "广东省", "韶关市", "曲江区"),
	ITEM440222("440222", "广东省", "韶关市", "始兴县"),
	ITEM440224("440224", "广东省", "韶关市", "仁化县"),
	ITEM440229("440229", "广东省", "韶关市", "翁源县"),
	ITEM440232("440232", "广东省", "韶关市", "乳源瑶族自治县"),
	ITEM440233("440233", "广东省", "韶关市", "新丰县"),
	ITEM440281("440281", "广东省", "韶关市", "乐昌市"),
	ITEM440282("440282", "广东省", "韶关市", "南雄市"),
	ITEM440300("440300", "广东省", "深圳市", ""),
	ITEM440303("440303", "广东省", "深圳市", "罗湖区"),
	ITEM440304("440304", "广东省", "深圳市", "福田区"),
	ITEM440305("440305", "广东省", "深圳市", "南山区"),
	ITEM440306("440306", "广东省", "深圳市", "宝安区"),
	ITEM440307("440307", "广东省", "深圳市", "龙岗区"),
	ITEM440308("440308", "广东省", "深圳市", "盐田区"),
	ITEM440309("440309", "广东省", "深圳市", "龙华区"),
	ITEM440310("440310", "广东省", "深圳市", "坪山区"),
	ITEM440400("440400", "广东省", "珠海市", ""),
	ITEM440402("440402", "广东省", "珠海市", "香洲区"),
	ITEM440403("440403", "广东省", "珠海市", "斗门区"),
	ITEM440404("440404", "广东省", "珠海市", "金湾区"),
	ITEM440500("440500", "广东省", "汕头市", ""),
	ITEM440507("440507", "广东省", "汕头市", "龙湖区"),
	ITEM440511("440511", "广东省", "汕头市", "金平区"),
	ITEM440512("440512", "广东省", "汕头市", "濠江区"),
	ITEM440513("440513", "广东省", "汕头市", "潮阳区"),
	ITEM440514("440514", "广东省", "汕头市", "潮南区"),
	ITEM440515("440515", "广东省", "汕头市", "澄海区"),
	ITEM440523("440523", "广东省", "汕头市", "南澳县"),
	ITEM440600("440600", "广东省", "佛山市", ""),
	ITEM440604("440604", "广东省", "佛山市", "禅城区"),
	ITEM440605("440605", "广东省", "佛山市", "南海区"),
	ITEM440606("440606", "广东省", "佛山市", "顺德区"),
	ITEM440607("440607", "广东省", "佛山市", "三水区"),
	ITEM440608("440608", "广东省", "佛山市", "高明区"),
	ITEM440700("440700", "广东省", "江门市", ""),
	ITEM440703("440703", "广东省", "江门市", "蓬江区"),
	ITEM440704("440704", "广东省", "江门市", "江海区"),
	ITEM440705("440705", "广东省", "江门市", "新会区"),
	ITEM440781("440781", "广东省", "江门市", "台山市"),
	ITEM440783("440783", "广东省", "江门市", "开平市"),
	ITEM440784("440784", "广东省", "江门市", "鹤山市"),
	ITEM440785("440785", "广东省", "江门市", "恩平市"),
	ITEM440800("440800", "广东省", "湛江市", ""),
	ITEM440802("440802", "广东省", "湛江市", "赤坎区"),
	ITEM440803("440803", "广东省", "湛江市", "霞山区"),
	ITEM440804("440804", "广东省", "湛江市", "坡头区"),
	ITEM440811("440811", "广东省", "湛江市", "麻章区"),
	ITEM440823("440823", "广东省", "湛江市", "遂溪县"),
	ITEM440825("440825", "广东省", "湛江市", "徐闻县"),
	ITEM440881("440881", "广东省", "湛江市", "廉江市"),
	ITEM440882("440882", "广东省", "湛江市", "雷州市"),
	ITEM440883("440883", "广东省", "湛江市", "吴川市"),
	ITEM440900("440900", "广东省", "茂名市", ""),
	ITEM440902("440902", "广东省", "茂名市", "茂南区"),
	ITEM440904("440904", "广东省", "茂名市", "电白区"),
	ITEM440981("440981", "广东省", "茂名市", "高州市"),
	ITEM440982("440982", "广东省", "茂名市", "化州市"),
	ITEM440983("440983", "广东省", "茂名市", "信宜市"),
	ITEM441200("441200", "广东省", "肇庆市", ""),
	ITEM441202("441202", "广东省", "肇庆市", "端州区"),
	ITEM441203("441203", "广东省", "肇庆市", "鼎湖区"),
	ITEM441204("441204", "广东省", "肇庆市", "高要区"),
	ITEM441223("441223", "广东省", "肇庆市", "广宁县"),
	ITEM441224("441224", "广东省", "肇庆市", "怀集县"),
	ITEM441225("441225", "广东省", "肇庆市", "封开县"),
	ITEM441226("441226", "广东省", "肇庆市", "德庆县"),
	ITEM441284("441284", "广东省", "肇庆市", "四会市"),
	ITEM441300("441300", "广东省", "惠州市", ""),
	ITEM441302("441302", "广东省", "惠州市", "惠城区"),
	ITEM441303("441303", "广东省", "惠州市", "惠阳区"),
	ITEM441322("441322", "广东省", "惠州市", "博罗县"),
	ITEM441323("441323", "广东省", "惠州市", "惠东县"),
	ITEM441324("441324", "广东省", "惠州市", "龙门县"),
	ITEM441400("441400", "广东省", "梅州市", ""),
	ITEM441402("441402", "广东省", "梅州市", "梅江区"),
	ITEM441403("441403", "广东省", "梅州市", "梅县区"),
	ITEM441422("441422", "广东省", "梅州市", "大埔县"),
	ITEM441423("441423", "广东省", "梅州市", "丰顺县"),
	ITEM441424("441424", "广东省", "梅州市", "五华县"),
	ITEM441426("441426", "广东省", "梅州市", "平远县"),
	ITEM441427("441427", "广东省", "梅州市", "蕉岭县"),
	ITEM441481("441481", "广东省", "梅州市", "兴宁市"),
	ITEM441500("441500", "广东省", "汕尾市", ""),
	ITEM441502("441502", "广东省", "汕尾市", "城区"),
	ITEM441521("441521", "广东省", "汕尾市", "海丰县"),
	ITEM441523("441523", "广东省", "汕尾市", "陆河县"),
	ITEM441581("441581", "广东省", "汕尾市", "陆丰市"),
	ITEM441600("441600", "广东省", "河源市", ""),
	ITEM441602("441602", "广东省", "河源市", "源城区"),
	ITEM441621("441621", "广东省", "河源市", "紫金县"),
	ITEM441622("441622", "广东省", "河源市", "龙川县"),
	ITEM441623("441623", "广东省", "河源市", "连平县"),
	ITEM441624("441624", "广东省", "河源市", "和平县"),
	ITEM441625("441625", "广东省", "河源市", "东源县"),
	ITEM441700("441700", "广东省", "阳江市", ""),
	ITEM441702("441702", "广东省", "阳江市", "江城区"),
	ITEM441704("441704", "广东省", "阳江市", "阳东区"),
	ITEM441721("441721", "广东省", "阳江市", "阳西县"),
	ITEM441781("441781", "广东省", "阳江市", "阳春市"),
	ITEM441800("441800", "广东省", "清远市", ""),
	ITEM441802("441802", "广东省", "清远市", "清城区"),
	ITEM441803("441803", "广东省", "清远市", "清新区"),
	ITEM441821("441821", "广东省", "清远市", "佛冈县"),
	ITEM441823("441823", "广东省", "清远市", "阳山县"),
	ITEM441825("441825", "广东省", "清远市", "连山壮族瑶族自治县"),
	ITEM441826("441826", "广东省", "清远市", "连南瑶族自治县"),
	ITEM441881("441881", "广东省", "清远市", "英德市"),
	ITEM441882("441882", "广东省", "清远市", "连州市"),
	ITEM441900("441900", "广东省", "东莞市", ""),
	ITEM442000("442000", "广东省", "中山市", ""),
	ITEM445100("445100", "广东省", "潮州市", ""),
	ITEM445102("445102", "广东省", "潮州市", "湘桥区"),
	ITEM445103("445103", "广东省", "潮州市", "潮安区"),
	ITEM445122("445122", "广东省", "潮州市", "饶平县"),
	ITEM445200("445200", "广东省", "揭阳市", ""),
	ITEM445202("445202", "广东省", "揭阳市", "榕城区"),
	ITEM445203("445203", "广东省", "揭阳市", "揭东区"),
	ITEM445222("445222", "广东省", "揭阳市", "揭西县"),
	ITEM445224("445224", "广东省", "揭阳市", "惠来县"),
	ITEM445281("445281", "广东省", "揭阳市", "普宁市"),
	ITEM445300("445300", "广东省", "云浮市", ""),
	ITEM445302("445302", "广东省", "云浮市", "云城区"),
	ITEM445303("445303", "广东省", "云浮市", "云安区"),
	ITEM445321("445321", "广东省", "云浮市", "新兴县"),
	ITEM445322("445322", "广东省", "云浮市", "郁南县"),
	ITEM445381("445381", "广东省", "云浮市", "罗定市"),
	
	ITEM450000("450000", "广西壮族自治区", "", ""),
	ITEM450100("450100", "广西壮族自治区", "南宁市", ""),
	ITEM450102("450102", "广西壮族自治区", "南宁市", "兴宁区"),
	ITEM450103("450103", "广西壮族自治区", "南宁市", "青秀区"),
	ITEM450105("450105", "广西壮族自治区", "南宁市", "江南区"),
	ITEM450107("450107", "广西壮族自治区", "南宁市", "西乡塘区"),
	ITEM450108("450108", "广西壮族自治区", "南宁市", "良庆区"),
	ITEM450109("450109", "广西壮族自治区", "南宁市", "邕宁区"),
	ITEM450110("450110", "广西壮族自治区", "南宁市", "武鸣区"),
	ITEM450123("450123", "广西壮族自治区", "南宁市", "隆安县"),
	ITEM450124("450124", "广西壮族自治区", "南宁市", "马山县"),
	ITEM450125("450125", "广西壮族自治区", "南宁市", "上林县"),
	ITEM450126("450126", "广西壮族自治区", "南宁市", "宾阳县"),
	ITEM450127("450127", "广西壮族自治区", "南宁市", "横县"),
	ITEM450200("450200", "广西壮族自治区", "柳州市", ""),
	ITEM450202("450202", "广西壮族自治区", "柳州市", "城中区"),
	ITEM450203("450203", "广西壮族自治区", "柳州市", "鱼峰区"),
	ITEM450204("450204", "广西壮族自治区", "柳州市", "柳南区"),
	ITEM450205("450205", "广西壮族自治区", "柳州市", "柳北区"),
	ITEM450206("450206", "广西壮族自治区", "柳州市", "柳江区"),
	ITEM450222("450222", "广西壮族自治区", "柳州市", "柳城县"),
	ITEM450223("450223", "广西壮族自治区", "柳州市", "鹿寨县"),
	ITEM450224("450224", "广西壮族自治区", "柳州市", "融安县"),
	ITEM450225("450225", "广西壮族自治区", "柳州市", "融水苗族自治县"),
	ITEM450226("450226", "广西壮族自治区", "柳州市", "三江侗族自治县"),
	ITEM450300("450300", "广西壮族自治区", "桂林市", ""),
	ITEM450302("450302", "广西壮族自治区", "桂林市", "秀峰区"),
	ITEM450303("450303", "广西壮族自治区", "桂林市", "叠彩区"),
	ITEM450304("450304", "广西壮族自治区", "桂林市", "象山区"),
	ITEM450305("450305", "广西壮族自治区", "桂林市", "七星区"),
	ITEM450311("450311", "广西壮族自治区", "桂林市", "雁山区"),
	ITEM450312("450312", "广西壮族自治区", "桂林市", "临桂区"),
	ITEM450321("450321", "广西壮族自治区", "桂林市", "阳朔县"),
	ITEM450323("450323", "广西壮族自治区", "桂林市", "灵川县"),
	ITEM450324("450324", "广西壮族自治区", "桂林市", "全州县"),
	ITEM450325("450325", "广西壮族自治区", "桂林市", "兴安县"),
	ITEM450326("450326", "广西壮族自治区", "桂林市", "永福县"),
	ITEM450327("450327", "广西壮族自治区", "桂林市", "灌阳县"),
	ITEM450328("450328", "广西壮族自治区", "桂林市", "龙胜各族自治县"),
	ITEM450329("450329", "广西壮族自治区", "桂林市", "资源县"),
	ITEM450330("450330", "广西壮族自治区", "桂林市", "平乐县"),
	ITEM450331("450331", "广西壮族自治区", "桂林市", "荔浦县"),
	ITEM450332("450332", "广西壮族自治区", "桂林市", "恭城瑶族自治县"),
	ITEM450400("450400", "广西壮族自治区", "梧州市", ""),
	ITEM450403("450403", "广西壮族自治区", "梧州市", "万秀区"),
	ITEM450405("450405", "广西壮族自治区", "梧州市", "长洲区"),
	ITEM450406("450406", "广西壮族自治区", "梧州市", "龙圩区"),
	ITEM450421("450421", "广西壮族自治区", "梧州市", "苍梧县"),
	ITEM450422("450422", "广西壮族自治区", "梧州市", "藤县"),
	ITEM450423("450423", "广西壮族自治区", "梧州市", "蒙山县"),
	ITEM450481("450481", "广西壮族自治区", "梧州市", "岑溪市"),
	ITEM450500("450500", "广西壮族自治区", "北海市", ""),
	ITEM450502("450502", "广西壮族自治区", "北海市", "海城区"),
	ITEM450503("450503", "广西壮族自治区", "北海市", "银海区"),
	ITEM450512("450512", "广西壮族自治区", "北海市", "铁山港区"),
	ITEM450521("450521", "广西壮族自治区", "北海市", "合浦县"),
	ITEM450600("450600", "广西壮族自治区", "防城港市", ""),
	ITEM450602("450602", "广西壮族自治区", "防城港市", "港口区"),
	ITEM450603("450603", "广西壮族自治区", "防城港市", "防城区"),
	ITEM450621("450621", "广西壮族自治区", "防城港市", "上思县"),
	ITEM450681("450681", "广西壮族自治区", "防城港市", "东兴市"),
	ITEM450700("450700", "广西壮族自治区", "钦州市", ""),
	ITEM450702("450702", "广西壮族自治区", "钦州市", "钦南区"),
	ITEM450703("450703", "广西壮族自治区", "钦州市", "钦北区"),
	ITEM450721("450721", "广西壮族自治区", "钦州市", "灵山县"),
	ITEM450722("450722", "广西壮族自治区", "钦州市", "浦北县"),
	ITEM450800("450800", "广西壮族自治区", "贵港市", ""),
	ITEM450802("450802", "广西壮族自治区", "贵港市", "港北区"),
	ITEM450803("450803", "广西壮族自治区", "贵港市", "港南区"),
	ITEM450804("450804", "广西壮族自治区", "贵港市", "覃塘区"),
	ITEM450821("450821", "广西壮族自治区", "贵港市", "平南县"),
	ITEM450881("450881", "广西壮族自治区", "贵港市", "桂平市"),
	ITEM450900("450900", "广西壮族自治区", "玉林市", ""),
	ITEM450902("450902", "广西壮族自治区", "玉林市", "玉州区"),
	ITEM450903("450903", "广西壮族自治区", "玉林市", "福绵区"),
	ITEM450921("450921", "广西壮族自治区", "玉林市", "容县"),
	ITEM450922("450922", "广西壮族自治区", "玉林市", "陆川县"),
	ITEM450923("450923", "广西壮族自治区", "玉林市", "博白县"),
	ITEM450924("450924", "广西壮族自治区", "玉林市", "兴业县"),
	ITEM450981("450981", "广西壮族自治区", "玉林市", "北流市"),
	ITEM451000("451000", "广西壮族自治区", "百色市", ""),
	ITEM451002("451002", "广西壮族自治区", "百色市", "右江区"),
	ITEM451021("451021", "广西壮族自治区", "百色市", "田阳县"),
	ITEM451022("451022", "广西壮族自治区", "百色市", "田东县"),
	ITEM451023("451023", "广西壮族自治区", "百色市", "平果县"),
	ITEM451024("451024", "广西壮族自治区", "百色市", "德保县"),
	ITEM451026("451026", "广西壮族自治区", "百色市", "那坡县"),
	ITEM451027("451027", "广西壮族自治区", "百色市", "凌云县"),
	ITEM451028("451028", "广西壮族自治区", "百色市", "乐业县"),
	ITEM451029("451029", "广西壮族自治区", "百色市", "田林县"),
	ITEM451030("451030", "广西壮族自治区", "百色市", "西林县"),
	ITEM451031("451031", "广西壮族自治区", "百色市", "隆林各族自治县"),
	ITEM451081("451081", "广西壮族自治区", "百色市", "靖西市"),
	ITEM451100("451100", "广西壮族自治区", "贺州市", ""),
	ITEM451102("451102", "广西壮族自治区", "贺州市", "八步区"),
	ITEM451103("451103", "广西壮族自治区", "贺州市", "平桂区"),
	ITEM451121("451121", "广西壮族自治区", "贺州市", "昭平县"),
	ITEM451122("451122", "广西壮族自治区", "贺州市", "钟山县"),
	ITEM451123("451123", "广西壮族自治区", "贺州市", "富川瑶族自治县"),
	ITEM451200("451200", "广西壮族自治区", "河池市", ""),
	ITEM451202("451202", "广西壮族自治区", "河池市", "金城江区"),
	ITEM451203("451203", "广西壮族自治区", "河池市", "宜州区"),
	ITEM451221("451221", "广西壮族自治区", "河池市", "南丹县"),
	ITEM451222("451222", "广西壮族自治区", "河池市", "天峨县"),
	ITEM451223("451223", "广西壮族自治区", "河池市", "凤山县"),
	ITEM451224("451224", "广西壮族自治区", "河池市", "东兰县"),
	ITEM451225("451225", "广西壮族自治区", "河池市", "罗城仫佬族自治县"),
	ITEM451226("451226", "广西壮族自治区", "河池市", "环江毛南族自治县"),
	ITEM451227("451227", "广西壮族自治区", "河池市", "巴马瑶族自治县"),
	ITEM451228("451228", "广西壮族自治区", "河池市", "都安瑶族自治县"),
	ITEM451229("451229", "广西壮族自治区", "河池市", "大化瑶族自治县"),
	ITEM451281("451281", "广西壮族自治区", "河池市", "宜州市"),
	ITEM451300("451300", "广西壮族自治区", "来宾市", ""),
	ITEM451302("451302", "广西壮族自治区", "来宾市", "兴宾区"),
	ITEM451321("451321", "广西壮族自治区", "来宾市", "忻城县"),
	ITEM451322("451322", "广西壮族自治区", "来宾市", "象州县"),
	ITEM451323("451323", "广西壮族自治区", "来宾市", "武宣县"),
	ITEM451324("451324", "广西壮族自治区", "来宾市", "金秀瑶族自治县"),
	ITEM451381("451381", "广西壮族自治区", "来宾市", "合山市"),
	ITEM451400("451400", "广西壮族自治区", "崇左市", ""),
	ITEM451402("451402", "广西壮族自治区", "崇左市", "江州区"),
	ITEM451421("451421", "广西壮族自治区", "崇左市", "扶绥县"),
	ITEM451422("451422", "广西壮族自治区", "崇左市", "宁明县"),
	ITEM451423("451423", "广西壮族自治区", "崇左市", "龙州县"),
	ITEM451424("451424", "广西壮族自治区", "崇左市", "大新县"),
	ITEM451425("451425", "广西壮族自治区", "崇左市", "天等县"),
	ITEM451481("451481", "广西壮族自治区", "崇左市", "凭祥市"),
	
	ITEM460000("460000", "海南省", "", ""),
	ITEM460100("460100", "海南省", "海口市", ""),
	ITEM460105("460105", "海南省", "海口市", "秀英区"),
	ITEM460106("460106", "海南省", "海口市", "龙华区"),
	ITEM460107("460107", "海南省", "海口市", "琼山区"),
	ITEM460108("460108", "海南省", "海口市", "美兰区"),
	ITEM460200("460200", "海南省", "三亚市", ""),
	ITEM460202("460202", "海南省", "三亚市", "海棠区"),
	ITEM460203("460203", "海南省", "三亚市", "吉阳区"),
	ITEM460204("460204", "海南省", "三亚市", "天涯区"),
	ITEM460205("460205", "海南省", "三亚市", "崖州区"),
	ITEM460300("460300", "海南省", "三沙市", ""),
	ITEM460400("460400", "海南省", "儋州市", ""),
	ITEM469001("469001", "海南省", "五指山市", ""),
	ITEM469002("469002", "海南省", "琼海市", ""),
	ITEM469005("469005", "海南省", "文昌市", ""),
	ITEM469006("469006", "海南省", "万宁市", ""),
	ITEM469007("469007", "海南省", "东方市", ""),
	ITEM469021("469021", "海南省", "定安县", ""),
	ITEM469022("469022", "海南省", "屯昌县", ""),
	ITEM469023("469023", "海南省", "澄迈县", ""),
	ITEM469024("469024", "海南省", "临高县", ""),
	ITEM469025("469025", "海南省", "白沙黎族自治县", ""),
	ITEM469026("469026", "海南省", "昌江黎族自治县", ""),
	ITEM469027("469027", "海南省", "乐东黎族自治县", ""),
	ITEM469028("469028", "海南省", "陵水黎族自治县", ""),
	ITEM469029("469029", "海南省", "保亭黎族苗族自治县", ""),
	ITEM469030("469030", "海南省", "琼中黎族苗族自治县", ""),
	;

	private String code;
	private String firstDistrict;
	private String secondDistrict;
	private String thirdDistrict;

	private ChinaSouthAreaCodeEnum(String code, String firstDistrict, String secondDistrict, String thirdDistrict) {
		this.code = code;
		this.firstDistrict = firstDistrict;
		this.secondDistrict = secondDistrict;
		this.thirdDistrict = thirdDistrict;
	}

	public String getCode() {
		return code;
	}

	public String getFirstDistrict() {
		return firstDistrict;
	}

	public String getSecondDistrict() {
		return secondDistrict;
	}
	
	public String getThirdDistrict() {
		return thirdDistrict;
	}
	
	public String getFullName() {
		
		return firstDistrict.concat(secondDistrict).concat(thirdDistrict);
	}
	
	public static Map<Object, Object> getResult(String code) {

		if (ValidatorUtil.isAreaCode(code)) {

			for (ChinaSouthAreaCodeEnum e : ChinaSouthAreaCodeEnum.values()) {

				if (code.equals(e.getCode())) {

					return getResult(e);
				}
			}
		}
		return null;
	}
	
	public static String getCode(String name) {
		
		if (ValidatorUtil.isNotEmptyIgnoreBlank(name)) {
			
			String fullName = null;
			for (ChinaSouthAreaCodeEnum e : ChinaSouthAreaCodeEnum.values()) {
				
				fullName = e.getFirstDistrict().concat(e.getSecondDistrict()).concat(e.getThirdDistrict());
				if (fullName.equals(name)) {
					
					return e.getCode();
				}
			}
		}
		return null;
	}
	
	public static String getName(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaSouthAreaCodeEnum e : ChinaSouthAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return getName(e);
				}
			}
		}
		return null;
	}
	
	public static String getFullName(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaSouthAreaCodeEnum e : ChinaSouthAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return e.getFirstDistrict().concat(e.getSecondDistrict()).concat(e.getThirdDistrict());
				}
			}
		}
		return null;
	}
	
	public static String matchCode(String name) {
		
		final String REGEX = "壮族自治区|壮族瑶族自治县|黎族苗族自治县|瑶族自治县|苗族自治县|侗族自治县|各族自治县|仫佬族自治县|毛南族自治县|黎族自治县|省|市|区|县";
		String code = null;
		String str1 = null;
		String str2 = null;
		String str3 = null;
		Map<String, String> map1 = new HashMap<String, String>();
		Map<String, String> map2 = new LinkedHashMap<String, String>();
		Map<String, String> map3 = new HashMap<String, String>();
		if (ValidatorUtil.isNotEmptyIgnoreBlank(name)) {
			
			code = matchSpecial(name);
			if (null == code) {
				
				for (ChinaSouthAreaCodeEnum e : ChinaSouthAreaCodeEnum.values()) {
					
					str1 = e.getFirstDistrict();
					str2 = e.getSecondDistrict();
					str3 = e.getThirdDistrict();
					if (ValidatorUtil.isNotEmpty(str3)) {
						
						map3.put(e.getCode(), (str1.concat(str2).concat(str3)).replaceAll(REGEX, ""));
						map2.put(e.getCode(), (str1.concat(str3)).replaceAll(REGEX, ""));
					}
					if (ValidatorUtil.isEmpty(str3) && ValidatorUtil.isNotEmpty(str2)) {
						
						map2.put(e.getCode(), (str1.concat(str2)).replaceAll(REGEX, ""));
					}
					if (ValidatorUtil.isAllEmpty(str2, str3)) {
						
						map1.put(e.getCode(), str1.replaceAll(REGEX, ""));
					}
				}
				
				name = name.replaceAll(REGEX, "");
				code = getCode(name, map1, map2, map3);
				if (null == code) {
					
					name = name.replaceAll("(?s)(.)(?=.*\\1)", "");
					code = getCode(name, map1, map2, map3);
				}
			}
		}
		return code;
	}
	
	private static String getCode(String name, Map<String, String> map1, Map<String, String> map2, Map<String, String> map3) {
		
		String code = matchCode(name, map3);
		if (null == code) {
			
			code = matchCode(name, map2);
		}
		if (null == code) {
			
			code = matchCode(name, map1);
		}
		return code;
	}
	
	private static String matchCode(String name, Map<String, String> map) {
		
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.equals(entry.getValue())) {
				
				return entry.getKey();
			}
		}
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.startsWith(entry.getValue())) {
				
				return entry.getKey();
			}
		}
		return null;
	}
	
	private static String matchSpecial(String name) {
		// 暂未发现需要特殊处理的
		return null;
	}
	
	private static String getName(ChinaSouthAreaCodeEnum e) {
		
		String name = e.getThirdDistrict();
		if (ValidatorUtil.isEmptyIgnoreBlank(name)) {
			
			name = e.getSecondDistrict();
		}
		if (ValidatorUtil.isEmptyIgnoreBlank(name)) {
			
			name = e.getFirstDistrict();
		}
		return ValidatorUtil.isEmptyIgnoreBlank(name) ? null : name;
	}
	
	private static Map<Object, Object> getResult(ChinaSouthAreaCodeEnum e) {

		String district = null;
		Map<Object, Object> map = new HashMap<Object, Object>();
		map.put("code", e.getCode());
		
		district = e.getFirstDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("firstDistrict", district);
		}
		district = e.getSecondDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("secondDistrict", district);
		}
		district = e.getThirdDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("thirdDistrict", district);
		}
		return map;
	}
}
