package cn.datawe.constant;

import java.util.HashMap;
import java.util.LinkedHashMap;
import java.util.Map;

import cn.datawe.util.ValidatorUtil;

/**
 * 枚举类:西北地区行政区划
 * <br>数据更新日期:2016-08-24
 * 
 * @author LiuJiaLe
 * 
 */
public enum ChinaNorthwestAreaCodeEnum {

	ITEM610000("610000", "陕西省", "", ""),
	ITEM610100("610100", "陕西省", "西安市", ""),
	ITEM610102("610102", "陕西省", "西安市", "新城区"),
	ITEM610103("610103", "陕西省", "西安市", "碑林区"),
	ITEM610104("610104", "陕西省", "西安市", "莲湖区"),
	ITEM610111("610111", "陕西省", "西安市", "灞桥区"),
	ITEM610112("610112", "陕西省", "西安市", "未央区"),
	ITEM610113("610113", "陕西省", "西安市", "雁塔区"),
	ITEM610114("610114", "陕西省", "西安市", "阎良区"),
	ITEM610115("610115", "陕西省", "西安市", "临潼区"),
	ITEM610116("610116", "陕西省", "西安市", "长安区"),
	ITEM610117("610117", "陕西省", "西安市", "高陵区"),
	ITEM610122("610122", "陕西省", "西安市", "蓝田县"),
	ITEM610124("610124", "陕西省", "西安市", "周至县"),
	ITEM610125("610125", "陕西省", "西安市", "户县"),
	ITEM610200("610200", "陕西省", "铜川市", ""),
	ITEM610202("610202", "陕西省", "铜川市", "王益区"),
	ITEM610203("610203", "陕西省", "铜川市", "印台区"),
	ITEM610204("610204", "陕西省", "铜川市", "耀州区"),
	ITEM610222("610222", "陕西省", "铜川市", "宜君县"),
	ITEM610300("610300", "陕西省", "宝鸡市", ""),
	ITEM610302("610302", "陕西省", "宝鸡市", "渭滨区"),
	ITEM610303("610303", "陕西省", "宝鸡市", "金台区"),
	ITEM610304("610304", "陕西省", "宝鸡市", "陈仓区"),
	ITEM610322("610322", "陕西省", "宝鸡市", "凤翔县"),
	ITEM610323("610323", "陕西省", "宝鸡市", "岐山县"),
	ITEM610324("610324", "陕西省", "宝鸡市", "扶风县"),
	ITEM610326("610326", "陕西省", "宝鸡市", "眉县"),
	ITEM610327("610327", "陕西省", "宝鸡市", "陇县"),
	ITEM610328("610328", "陕西省", "宝鸡市", "千阳县"),
	ITEM610329("610329", "陕西省", "宝鸡市", "麟游县"),
	ITEM610330("610330", "陕西省", "宝鸡市", "凤县"),
	ITEM610331("610331", "陕西省", "宝鸡市", "太白县"),
	ITEM610400("610400", "陕西省", "咸阳市", ""),
	ITEM610402("610402", "陕西省", "咸阳市", "秦都区"),
	ITEM610403("610403", "陕西省", "咸阳市", "杨陵区"),
	ITEM610404("610404", "陕西省", "咸阳市", "渭城区"),
	ITEM610422("610422", "陕西省", "咸阳市", "三原县"),
	ITEM610423("610423", "陕西省", "咸阳市", "泾阳县"),
	ITEM610424("610424", "陕西省", "咸阳市", "乾县"),
	ITEM610425("610425", "陕西省", "咸阳市", "礼泉县"),
	ITEM610426("610426", "陕西省", "咸阳市", "永寿县"),
	ITEM610427("610427", "陕西省", "咸阳市", "彬县"),
	ITEM610428("610428", "陕西省", "咸阳市", "长武县"),
	ITEM610429("610429", "陕西省", "咸阳市", "旬邑县"),
	ITEM610430("610430", "陕西省", "咸阳市", "淳化县"),
	ITEM610431("610431", "陕西省", "咸阳市", "武功县"),
	ITEM610481("610481", "陕西省", "咸阳市", "兴平市"),
	ITEM610500("610500", "陕西省", "渭南市", ""),
	ITEM610502("610502", "陕西省", "渭南市", "临渭区"),
	ITEM610503("610503", "陕西省", "渭南市", "华州区"),
	ITEM610522("610522", "陕西省", "渭南市", "潼关县"),
	ITEM610523("610523", "陕西省", "渭南市", "大荔县"),
	ITEM610524("610524", "陕西省", "渭南市", "合阳县"),
	ITEM610525("610525", "陕西省", "渭南市", "澄城县"),
	ITEM610526("610526", "陕西省", "渭南市", "蒲城县"),
	ITEM610527("610527", "陕西省", "渭南市", "白水县"),
	ITEM610528("610528", "陕西省", "渭南市", "富平县"),
	ITEM610581("610581", "陕西省", "渭南市", "韩城市"),
	ITEM610582("610582", "陕西省", "渭南市", "华阴市"),
	ITEM610600("610600", "陕西省", "延安市", ""),
	ITEM610602("610602", "陕西省", "延安市", "宝塔区"),
	ITEM610621("610621", "陕西省", "延安市", "延长县"),
	ITEM610622("610622", "陕西省", "延安市", "延川县"),
	ITEM610623("610623", "陕西省", "延安市", "子长县"),
	ITEM610624("610624", "陕西省", "延安市", "安塞县"),
	ITEM610625("610625", "陕西省", "延安市", "志丹县"),
	ITEM610626("610626", "陕西省", "延安市", "吴起县"),
	ITEM610627("610627", "陕西省", "延安市", "甘泉县"),
	ITEM610628("610628", "陕西省", "延安市", "富县"),
	ITEM610629("610629", "陕西省", "延安市", "洛川县"),
	ITEM610630("610630", "陕西省", "延安市", "宜川县"),
	ITEM610631("610631", "陕西省", "延安市", "黄龙县"),
	ITEM610632("610632", "陕西省", "延安市", "黄陵县"),
	ITEM610700("610700", "陕西省", "汉中市", ""),
	ITEM610702("610702", "陕西省", "汉中市", "汉台区"),
	ITEM610721("610721", "陕西省", "汉中市", "南郑县"),
	ITEM610722("610722", "陕西省", "汉中市", "城固县"),
	ITEM610723("610723", "陕西省", "汉中市", "洋县"),
	ITEM610724("610724", "陕西省", "汉中市", "西乡县"),
	ITEM610725("610725", "陕西省", "汉中市", "勉县"),
	ITEM610726("610726", "陕西省", "汉中市", "宁强县"),
	ITEM610727("610727", "陕西省", "汉中市", "略阳县"),
	ITEM610728("610728", "陕西省", "汉中市", "镇巴县"),
	ITEM610729("610729", "陕西省", "汉中市", "留坝县"),
	ITEM610730("610730", "陕西省", "汉中市", "佛坪县"),
	ITEM610800("610800", "陕西省", "榆林市", ""),
	ITEM610802("610802", "陕西省", "榆林市", "榆阳区"),
	ITEM610803("610803", "陕西省", "榆林市", "横山区"),
	ITEM610821("610821", "陕西省", "榆林市", "神木县"),
	ITEM610822("610822", "陕西省", "榆林市", "府谷县"),
	ITEM610824("610824", "陕西省", "榆林市", "靖边县"),
	ITEM610825("610825", "陕西省", "榆林市", "定边县"),
	ITEM610826("610826", "陕西省", "榆林市", "绥德县"),
	ITEM610827("610827", "陕西省", "榆林市", "米脂县"),
	ITEM610828("610828", "陕西省", "榆林市", "佳县"),
	ITEM610829("610829", "陕西省", "榆林市", "吴堡县"),
	ITEM610830("610830", "陕西省", "榆林市", "清涧县"),
	ITEM610831("610831", "陕西省", "榆林市", "子洲县"),
	ITEM610900("610900", "陕西省", "安康市", ""),
	ITEM610902("610902", "陕西省", "安康市", "汉滨区"),
	ITEM610921("610921", "陕西省", "安康市", "汉阴县"),
	ITEM610922("610922", "陕西省", "安康市", "石泉县"),
	ITEM610923("610923", "陕西省", "安康市", "宁陕县"),
	ITEM610924("610924", "陕西省", "安康市", "紫阳县"),
	ITEM610925("610925", "陕西省", "安康市", "岚皋县"),
	ITEM610926("610926", "陕西省", "安康市", "平利县"),
	ITEM610927("610927", "陕西省", "安康市", "镇坪县"),
	ITEM610928("610928", "陕西省", "安康市", "旬阳县"),
	ITEM610929("610929", "陕西省", "安康市", "白河县"),
	ITEM611000("611000", "陕西省", "商洛市", ""),
	ITEM611002("611002", "陕西省", "商洛市", "商州区"),
	ITEM611021("611021", "陕西省", "商洛市", "洛南县"),
	ITEM611022("611022", "陕西省", "商洛市", "丹凤县"),
	ITEM611023("611023", "陕西省", "商洛市", "商南县"),
	ITEM611024("611024", "陕西省", "商洛市", "山阳县"),
	ITEM611025("611025", "陕西省", "商洛市", "镇安县"),
	ITEM611026("611026", "陕西省", "商洛市", "柞水县"),
	
	ITEM620000("620000", "甘肃省", "", ""),
	ITEM620100("620100", "甘肃省", "兰州市", ""),
	ITEM620102("620102", "甘肃省", "兰州市", "城关区"),
	ITEM620103("620103", "甘肃省", "兰州市", "七里河区"),
	ITEM620104("620104", "甘肃省", "兰州市", "西固区"),
	ITEM620105("620105", "甘肃省", "兰州市", "安宁区"),
	ITEM620111("620111", "甘肃省", "兰州市", "红古区"),
	ITEM620121("620121", "甘肃省", "兰州市", "永登县"),
	ITEM620122("620122", "甘肃省", "兰州市", "皋兰县"),
	ITEM620123("620123", "甘肃省", "兰州市", "榆中县"),
	ITEM620200("620200", "甘肃省", "嘉峪关市", ""),
	ITEM620300("620300", "甘肃省", "金昌市", ""),
	ITEM620302("620302", "甘肃省", "金昌市", "金川区"),
	ITEM620321("620321", "甘肃省", "金昌市", "永昌县"),
	ITEM620400("620400", "甘肃省", "白银市", ""),
	ITEM620402("620402", "甘肃省", "白银市", "白银区"),
	ITEM620403("620403", "甘肃省", "白银市", "平川区"),
	ITEM620421("620421", "甘肃省", "白银市", "靖远县"),
	ITEM620422("620422", "甘肃省", "白银市", "会宁县"),
	ITEM620423("620423", "甘肃省", "白银市", "景泰县"),
	ITEM620500("620500", "甘肃省", "天水市", ""),
	ITEM620502("620502", "甘肃省", "天水市", "秦州区"),
	ITEM620503("620503", "甘肃省", "天水市", "麦积区"),
	ITEM620521("620521", "甘肃省", "天水市", "清水县"),
	ITEM620522("620522", "甘肃省", "天水市", "秦安县"),
	ITEM620523("620523", "甘肃省", "天水市", "甘谷县"),
	ITEM620524("620524", "甘肃省", "天水市", "武山县"),
	ITEM620525("620525", "甘肃省", "天水市", "张家川回族自治县"),
	ITEM620600("620600", "甘肃省", "武威市", ""),
	ITEM620602("620602", "甘肃省", "武威市", "凉州区"),
	ITEM620621("620621", "甘肃省", "武威市", "民勤县"),
	ITEM620622("620622", "甘肃省", "武威市", "古浪县"),
	ITEM620623("620623", "甘肃省", "武威市", "天祝藏族自治县"),
	ITEM620700("620700", "甘肃省", "张掖市", ""),
	ITEM620702("620702", "甘肃省", "张掖市", "甘州区"),
	ITEM620721("620721", "甘肃省", "张掖市", "肃南裕固族自治县"),
	ITEM620722("620722", "甘肃省", "张掖市", "民乐县"),
	ITEM620723("620723", "甘肃省", "张掖市", "临泽县"),
	ITEM620724("620724", "甘肃省", "张掖市", "高台县"),
	ITEM620725("620725", "甘肃省", "张掖市", "山丹县"),
	ITEM620800("620800", "甘肃省", "平凉市", ""),
	ITEM620802("620802", "甘肃省", "平凉市", "崆峒区"),
	ITEM620821("620821", "甘肃省", "平凉市", "泾川县"),
	ITEM620822("620822", "甘肃省", "平凉市", "灵台县"),
	ITEM620823("620823", "甘肃省", "平凉市", "崇信县"),
	ITEM620824("620824", "甘肃省", "平凉市", "华亭县"),
	ITEM620825("620825", "甘肃省", "平凉市", "庄浪县"),
	ITEM620826("620826", "甘肃省", "平凉市", "静宁县"),
	ITEM620900("620900", "甘肃省", "酒泉市", ""),
	ITEM620902("620902", "甘肃省", "酒泉市", "肃州区"),
	ITEM620921("620921", "甘肃省", "酒泉市", "金塔县"),
	ITEM620922("620922", "甘肃省", "酒泉市", "瓜州县"),
	ITEM620923("620923", "甘肃省", "酒泉市", "肃北蒙古族自治县"),
	ITEM620924("620924", "甘肃省", "酒泉市", "阿克塞哈萨克族自治县"),
	ITEM620981("620981", "甘肃省", "酒泉市", "玉门市"),
	ITEM620982("620982", "甘肃省", "酒泉市", "敦煌市"),
	ITEM621000("621000", "甘肃省", "庆阳市", ""),
	ITEM621002("621002", "甘肃省", "庆阳市", "西峰区"),
	ITEM621021("621021", "甘肃省", "庆阳市", "庆城县"),
	ITEM621022("621022", "甘肃省", "庆阳市", "环县"),
	ITEM621023("621023", "甘肃省", "庆阳市", "华池县"),
	ITEM621024("621024", "甘肃省", "庆阳市", "合水县"),
	ITEM621025("621025", "甘肃省", "庆阳市", "正宁县"),
	ITEM621026("621026", "甘肃省", "庆阳市", "宁县"),
	ITEM621027("621027", "甘肃省", "庆阳市", "镇原县"),
	ITEM621100("621100", "甘肃省", "定西市", ""),
	ITEM621102("621102", "甘肃省", "定西市", "安定区"),
	ITEM621121("621121", "甘肃省", "定西市", "通渭县"),
	ITEM621122("621122", "甘肃省", "定西市", "陇西县"),
	ITEM621123("621123", "甘肃省", "定西市", "渭源县"),
	ITEM621124("621124", "甘肃省", "定西市", "临洮县"),
	ITEM621125("621125", "甘肃省", "定西市", "漳县"),
	ITEM621126("621126", "甘肃省", "定西市", "岷县"),
	ITEM621200("621200", "甘肃省", "陇南市", ""),
	ITEM621202("621202", "甘肃省", "陇南市", "武都区"),
	ITEM621221("621221", "甘肃省", "陇南市", "成县"),
	ITEM621222("621222", "甘肃省", "陇南市", "文县"),
	ITEM621223("621223", "甘肃省", "陇南市", "宕昌县"),
	ITEM621224("621224", "甘肃省", "陇南市", "康县"),
	ITEM621225("621225", "甘肃省", "陇南市", "西和县"),
	ITEM621226("621226", "甘肃省", "陇南市", "礼县"),
	ITEM621227("621227", "甘肃省", "陇南市", "徽县"),
	ITEM621228("621228", "甘肃省", "陇南市", "两当县"),
	ITEM622900("622900", "甘肃省", "临夏回族自治州", ""),
	ITEM622901("622901", "甘肃省", "临夏回族自治州", "临夏市"),
	ITEM622921("622921", "甘肃省", "临夏回族自治州", "临夏县"),
	ITEM622922("622922", "甘肃省", "临夏回族自治州", "康乐县"),
	ITEM622923("622923", "甘肃省", "临夏回族自治州", "永靖县"),
	ITEM622924("622924", "甘肃省", "临夏回族自治州", "广河县"),
	ITEM622925("622925", "甘肃省", "临夏回族自治州", "和政县"),
	ITEM622926("622926", "甘肃省", "临夏回族自治州", "东乡族自治县"),
	ITEM622927("622927", "甘肃省", "临夏回族自治州", "积石山保安族东乡族撒拉族自治县"),
	ITEM623000("623000", "甘肃省", "甘南藏族自治州", ""),
	ITEM623001("623001", "甘肃省", "甘南藏族自治州", "合作市"),
	ITEM623021("623021", "甘肃省", "甘南藏族自治州", "临潭县"),
	ITEM623022("623022", "甘肃省", "甘南藏族自治州", "卓尼县"),
	ITEM623023("623023", "甘肃省", "甘南藏族自治州", "舟曲县"),
	ITEM623024("623024", "甘肃省", "甘南藏族自治州", "迭部县"),
	ITEM623025("623025", "甘肃省", "甘南藏族自治州", "玛曲县"),
	ITEM623026("623026", "甘肃省", "甘南藏族自治州", "碌曲县"),
	ITEM623027("623027", "甘肃省", "甘南藏族自治州", "夏河县"),
	
	ITEM630000("630000", "青海省", "", ""),
	ITEM630100("630100", "青海省", "西宁市", ""),
	ITEM630102("630102", "青海省", "西宁市", "城东区"),
	ITEM630103("630103", "青海省", "西宁市", "城中区"),
	ITEM630104("630104", "青海省", "西宁市", "城西区"),
	ITEM630105("630105", "青海省", "西宁市", "城北区"),
	ITEM630121("630121", "青海省", "西宁市", "大通回族土族自治县"),
	ITEM630122("630122", "青海省", "西宁市", "湟中县"),
	ITEM630123("630123", "青海省", "西宁市", "湟源县"),
	ITEM630200("630200", "青海省", "海东市", ""),
	ITEM630202("630202", "青海省", "海东市", "乐都区"),
	ITEM630203("630203", "青海省", "海东市", "平安区"),
	ITEM630222("630222", "青海省", "海东市", "民和回族土族自治县"),
	ITEM630223("630223", "青海省", "海东市", "互助土族自治县"),
	ITEM630224("630224", "青海省", "海东市", "化隆回族自治县"),
	ITEM630225("630225", "青海省", "海东市", "循化撒拉族自治县"),
	ITEM632200("632200", "青海省", "海北藏族自治州", ""),
	ITEM632221("632221", "青海省", "海北藏族自治州", "门源回族自治县"),
	ITEM632222("632222", "青海省", "海北藏族自治州", "祁连县"),
	ITEM632223("632223", "青海省", "海北藏族自治州", "海晏县"),
	ITEM632224("632224", "青海省", "海北藏族自治州", "刚察县"),
	ITEM632300("632300", "青海省", "黄南藏族自治州", ""),
	ITEM632321("632321", "青海省", "黄南藏族自治州", "同仁县"),
	ITEM632322("632322", "青海省", "黄南藏族自治州", "尖扎县"),
	ITEM632323("632323", "青海省", "黄南藏族自治州", "泽库县"),
	ITEM632324("632324", "青海省", "黄南藏族自治州", "河南蒙古族自治县"),
	ITEM632500("632500", "青海省", "海南藏族自治州", ""),
	ITEM632521("632521", "青海省", "海南藏族自治州", "共和县"),
	ITEM632522("632522", "青海省", "海南藏族自治州", "同德县"),
	ITEM632523("632523", "青海省", "海南藏族自治州", "贵德县"),
	ITEM632524("632524", "青海省", "海南藏族自治州", "兴海县"),
	ITEM632525("632525", "青海省", "海南藏族自治州", "贵南县"),
	ITEM632600("632600", "青海省", "果洛藏族自治州", ""),
	ITEM632621("632621", "青海省", "果洛藏族自治州", "玛沁县"),
	ITEM632622("632622", "青海省", "果洛藏族自治州", "班玛县"),
	ITEM632623("632623", "青海省", "果洛藏族自治州", "甘德县"),
	ITEM632624("632624", "青海省", "果洛藏族自治州", "达日县"),
	ITEM632625("632625", "青海省", "果洛藏族自治州", "久治县"),
	ITEM632626("632626", "青海省", "果洛藏族自治州", "玛多县"),
	ITEM632700("632700", "青海省", "玉树藏族自治州", ""),
	ITEM632701("632701", "青海省", "玉树藏族自治州", "玉树市"),
	ITEM632722("632722", "青海省", "玉树藏族自治州", "杂多县"),
	ITEM632723("632723", "青海省", "玉树藏族自治州", "称多县"),
	ITEM632724("632724", "青海省", "玉树藏族自治州", "治多县"),
	ITEM632725("632725", "青海省", "玉树藏族自治州", "囊谦县"),
	ITEM632726("632726", "青海省", "玉树藏族自治州", "曲麻莱县"),
	ITEM632800("632800", "青海省", "海西蒙古族藏族自治州", ""),
	ITEM632801("632801", "青海省", "海西蒙古族藏族自治州", "格尔木市"),
	ITEM632802("632802", "青海省", "海西蒙古族藏族自治州", "德令哈市"),
	ITEM632821("632821", "青海省", "海西蒙古族藏族自治州", "乌兰县"),
	ITEM632822("632822", "青海省", "海西蒙古族藏族自治州", "都兰县"),
	ITEM632823("632823", "青海省", "海西蒙古族藏族自治州", "天峻县"),
	
	ITEM640000("640000", "宁夏回族自治区", "", ""),
	ITEM640100("640100", "宁夏回族自治区", "银川市", ""),
	ITEM640104("640104", "宁夏回族自治区", "银川市", "兴庆区"),
	ITEM640105("640105", "宁夏回族自治区", "银川市", "西夏区"),
	ITEM640106("640106", "宁夏回族自治区", "银川市", "金凤区"),
	ITEM640121("640121", "宁夏回族自治区", "银川市", "永宁县"),
	ITEM640122("640122", "宁夏回族自治区", "银川市", "贺兰县"),
	ITEM640181("640181", "宁夏回族自治区", "银川市", "灵武市"),
	ITEM640200("640200", "宁夏回族自治区", "石嘴山市", ""),
	ITEM640202("640202", "宁夏回族自治区", "石嘴山市", "大武口区"),
	ITEM640205("640205", "宁夏回族自治区", "石嘴山市", "惠农区"),
	ITEM640221("640221", "宁夏回族自治区", "石嘴山市", "平罗县"),
	ITEM640300("640300", "宁夏回族自治区", "吴忠市", ""),
	ITEM640302("640302", "宁夏回族自治区", "吴忠市", "利通区"),
	ITEM640303("640303", "宁夏回族自治区", "吴忠市", "红寺堡区"),
	ITEM640323("640323", "宁夏回族自治区", "吴忠市", "盐池县"),
	ITEM640324("640324", "宁夏回族自治区", "吴忠市", "同心县"),
	ITEM640381("640381", "宁夏回族自治区", "吴忠市", "青铜峡市"),
	ITEM640400("640400", "宁夏回族自治区", "固原市", ""),
	ITEM640402("640402", "宁夏回族自治区", "固原市", "原州区"),
	ITEM640422("640422", "宁夏回族自治区", "固原市", "西吉县"),
	ITEM640423("640423", "宁夏回族自治区", "固原市", "隆德县"),
	ITEM640424("640424", "宁夏回族自治区", "固原市", "泾源县"),
	ITEM640425("640425", "宁夏回族自治区", "固原市", "彭阳县"),
	ITEM640500("640500", "宁夏回族自治区", "中卫市", ""),
	ITEM640502("640502", "宁夏回族自治区", "中卫市", "沙坡头区"),
	ITEM640521("640521", "宁夏回族自治区", "中卫市", "中宁县"),
	ITEM640522("640522", "宁夏回族自治区", "中卫市", "海原县"),
	
	ITEM650000("650000", "新疆维吾尔自治区", "", ""),
	ITEM650100("650100", "新疆维吾尔自治区", "乌鲁木齐市", ""),
	ITEM650102("650102", "新疆维吾尔自治区", "乌鲁木齐市", "天山区"),
	ITEM650103("650103", "新疆维吾尔自治区", "乌鲁木齐市", "沙依巴克区"),
	ITEM650104("650104", "新疆维吾尔自治区", "乌鲁木齐市", "新市区"),
	ITEM650105("650105", "新疆维吾尔自治区", "乌鲁木齐市", "水磨沟区"),
	ITEM650106("650106", "新疆维吾尔自治区", "乌鲁木齐市", "头屯河区"),
	ITEM650107("650107", "新疆维吾尔自治区", "乌鲁木齐市", "达坂城区"),
	ITEM650109("650109", "新疆维吾尔自治区", "乌鲁木齐市", "米东区"),
	ITEM650121("650121", "新疆维吾尔自治区", "乌鲁木齐市", "乌鲁木齐县"),
	ITEM650200("650200", "新疆维吾尔自治区", "克拉玛依市", ""),
	ITEM650202("650202", "新疆维吾尔自治区", "克拉玛依市", "独山子区"),
	ITEM650203("650203", "新疆维吾尔自治区", "克拉玛依市", "克拉玛依区"),
	ITEM650204("650204", "新疆维吾尔自治区", "克拉玛依市", "白碱滩区"),
	ITEM650205("650205", "新疆维吾尔自治区", "克拉玛依市", "乌尔禾区"),
	ITEM650400("650400", "新疆维吾尔自治区", "吐鲁番市", ""),
	ITEM650402("650402", "新疆维吾尔自治区", "吐鲁番市", "高昌区"),
	ITEM650421("650421", "新疆维吾尔自治区", "吐鲁番市", "鄯善县"),
	ITEM650422("650422", "新疆维吾尔自治区", "吐鲁番市", "托克逊县"),
	ITEM650500("650500", "新疆维吾尔自治区", "哈密市", ""),// 652200->650500, 哈密地区->哈密市
	ITEM650502("650502", "新疆维吾尔自治区", "哈密市", "伊州区"),
	ITEM650521("650521", "新疆维吾尔自治区", "哈密市", "巴里坤哈萨克自治县"),// 652222->650521, 哈密地区->哈密市
	ITEM650522("650522", "新疆维吾尔自治区", "哈密市", "伊吾县"),// 652223->650522, 哈密地区->哈密市
	ITEM652300("652300", "新疆维吾尔自治区", "昌吉回族自治州", ""),
	ITEM652301("652301", "新疆维吾尔自治区", "昌吉回族自治州", "昌吉市"),
	ITEM652302("652302", "新疆维吾尔自治区", "昌吉回族自治州", "阜康市"),
	ITEM652323("652323", "新疆维吾尔自治区", "昌吉回族自治州", "呼图壁县"),
	ITEM652324("652324", "新疆维吾尔自治区", "昌吉回族自治州", "玛纳斯县"),
	ITEM652325("652325", "新疆维吾尔自治区", "昌吉回族自治州", "奇台县"),
	ITEM652327("652327", "新疆维吾尔自治区", "昌吉回族自治州", "吉木萨尔县"),
	ITEM652328("652328", "新疆维吾尔自治区", "昌吉回族自治州", "木垒哈萨克自治县"),
	ITEM652700("652700", "新疆维吾尔自治区", "博尔塔拉蒙古自治州", ""),
	ITEM652701("652701", "新疆维吾尔自治区", "博尔塔拉蒙古自治州", "博乐市"),
	ITEM652702("652702", "新疆维吾尔自治区", "博尔塔拉蒙古自治州", "阿拉山口市"),
	ITEM652722("652722", "新疆维吾尔自治区", "博尔塔拉蒙古自治州", "精河县"),
	ITEM652723("652723", "新疆维吾尔自治区", "博尔塔拉蒙古自治州", "温泉县"),
	ITEM652800("652800", "新疆维吾尔自治区", "巴音郭楞蒙古自治州", ""),
	ITEM652801("652801", "新疆维吾尔自治区", "巴音郭楞蒙古自治州", "库尔勒市"),
	ITEM652822("652822", "新疆维吾尔自治区", "巴音郭楞蒙古自治州", "轮台县"),
	ITEM652823("652823", "新疆维吾尔自治区", "巴音郭楞蒙古自治州", "尉犁县"),
	ITEM652824("652824", "新疆维吾尔自治区", "巴音郭楞蒙古自治州", "若羌县"),
	ITEM652825("652825", "新疆维吾尔自治区", "巴音郭楞蒙古自治州", "且末县"),
	ITEM652826("652826", "新疆维吾尔自治区", "巴音郭楞蒙古自治州", "焉耆回族自治县"),
	ITEM652827("652827", "新疆维吾尔自治区", "巴音郭楞蒙古自治州", "和静县"),
	ITEM652828("652828", "新疆维吾尔自治区", "巴音郭楞蒙古自治州", "和硕县"),
	ITEM652829("652829", "新疆维吾尔自治区", "巴音郭楞蒙古自治州", "博湖县"),
	ITEM652900("652900", "新疆维吾尔自治区", "阿克苏地区", ""),
	ITEM652901("652901", "新疆维吾尔自治区", "阿克苏地区", "阿克苏市"),
	ITEM652922("652922", "新疆维吾尔自治区", "阿克苏地区", "温宿县"),
	ITEM652923("652923", "新疆维吾尔自治区", "阿克苏地区", "库车县"),
	ITEM652924("652924", "新疆维吾尔自治区", "阿克苏地区", "沙雅县"),
	ITEM652925("652925", "新疆维吾尔自治区", "阿克苏地区", "新和县"),
	ITEM652926("652926", "新疆维吾尔自治区", "阿克苏地区", "拜城县"),
	ITEM652927("652927", "新疆维吾尔自治区", "阿克苏地区", "乌什县"),
	ITEM652928("652928", "新疆维吾尔自治区", "阿克苏地区", "阿瓦提县"),
	ITEM652929("652929", "新疆维吾尔自治区", "阿克苏地区", "柯坪县"),
	ITEM653000("653000", "新疆维吾尔自治区", "克孜勒苏柯尔克孜自治州", ""),
	ITEM653001("653001", "新疆维吾尔自治区", "克孜勒苏柯尔克孜自治州", "阿图什市"),
	ITEM653022("653022", "新疆维吾尔自治区", "克孜勒苏柯尔克孜自治州", "阿克陶县"),
	ITEM653023("653023", "新疆维吾尔自治区", "克孜勒苏柯尔克孜自治州", "阿合奇县"),
	ITEM653024("653024", "新疆维吾尔自治区", "克孜勒苏柯尔克孜自治州", "乌恰县"),
	ITEM653100("653100", "新疆维吾尔自治区", "喀什地区", ""),
	ITEM653101("653101", "新疆维吾尔自治区", "喀什地区", "喀什市"),
	ITEM653121("653121", "新疆维吾尔自治区", "喀什地区", "疏附县"),
	ITEM653122("653122", "新疆维吾尔自治区", "喀什地区", "疏勒县"),
	ITEM653123("653123", "新疆维吾尔自治区", "喀什地区", "英吉沙县"),
	ITEM653124("653124", "新疆维吾尔自治区", "喀什地区", "泽普县"),
	ITEM653125("653125", "新疆维吾尔自治区", "喀什地区", "莎车县"),
	ITEM653126("653126", "新疆维吾尔自治区", "喀什地区", "叶城县"),
	ITEM653127("653127", "新疆维吾尔自治区", "喀什地区", "麦盖提县"),
	ITEM653128("653128", "新疆维吾尔自治区", "喀什地区", "岳普湖县"),
	ITEM653129("653129", "新疆维吾尔自治区", "喀什地区", "伽师县"),
	ITEM653130("653130", "新疆维吾尔自治区", "喀什地区", "巴楚县"),
	ITEM653131("653131", "新疆维吾尔自治区", "喀什地区", "塔什库尔干塔吉克自治县"),
	ITEM653200("653200", "新疆维吾尔自治区", "和田地区", ""),
	ITEM653201("653201", "新疆维吾尔自治区", "和田地区", "和田市"),
	ITEM653221("653221", "新疆维吾尔自治区", "和田地区", "和田县"),
	ITEM653222("653222", "新疆维吾尔自治区", "和田地区", "墨玉县"),
	ITEM653223("653223", "新疆维吾尔自治区", "和田地区", "皮山县"),
	ITEM653224("653224", "新疆维吾尔自治区", "和田地区", "洛浦县"),
	ITEM653225("653225", "新疆维吾尔自治区", "和田地区", "策勒县"),
	ITEM653226("653226", "新疆维吾尔自治区", "和田地区", "于田县"),
	ITEM653227("653227", "新疆维吾尔自治区", "和田地区", "民丰县"),
	ITEM654000("654000", "新疆维吾尔自治区", "伊犁哈萨克自治州", ""),
	ITEM654002("654002", "新疆维吾尔自治区", "伊犁哈萨克自治州", "伊宁市"),
	ITEM654003("654003", "新疆维吾尔自治区", "伊犁哈萨克自治州", "奎屯市"),
	ITEM654004("654004", "新疆维吾尔自治区", "伊犁哈萨克自治州", "霍尔果斯市"),
	ITEM654021("654021", "新疆维吾尔自治区", "伊犁哈萨克自治州", "伊宁县"),
	ITEM654022("654022", "新疆维吾尔自治区", "伊犁哈萨克自治州", "察布查尔锡伯自治县"),
	ITEM654023("654023", "新疆维吾尔自治区", "伊犁哈萨克自治州", "霍城县"),
	ITEM654024("654024", "新疆维吾尔自治区", "伊犁哈萨克自治州", "巩留县"),
	ITEM654025("654025", "新疆维吾尔自治区", "伊犁哈萨克自治州", "新源县"),
	ITEM654026("654026", "新疆维吾尔自治区", "伊犁哈萨克自治州", "昭苏县"),
	ITEM654027("654027", "新疆维吾尔自治区", "伊犁哈萨克自治州", "特克斯县"),
	ITEM654028("654028", "新疆维吾尔自治区", "伊犁哈萨克自治州", "尼勒克县"),
	ITEM654200("654200", "新疆维吾尔自治区", "塔城地区", ""),
	ITEM654201("654201", "新疆维吾尔自治区", "塔城地区", "塔城市"),
	ITEM654202("654202", "新疆维吾尔自治区", "塔城地区", "乌苏市"),
	ITEM654221("654221", "新疆维吾尔自治区", "塔城地区", "额敏县"),
	ITEM654223("654223", "新疆维吾尔自治区", "塔城地区", "沙湾县"),
	ITEM654224("654224", "新疆维吾尔自治区", "塔城地区", "托里县"),
	ITEM654225("654225", "新疆维吾尔自治区", "塔城地区", "裕民县"),
	ITEM654226("654226", "新疆维吾尔自治区", "塔城地区", "和布克赛尔蒙古自治县"),
	ITEM654300("654300", "新疆维吾尔自治区", "阿勒泰地区", ""),
	ITEM654301("654301", "新疆维吾尔自治区", "阿勒泰地区", "阿勒泰市"),
	ITEM654321("654321", "新疆维吾尔自治区", "阿勒泰地区", "布尔津县"),
	ITEM654322("654322", "新疆维吾尔自治区", "阿勒泰地区", "富蕴县"),
	ITEM654323("654323", "新疆维吾尔自治区", "阿勒泰地区", "福海县"),
	ITEM654324("654324", "新疆维吾尔自治区", "阿勒泰地区", "哈巴河县"),
	ITEM654325("654325", "新疆维吾尔自治区", "阿勒泰地区", "青河县"),
	ITEM654326("654326", "新疆维吾尔自治区", "阿勒泰地区", "吉木乃县"),
	ITEM659001("659001", "新疆维吾尔自治区", "石河子市", ""),
	ITEM659002("659002", "新疆维吾尔自治区", "阿拉尔市", ""),
	ITEM659003("659003", "新疆维吾尔自治区", "图木舒克市", ""),
	ITEM659004("659004", "新疆维吾尔自治区", "五家渠市", ""),
	ITEM659005("659005", "新疆维吾尔自治区", "北屯市", ""),
	ITEM659006("659006", "新疆维吾尔自治区", "铁门关市", ""),
	ITEM659007("659007", "新疆维吾尔自治区", "双河市", ""),
	ITEM659008("659008", "新疆维吾尔自治区", "可克达拉市", ""),
	;

	private String code;
	private String firstDistrict;
	private String secondDistrict;
	private String thirdDistrict;

	private ChinaNorthwestAreaCodeEnum(String code, String firstDistrict, String secondDistrict, String thirdDistrict) {
		this.code = code;
		this.firstDistrict = firstDistrict;
		this.secondDistrict = secondDistrict;
		this.thirdDistrict = thirdDistrict;
	}

	public String getCode() {
		return code;
	}

	public String getFirstDistrict() {
		return firstDistrict;
	}

	public String getSecondDistrict() {
		return secondDistrict;
	}
	
	public String getThirdDistrict() {
		return thirdDistrict;
	}
	
	public String getFullName() {
		
		return firstDistrict.concat(secondDistrict).concat(thirdDistrict);
	}
	
	public static Map<Object, Object> getResult(String code) {

		if (ValidatorUtil.isAreaCode(code)) {

			for (ChinaNorthwestAreaCodeEnum e : ChinaNorthwestAreaCodeEnum.values()) {

				if (code.equals(e.getCode())) {

					return getResult(e);
				}
			}
		}
		return null;
	}
	
	public static String getCode(String name) {
		
		if (ValidatorUtil.isNotEmptyIgnoreBlank(name)) {
			
			String fullName = null;
			for (ChinaNorthwestAreaCodeEnum e : ChinaNorthwestAreaCodeEnum.values()) {
				
				fullName = e.getFirstDistrict().concat(e.getSecondDistrict()).concat(e.getThirdDistrict());
				if (fullName.equals(name)) {
					
					return e.getCode();
				}
			}
		}
		return null;
	}
	
	public static String getName(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaNorthwestAreaCodeEnum e : ChinaNorthwestAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return getName(e);
				}
			}
		}
		return null;
	}
	
	public static String getFullName(String code) {
		
		if (ValidatorUtil.isAreaCode(code)) {
			
			for (ChinaNorthwestAreaCodeEnum e : ChinaNorthwestAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return e.getFirstDistrict().concat(e.getSecondDistrict()).concat(e.getThirdDistrict());
				}
			}
		}
		return null;
	}
	
	public static String matchCode(String name) {
		
		final String REGEX = "回族自治区|维吾尔自治区|蒙古族藏族自治州|回族自治州|藏族自治州|回族自治州|蒙古自治州|柯尔克孜自治州|哈萨克自治州|地区|保安族东乡族撒拉族自治县|回族土族自治县|回族自治县|土族自治县|藏族自治县|裕固族自治县|蒙古族自治县|蒙古自治县|哈萨克族自治县|哈萨克自治县|撒拉族自治县|塔吉克自治县|锡伯自治县|省|市|区|县";
		String code = null;
		String str1 = null;
		String str2 = null;
		String str3 = null;
		Map<String, String> map1 = new HashMap<String, String>();
		Map<String, String> map2 = new LinkedHashMap<String, String>();
		Map<String, String> map3 = new HashMap<String, String>();
		if (ValidatorUtil.isNotEmptyIgnoreBlank(name)) {
			
			code = matchSpecial(name);
			if (null == code) {
				
				for (ChinaNorthwestAreaCodeEnum e : ChinaNorthwestAreaCodeEnum.values()) {
					
					str1 = e.getFirstDistrict();
					str2 = e.getSecondDistrict();
					str3 = e.getThirdDistrict();
					if (ValidatorUtil.isNotEmpty(str3)) {
						
						map3.put(e.getCode(), (str1.concat(str2).concat(str3)).replaceAll(REGEX, ""));
						map2.put(e.getCode(), (str1.concat(str3)).replaceAll(REGEX, ""));
					}
					if (ValidatorUtil.isEmpty(str3) && ValidatorUtil.isNotEmpty(str2)) {
						
						map2.put(e.getCode(), (str1.concat(str2)).replaceAll(REGEX, ""));
					}
					if (ValidatorUtil.isAllEmpty(str2, str3)) {
						
						map1.put(e.getCode(), str1.replaceAll(REGEX, ""));
					}
				}
				
				name = name.replaceAll(REGEX, "");
				code = getCode(name, map1, map2, map3);
				if (null == code) {
					
					name = name.replaceAll("(?s)(.)(?=.*\\1)", "");
					code = getCode(name, map1, map2, map3);
				}
			}
		}
		return code;
	}
	
	private static String getCode(String name, Map<String, String> map1, Map<String, String> map2, Map<String, String> map3) {
		
		String code = matchCode(name, map3);
		if (null == code) {
			
			code = matchCode(name, map2);
		}
		if (null == code) {
			
			code = matchCode(name, map1);
		}
		return code;
	}
	
	private static String matchCode(String name, Map<String, String> map) {
		
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.equals(entry.getValue())) {
				
				return entry.getKey();
			}
		}
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.startsWith(entry.getValue())) {
				
				return entry.getKey();
			}
		}
		return null;
	}
	
	private static String matchSpecial(String name) {
		
		if (name.startsWith("甘肃")) {
			
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM620402.getThirdDistrict())) {
				// 甘肃省白银市白银区
				return ChinaNorthwestAreaCodeEnum.ITEM620402.getCode();
			}
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM622901.getThirdDistrict())) {
				// 甘肃省临夏回族自治州临夏市
				return ChinaNorthwestAreaCodeEnum.ITEM622901.getCode();
			}
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM622921.getThirdDistrict())) {
				// 甘肃省临夏回族自治州临夏县
				return ChinaNorthwestAreaCodeEnum.ITEM622921.getCode();
			}
		}
		if (name.startsWith("青海")) {
			
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM632701.getThirdDistrict())) {
				// 青海省玉树藏族自治州玉树市
				return ChinaNorthwestAreaCodeEnum.ITEM632701.getCode();
			}
		}
		if (name.startsWith("新疆")) {
			
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM650121.getThirdDistrict())) {
				// 新疆维吾尔自治区乌鲁木齐市乌鲁木齐县
				return ChinaNorthwestAreaCodeEnum.ITEM650121.getCode();
			}
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM650203.getThirdDistrict())) {
				// 新疆维吾尔自治区克拉玛依市克拉玛依区
				return ChinaNorthwestAreaCodeEnum.ITEM650203.getCode();
			}
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM652301.getThirdDistrict())) {
				// 新疆维吾尔自治区昌吉回族自治州昌吉市
				return ChinaNorthwestAreaCodeEnum.ITEM652301.getCode();
			}
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM652901.getThirdDistrict())) {
				// 新疆维吾尔自治区阿克苏地区阿克苏市
				return ChinaNorthwestAreaCodeEnum.ITEM652901.getCode();
			}
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM653101.getThirdDistrict())) {
				// 新疆维吾尔自治区喀什地区喀什市
				return ChinaNorthwestAreaCodeEnum.ITEM653101.getCode();
			}
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM653201.getThirdDistrict())) {
				// 新疆维吾尔自治区和田地区和田市
				return ChinaNorthwestAreaCodeEnum.ITEM653201.getCode();
			}
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM653221.getThirdDistrict())) {
				// 新疆维吾尔自治区和田地区和田县
				return ChinaNorthwestAreaCodeEnum.ITEM653221.getCode();
			}
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM654201.getThirdDistrict())) {
				// 新疆维吾尔自治区塔城地区塔城市
				return ChinaNorthwestAreaCodeEnum.ITEM654201.getCode();
			}
			if (name.contains(ChinaNorthwestAreaCodeEnum.ITEM654301.getThirdDistrict())) {
				// 新疆维吾尔自治区阿勒泰地区阿勒泰市
				return ChinaNorthwestAreaCodeEnum.ITEM654301.getCode();
			}
		}
		return null;
	}
	
	private static String getName(ChinaNorthwestAreaCodeEnum e) {
		
		String name = e.getThirdDistrict();
		if (ValidatorUtil.isEmpty(name)) {
			
			name = e.getSecondDistrict();
		}
		if (ValidatorUtil.isEmpty(name)) {
			
			name = e.getFirstDistrict();
		}
		return ValidatorUtil.isEmpty(name) ? null : name;
	}
	
	private static Map<Object, Object> getResult(ChinaNorthwestAreaCodeEnum e) {

		String district = null;
		Map<Object, Object> map = new HashMap<Object, Object>();
		map.put("code", e.getCode());
		
		district = e.getFirstDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("firstDistrict", district);
		}
		district = e.getSecondDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("secondDistrict", district);
		}
		district = e.getThirdDistrict();
		if (ValidatorUtil.isNotEmpty(district)) {
			
			map.put("thirdDistrict", district);
		}
		return map;
	}
}
