package cn.datawe.constant;

import java.util.HashMap;
import java.util.Map;

import cn.datawe.util.ValidatorUtil;

/**
 * 枚举类:全国电话区号归属地(不含港澳台)
 * <br>数据更新日期:2016-06-21
 * 
 * @author LiuJiaLe
 * 
 */
public enum TelAreaCodeEnum {

	// 直辖市
	ITEM010("010", "北京", "市", "北京", "市"),
	ITEM021("021", "上海", "市", "上海", "市"),
	ITEM022("022", "天津", "市", "天津", "市"),
	ITEM023("023", "重庆", "市", "重庆", "市"),
	
	ITEM0310("0310", "河北", "省", "邯郸", "市"),
	ITEM0311("0311", "河北", "省", "石家庄", "市"),
	ITEM0312("0312", "河北", "省", "保定", "市"),
	ITEM0313("0313", "河北", "省", "张家口", "市"),
	ITEM0314("0314", "河北", "省", "承德", "市"),
	ITEM0315("0315", "河北", "省", "唐山", "市"),
	ITEM0316("0316", "河北", "省", "廊坊", "市"),
	ITEM0317("0317", "河北", "省", "沧州", "市"),
	ITEM0318("0318", "河北", "省", "衡水", "市"),
	ITEM0319("0319", "河北", "省", "邢台", "市"),
	ITEM0335("0335", "河北", "省", "秦皇岛", "市"),
	
	ITEM0349("0349", "山西", "省", "朔州", "市"),
	ITEM0350("0350", "山西", "省", "忻州", "市"),
	ITEM0351("0351", "山西", "省", "太原", "市"),
	ITEM0352("0352", "山西", "省", "大同", "市"),
	ITEM0353("0353", "山西", "省", "阳泉", "市"),
	ITEM0354("0354", "山西", "省", "晋中", "市"),
	ITEM0355("0355", "山西", "省", "长治", "市"),
	ITEM0356("0356", "山西", "省", "晋城", "市"),
	ITEM0357("0357", "山西", "省", "临汾", "市"),
	ITEM0358("0358", "山西", "省", "吕梁", "市"),
	ITEM0359("0359", "山西", "省", "运城", "市"),
	
	ITEM0370("0370", "河南", "省", "商丘", "市"),
	ITEM0371ZZ("0371", "河南", "省", "郑州", "市"),
	ITEM0371KF("0371", "河南", "省", "开封", "市"),
	ITEM0372("0372", "河南", "省", "安阳", "市"),
	ITEM0373("0373", "河南", "省", "新乡", "市"),
	ITEM0374("0374", "河南", "省", "许昌", "市"),
	ITEM0375("0375", "河南", "省", "平顶山", "市"),
	ITEM0376("0376", "河南", "省", "信阳", "市"),
	ITEM0377("0377", "河南", "省", "南阳", "市"),
	ITEM0379("0379", "河南", "省", "洛阳", "市"),
	ITEM0391JY("0391", "河南", "省", "济源", "市"),
	ITEM0391JZ("0391", "河南", "省", "焦作", "市"),
	ITEM0392("0392", "河南", "省", "鹤壁", "市"),
	ITEM0393("0393", "河南", "省", "濮阳", "市"),
	ITEM0394("0394", "河南", "省", "周口", "市"),
	ITEM0395("0395", "河南", "省", "漯河", "市"),
	ITEM0396("0396", "河南", "省", "驻马店", "市"),
	ITEM0398("0398", "河南", "省", "三门峡", "市"),
	
	ITEM024SY("024", "辽宁", "省", "沈阳", "市"),
	ITEM024FS("024", "辽宁", "省", "抚顺", "市"),
	ITEM024TL("024", "辽宁", "省", "铁岭", "市"),
	ITEM024BX("024", "辽宁", "省", "本溪", "市"),
	ITEM0411("0411", "辽宁", "省", "大连", "市"),
	ITEM0412("0412", "辽宁", "省", "鞍山", "市"),
	ITEM0415("0415", "辽宁", "省", "丹东", "市"),
	ITEM0416("0416", "辽宁", "省", "锦州", "市"),
	ITEM0417("0417", "辽宁", "省", "营口", "市"),
	ITEM0418("0418", "辽宁", "省", "阜新", "市"),
	ITEM0419("0419", "辽宁", "省", "辽阳", "市"),
	ITEM0421("0421", "辽宁", "省", "朝阳", "市"),
	ITEM0427("0427", "辽宁", "省", "盘锦", "市"),
	ITEM0429("0429", "辽宁", "省", "葫芦岛", "市"),
	
	ITEM0431("0431", "吉林", "省", "长春", "市"),
	ITEM0432("0432", "吉林", "省", "吉林", "市"),
	ITEM0433("0433", "吉林", "省", "延边", "朝鲜族自治州"),
	ITEM0434("0434", "吉林", "省", "四平", "市"),
	ITEM0435("0435", "吉林", "省", "通化", "市"),
	ITEM0436("0436", "吉林", "省", "白城", "市"),
	ITEM0437("0437", "吉林", "省", "辽源", "市"),
	ITEM0438("0438", "吉林", "省", "松原", "市"),
	ITEM0439("0439", "吉林", "省", "白山", "市"),
	
	ITEM0451("0451", "黑龙江", "省", "哈尔滨", "市"),
	ITEM0452("0452", "黑龙江", "省", "齐齐哈尔", "市"),
	ITEM0453("0453", "黑龙江", "省", "牡丹江", "市"),
	ITEM0454("0454", "黑龙江", "省", "佳木斯", "市"),
	ITEM0455("0455", "黑龙江", "省", "绥化", "市"),
	ITEM0456("0456", "黑龙江", "省", "黑河", "市"),
	ITEM0457("0457", "黑龙江", "省", "大兴安岭", "地区"),
	ITEM0458("0458", "黑龙江", "省", "伊春", "市"),
	ITEM0459("0459", "黑龙江", "省", "大庆", "市"),
	ITEM0464("0464", "黑龙江", "省", "七台河", "市"),
	ITEM0467("0467", "黑龙江", "省", "鸡西", "市"),
	ITEM0468("0468", "黑龙江", "省", "鹤岗", "市"),
	ITEM0469("0469", "黑龙江", "省", "双鸭山", "市"),
	
	ITEM0470("0470", "内蒙古", "自治区", "呼伦贝尔", "市"),
	ITEM0471("0471", "内蒙古", "自治区", "呼和浩特", "市"),
	ITEM0472("0472", "内蒙古", "自治区", "包头", "市"),
	ITEM0473("0473", "内蒙古", "自治区", "乌海", "市"),
	ITEM0474("0474", "内蒙古", "自治区", "乌兰察布", "市"),
	ITEM0475("0475", "内蒙古", "自治区", "通辽", "市"),
	ITEM0476("0476", "内蒙古", "自治区", "赤峰", "市"),
	ITEM0477("0477", "内蒙古", "自治区", "鄂尔多斯", "市"),
	ITEM0478("0478", "内蒙古", "自治区", "巴彦淖尔", "市"),
	ITEM0479("0479", "内蒙古", "自治区", "锡林郭勒", "盟"),
	ITEM0482("0482", "内蒙古", "自治区", "兴安", "盟"),
	ITEM0483("0483", "内蒙古", "自治区", "阿拉善", "盟"),
	
	ITEM025("025", "江苏", "省", "南京", "市"),
	ITEM0510("0510", "江苏", "省", "无锡", "市"),
	ITEM0511("0511", "江苏", "省", "镇江", "市"),
	ITEM0512("0512", "江苏", "省", "苏州", "市"),
	ITEM0513("0513", "江苏", "省", "南通", "市"),
	ITEM0514("0514", "江苏", "省", "扬州", "市"),
	ITEM0515("0515", "江苏", "省", "盐城", "市"),
	ITEM0516("0516", "江苏", "省", "徐州", "市"),
	ITEM0517("0517", "江苏", "省", "淮安", "市"),
	ITEM0518("0518", "江苏", "省", "连云港", "市"),
	ITEM0519("0519", "江苏", "省", "常州", "市"),
	ITEM0523("0523", "江苏", "省", "泰州", "市"),
	ITEM0527("0527", "江苏", "省", "宿迁", "市"),
	
	ITEM0530("0530", "山东", "省", "菏泽", "市"),
	ITEM0531("0531", "山东", "省", "济南", "市"),
	ITEM0532("0532", "山东", "省", "青岛", "市"),
	ITEM0533("0533", "山东", "省", "淄博", "市"),
	ITEM0534("0534", "山东", "省", "德州", "市"),
	ITEM0535("0535", "山东", "省", "烟台", "市"),
	ITEM0536("0536", "山东", "省", "潍坊", "市"),
	ITEM0537("0537", "山东", "省", "济宁", "市"),
	ITEM0538("0538", "山东", "省", "泰安", "市"),
	ITEM0539("0539", "山东", "省", "临沂", "市"),
	ITEM0543("0543", "山东", "省", "滨州", "市"),
	ITEM0546("0546", "山东", "省", "东营", "市"),
	ITEM0631("0631", "山东", "省", "威海", "市"),
	ITEM0632("0632", "山东", "省", "枣庄", "市"),
	ITEM0633("0633", "山东", "省", "日照", "市"),
	ITEM0634("0634", "山东", "省", "莱芜", "市"),
	ITEM0635("0635", "山东", "省", "聊城", "市"),
	
	ITEM0550("0550", "安徽", "省", "滁州", "市"),
	ITEM0551("0551", "安徽", "省", "合肥", "市"),
	ITEM0552("0552", "安徽", "省", "蚌埠", "市"),
	ITEM0553("0553", "安徽", "省", "芜湖", "市"),
	ITEM0554("0554", "安徽", "省", "淮南", "市"),
	ITEM0555("0555", "安徽", "省", "马鞍山", "市"),
	ITEM0556("0556", "安徽", "省", "安庆", "市"),
	ITEM0557("0557", "安徽", "省", "宿州", "市"),
	ITEM0558FY("0558", "安徽", "省", "阜阳", "市"),
	ITEM0558BZ("0558", "安徽", "省", "亳州", "市"),
	ITEM0559("0559", "安徽", "省", "黄山", "市"),
	ITEM0561("0561", "安徽", "省", "淮北", "市"),
	ITEM0562("0562", "安徽", "省", "铜陵", "市"),
	ITEM0563("0563", "安徽", "省", "宣城", "市"),
	ITEM0564("0564", "安徽", "省", "六安", "市"),
	ITEM0565("0565", "安徽", "省", "巢湖", "市"),
	ITEM0566("0566", "安徽", "省", "池州", "市"),
	
	ITEM0570("0570", "浙江", "省", "衢州", "市"),
	ITEM0571("0571", "浙江", "省", "杭州", "市"),
	ITEM0572("0572", "浙江", "省", "湖州", "市"),
	ITEM0573("0573", "浙江", "省", "嘉兴", "市"),
	ITEM0574("0574", "浙江", "省", "宁波", "市"),
	ITEM0575("0575", "浙江", "省", "绍兴", "市"),
	ITEM0576("0576", "浙江", "省", "台州", "市"),
	ITEM0577("0577", "浙江", "省", "温州", "市"),
	ITEM0578("0578", "浙江", "省", "丽水", "市"),
	ITEM0579("0579", "浙江", "省", "金华", "市"),
	ITEM0580("0580", "浙江", "省", "舟山", "市"),
	
	ITEM0591("0591", "福建", "省", "福州", "市"),
	ITEM0592("0592", "福建", "省", "厦门", "市"),
	ITEM0593("0593", "福建", "省", "宁德", "市"),
	ITEM0594("0594", "福建", "省", "莆田", "市"),
	ITEM0595("0595", "福建", "省", "泉州", "市"),
	ITEM0596("0596", "福建", "省", "漳州", "市"),
	ITEM0597("0597", "福建", "省", "龙岩", "市"),
	ITEM0598("0598", "福建", "省", "三明", "市"),
	ITEM0599("0599", "福建", "省", "南平", "市"),
	
	ITEM027("027", "湖北", "省", "武汉", "市"),
	ITEM0710("0710", "湖北", "省", "襄阳", "市"),
	ITEM0711("0711", "湖北", "省", "鄂州", "市"),
	ITEM0712("0712", "湖北", "省", "孝感", "市"),
	ITEM0713("0713", "湖北", "省", "黄冈", "市"),
	ITEM0714("0714", "湖北", "省", "黄石", "市"),
	ITEM0715("0715", "湖北", "省", "咸宁", "市"),
	ITEM0716("0716", "湖北", "省", "荆州", "市"),
	ITEM0717("0717", "湖北", "省", "宜昌", "市"),
	ITEM0718("0718", "湖北", "省", "恩施", "土家族苗族自治州"),
	ITEM0719SNJ("0719", "湖北", "省", "神农架", "林区"),
	ITEM0719SY("0719", "湖北", "省", "十堰", "市"),
	ITEM0722("0722", "湖北", "省", "随州", "市"),
	ITEM0724("0724", "湖北", "省", "荆门", "市"),
	ITEM0728JH("0728", "湖北", "省", "江汉（天门/仙桃/潜江）", "区"),
	ITEM0728QJ("0728", "湖北", "省", "潜江", "市"),
	ITEM0728TM("0728", "湖北", "省", "天门", "市"),
	ITEM0728XT("0728", "湖北", "省", "仙桃", "市"),
	
	ITEM0730("0730", "湖南", "省", "岳阳", "市"),
	ITEM0731("0731", "湖南", "省", "长沙", "市"),
	ITEM0732("0732", "湖南", "省", "湘潭", "市"),
	ITEM0733("0733", "湖南", "省", "株州", "市"),
	ITEM0734("0734", "湖南", "省", "衡阳", "市"),
	ITEM0735("0735", "湖南", "省", "郴州", "市"),
	ITEM0736("0736", "湖南", "省", "常德", "市"),
	ITEM0737("0737", "湖南", "省", "益阳", "市"),
	ITEM0738("0738", "湖南", "省", "娄底", "市"),
	ITEM0739("0739", "湖南", "省", "邵阳", "市"),
	ITEM0743("0743", "湖南", "省", "湘西", "土家族苗族自治州"),
	ITEM0744("0744", "湖南", "省", "张家界", "市"),
	ITEM0745("0745", "湖南", "省", "怀化", "市"),
	ITEM0746("0746", "湖南", "省", "永州", "市"),
	
	ITEM020("020", "广东", "省", "广州", "市"),
	ITEM0660("0660", "广东", "省", "汕尾", "市"),
	ITEM0662("0662", "广东", "省", "阳江", "市"),
	ITEM0663("0663", "广东", "省", "揭西", "市"),
	ITEM0668("0668", "广东", "省", "茂名", "市"),
	ITEM0750("0750", "广东", "省", "江门", "市"),
	ITEM0751("0751", "广东", "省", "韶关", "市"),
	ITEM0752("0752", "广东", "省", "惠州", "市"),
	ITEM0753("0753", "广东", "省", "梅州", "市"),
	ITEM0754("0754", "广东", "省", "汕头", "市"),
	ITEM0755("0755", "广东", "省", "深圳", "市"),
	ITEM0756("0756", "广东", "省", "珠海", "市"),
	ITEM0757("0757", "广东", "省", "佛山", "市"),
	ITEM0758("0758", "广东", "省", "肇庆", "市"),
	ITEM0759("0759", "广东", "省", "湛江", "市"),
	ITEM0760("0760", "广东", "省", "中山", "市"),
	ITEM0762("0762", "广东", "省", "河源", "市"),
	ITEM0763("0763", "广东", "省", "清远", "市"),
	ITEM0766("0766", "广东", "省", "云浮", "市"),
	ITEM0768("0768", "广东", "省", "潮州", "市"),
	ITEM0769("0769", "广东", "省", "东莞", "市"),
	
	ITEM0770("0770", "广西", "壮族自治区", "防城港", "市"),
	ITEM0771NN("0771", "广西", "壮族自治区", "南宁", "市"),
	ITEM0771CZ("0771", "广西", "壮族自治区", "崇左", "市"),
	ITEM0772LZ("0772", "广西", "壮族自治区", "柳州", "市"),
	ITEM0772LB("0772", "广西", "壮族自治区", "来宾", "市"),
	ITEM0773("0773", "广西", "壮族自治区", "桂林", "市"),
	ITEM0774("0774", "广西", "壮族自治区", "梧州", "市"),
	ITEM0775YL("0775", "广西", "壮族自治区", "玉林", "市"),
	ITEM0775GG("0775", "广西", "壮族自治区", "贵港", "市"),
	ITEM0776("0776", "广西", "壮族自治区", "百色", "市"),
	ITEM0777("0777", "广西", "壮族自治区", "钦州", "市"),
	ITEM0778("0778", "广西", "壮族自治区", "河池", "市"),
	ITEM0779("0779", "广西", "壮族自治区", "北海", "市"),
	
	ITEM0701("0701", "江西", "省", "鹰潭", "市"),
	ITEM0790("0790", "江西", "省", "新余", "市"),
	ITEM0791("0791", "江西", "省", "南昌", "市"),
	ITEM0792("0792", "江西", "省", "九江", "市"),
	ITEM0793("0793", "江西", "省", "上饶", "市"),
	ITEM0794("0794", "江西", "省", "抚州", "市"),
	ITEM0795("0795", "江西", "省", "宜春", "市"),
	ITEM0796("0796", "江西", "省", "吉安", "市"),
	ITEM0797("0797", "江西", "省", "赣州", "市"),
	ITEM0798("0798", "江西", "省", "景德镇", "市"),
	ITEM0799("0799", "江西", "省", "萍乡", "市"),
	
	ITEM028CD("028", "四川", "省", "成都", "市"),
	ITEM028MS("028", "四川", "省", "眉山", "市"),
	ITEM028ZY("028", "四川", "省", "资阳", "市"),
	ITEM0812("0812", "四川", "省", "攀枝花", "市"),
	ITEM0813("0813", "四川", "省", "自贡", "市"),
	ITEM0816("0816", "四川", "省", "绵阳", "市"),
	ITEM0817("0817", "四川", "省", "南充", "市"),
	ITEM0818("0818", "四川", "省", "达州", "市"),
	ITEM0825("0825", "四川", "省", "遂宁", "市"),
	ITEM0826("0826", "四川", "省", "广安", "市"),
	ITEM0827("0827", "四川", "省", "巴中", "市"),
	ITEM0830("0830", "四川", "省", "泸州", "市"),
	ITEM0831("0831", "四川", "省", "宜宾", "市"),
	ITEM0832("0832", "四川", "省", "内江", "市"),
	ITEM0833("0833", "四川", "省", "乐山", "市"),
	ITEM0834("0834", "四川", "省", "凉山", "彝族自治州"),
	ITEM0835("0835", "四川", "省", "雅安", "市"),
	ITEM0836("0836", "四川", "省", "甘孜", "藏族自治州"),
	ITEM0837("0837", "四川", "省", "阿坝", "藏族羌族自治州"),
	ITEM0838("0838", "四川", "省", "德阳", "市"),
	ITEM0839("0839", "四川", "省", "广元", "市"),
	
	ITEM0851("0851", "贵州", "省", "贵阳", "市"),
	ITEM0852("0852", "贵州", "省", "遵义", "市"),
	ITEM0853("0853", "贵州", "省", "安顺", "市"),
	ITEM0854("0854", "贵州", "省", "黔南", "布依族苗族自治州"),
	ITEM0855("0855", "贵州", "省", "黔东南", "苗族侗族自治州"),
	ITEM0856("0856", "贵州", "省", "铜仁", "市"),
	ITEM0857("0857", "贵州", "省", "毕节", "市"),
	ITEM0858("0858", "贵州", "省", "六盘水", "市"),
	ITEM0859("0859", "贵州", "省", "黔西南", "布依族苗族自治州"),
	
	ITEM0691("0691", "云南", "省", "西双版纳", "傣族自治州"),
	ITEM0692("0692", "云南", "省", "德宏", "傣族景颇族自治州"),
	ITEM0870("0870", "云南", "省", "昭通", "市"),
	ITEM0871("0871", "云南", "省", "昆明", "市"),
	ITEM0872("0872", "云南", "省", "大理", "白族自治州"),
	ITEM0873("0873", "云南", "省", "红河", "哈尼族彝族自治州"),
	ITEM0874("0874", "云南", "省", "曲靖", "市"),
	ITEM0875("0875", "云南", "省", "保山", "市"),
	ITEM0876("0876", "云南", "省", "文山", "壮族苗族自治州"),
	ITEM0877("0877", "云南", "省", "玉溪", "市"),
	ITEM0878("0878", "云南", "省", "楚雄", "彝族自治州"),
	ITEM0879("0879", "云南", "省", "普洱", "市"),
	ITEM0883("0883", "云南", "省", "临沧", "市"),
	ITEM0886("0886", "云南", "省", "怒江", "傈僳族自治州"),
	ITEM0887("0887", "云南", "省", "迪庆", "藏族自治州"),
	ITEM0888("0888", "云南", "省", "丽江", "市"),
	
	ITEM0891("0891", "西藏", "自治区", "拉萨", "市"),
	ITEM0892("0892", "西藏", "自治区", "日喀则", "市"),
	ITEM0893("0893", "西藏", "自治区", "山南", "地区"),
	ITEM0894("0894", "西藏", "自治区", "林芝", "市"),
	ITEM0895("0895", "西藏", "自治区", "昌都", "市"),
	ITEM0896("0896", "西藏", "自治区", "那曲", "地区"),
	ITEM0897("0897", "西藏", "自治区", "阿里", "地区"),
	
	ITEM0898HK("0898", "海南", "省", "海口", "市"),
	ITEM0898SY("0898", "海南", "省", "三亚", "市"),
	ITEM0898DF("0898", "海南", "省", "东方", "市"),
	ITEM0898WN("0898", "海南", "省", "万宁", "市"),
	ITEM0898WC("0898", "海南", "省", "文昌", "市"),
	ITEM0898DZ("0898", "海南", "省", "儋州", "市"),
	ITEM0898QH("0898", "海南", "省", "琼海", "市"),
	ITEM0898WZS("0898", "海南", "省", "五指山", "市"),
	ITEM0898SS("0898", "海南", "省", "三沙", "市"),
	ITEM0898LG("0898", "海南", "省", "临高", "县"),
	ITEM0898CM("0898", "海南", "省", "澄迈", "县"),
	ITEM0898TC("0898", "海南", "省", "屯昌", "县"),
	ITEM0898AD("0898", "海南", "省", "定安", "县"),
	ITEM0898QZ("0898", "海南", "省", "琼中", "黎族苗族自治县"),
	ITEM0898BT("0898", "海南", "省", "保亭", "黎族苗族自治县"),
	ITEM0898LS("0898", "海南", "省", "陵水", "黎族自治县"),
	ITEM0898LD("0898", "海南", "省", "乐东", "黎族自治县"),
	ITEM0898CJ("0898", "海南", "省", "昌江", "黎族自治县"),
	ITEM0898BS("0898", "海南", "省", "白沙", "黎族自治县"),
	
	ITEM0901("0901", "新疆", "维吾尔自治区", "塔城", "地区"),
	ITEM0902("0902", "新疆", "维吾尔自治区", "哈密", "地区"),
	ITEM0903("0903", "新疆", "维吾尔自治区", "和田", "地区"),
	ITEM0906("0906", "新疆", "维吾尔自治区", "阿勒泰", "地区"),
	ITEM0990("0990", "新疆", "维吾尔自治区", "克拉玛依", "市"),
	ITEM0991("0991", "新疆", "维吾尔自治区", "乌鲁木齐", "市"),
	ITEM0993("0993", "新疆", "维吾尔自治区", "石河子", "市"),
	ITEM0994WJQ("0994", "新疆", "维吾尔自治区", "五家渠", "市"),
	ITEM0994CJ("0994", "新疆", "维吾尔自治区", "昌吉", "回族自治州"),
	ITEM0995("0995", "新疆", "维吾尔自治区", "吐鲁番", "市"),
	ITEM0997AKS("0997", "新疆", "维吾尔自治区", "阿克苏", "地区"),
	ITEM0997ALE("0997", "新疆", "维吾尔自治区", "阿拉尔", "市"),
	ITEM0998KS("0998", "新疆", "维吾尔自治区", "喀什", "地区"),
	ITEM0998TMSK("0998", "新疆", "维吾尔自治区", "图木舒克", "市"),
	ITEM0908("0908", "新疆", "维吾尔自治区", "克孜勒苏柯尔克孜", "自治州"),
	ITEM0909("0909", "新疆", "维吾尔自治区", "博尔塔拉", "蒙古自治州"),
	ITEM0996("0996", "新疆", "维吾尔自治区", "巴音郭楞", "蒙古自治州"),
	ITEM0999KKDL("0999", "新疆", "维吾尔自治区", "可克达拉", "市"),
	ITEM0999YLHSK("0999", "新疆", "维吾尔自治区", "伊犁哈萨克", "自治州"),
	
	ITEM029XA("029", "陕西", "省", "西安", "市"),
	ITEM029XY("029", "陕西", "省", "咸阳", "市"),
	ITEM0911("0911", "陕西", "省", "延安", "市"),
	ITEM0912("0912", "陕西", "省", "榆林", "市"),
	ITEM0913("0913", "陕西", "省", "渭南", "市"),
	ITEM0914("0914", "陕西", "省", "商洛", "市"),
	ITEM0915("0915", "陕西", "省", "安康", "市"),
	ITEM0916("0916", "陕西", "省", "汉中", "市"),
	ITEM0917("0917", "陕西", "省", "宝鸡", "市"),
	ITEM0919("0919", "陕西", "省", "铜川", "市"),
	
	ITEM0930("0930", "甘肃", "省", "临夏", "回族自治州"),
	ITEM0931("0931", "甘肃", "省", "兰州", "市"),
	ITEM0932("0932", "甘肃", "省", "定西", "市"),
	ITEM0933("0933", "甘肃", "省", "平凉", "市"),
	ITEM0934("0934", "甘肃", "省", "庆阳", "市"),
	ITEM0935WW("0935", "甘肃", "省", "武威", "市"),
	ITEM0935JC("0935", "甘肃", "省", "金昌", "市"),
	ITEM0936("0936", "甘肃", "省", "张掖", "市"),
	ITEM0937JQ("0937", "甘肃", "省", "酒泉", "市"),
	ITEM0937JYG("0937", "甘肃", "省", "嘉峪关", "市"),
	ITEM0938("0938", "甘肃", "省", "天水", "市"),
	ITEM0939("0939", "甘肃", "省", "陇南", "市"),
	ITEM0941("0941", "甘肃", "省", "甘南", "藏族自治州"),
	ITEM0943("0943", "甘肃", "省", "白银", "市"),
	
	ITEM0951("0951", "宁夏", "回族自治区", "银川", "市"),
	ITEM0952("0952", "宁夏", "回族自治区", "石嘴山", "市"),
	ITEM0953("0953", "宁夏", "回族自治区", "吴忠", "市"),
	ITEM0954("0954", "宁夏", "回族自治区", "固原", "市"),
	ITEM0955("0955", "宁夏", "回族自治区", "中卫", "市"),
	
	ITEM0970("0970", "青海", "省", "海北", "藏族自治州"),
	ITEM0971("0971", "青海", "省", "西宁", "市"),
	ITEM0972("0972", "青海", "省", "海东", "市"),
	ITEM0973("0973", "青海", "省", "黄南", "藏族自治州"),
	ITEM0974("0974", "青海", "省", "海南", "藏族自治州"),
	ITEM0975("0975", "青海", "省", "果洛", "藏族自治州"),
	ITEM0976("0976", "青海", "省", "玉树", "藏族自治州"),
	ITEM0977("0979", "青海", "省", "海西", "蒙古族藏族自治州"),
	;

	private String code;// 电话区号
	private String province;// 电话区号归属所属地
	private String provinceType;// 电话区号归属所属地的行政区划类型
	private String district;// 电话区号归属地
	private String districtType;// 电话区号归属地的行政区划类型

	private TelAreaCodeEnum(String code, String province, String provinceType, String district, String districtType) {
		this.code = code;
		this.province = province;
		this.provinceType = provinceType;
		this.district = district;
		this.districtType = districtType;
	}

	public String getCode() {
		return code;
	}

	public String getProvince() {
		return province;
	}
	
	public String getProvinceType() {
		return provinceType;
	}
	
	public String getDistrict() {
		return district;
	}
	
	public String getDistrictType() {
		return districtType;
	}
	
	public static String getCode(String district) {
		
		if (ValidatorUtil.isNotEmptyIgnoreBlank(district)) {
			
			for (TelAreaCodeEnum e : TelAreaCodeEnum.values()) {
				
				if (district.equals(e.getDistrict())) {
					
					return e.getCode();
				}
			}
		}
		return null;
	}
	
	public static String getDistrict(String code) {
		
		if (ValidatorUtil.isNotEmptyIgnoreBlank(code)) {
			
			for (TelAreaCodeEnum e : TelAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return e.getDistrict();
				}
			}
		}
		return null;
	}
	
	public static String getDistrictAndDistrictType(String code) {
		
		if (ValidatorUtil.isNotEmptyIgnoreBlank(code)) {
			
			for (TelAreaCodeEnum e : TelAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return e.getDistrict().concat(e.getDistrictType());
				}
			}
		}
		return null;
	}
	
	public static String getProvinceAndDistrict(String code) {
		
		if (ValidatorUtil.isNotEmptyIgnoreBlank(code)) {
			
			for (TelAreaCodeEnum e : TelAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					
					return e.getProvince().equals(e.getDistrict())
							? e.getDistrict()
							: e.getProvince().concat(e.getDistrict());
				}
			}
		}
		return null;
	}
	
	public static String getFullDistrict(String code) {
		
		if (ValidatorUtil.isNotEmptyIgnoreBlank(code)) {
			
			for (TelAreaCodeEnum e : TelAreaCodeEnum.values()) {
				
				if (code.equals(e.getCode())) {
					// 直辖市
					return e.getProvince().equals(e.getDistrict())
							? e.getDistrict().concat(e.getDistrictType())
							: e.getProvince().concat(e.getProvinceType()).concat(e.getDistrict()).concat(e.getDistrictType());
				}
			}
		}
		return null;
	}
	
	public static String matchCode(String district) {
		
		final String REGEX = "朝鲜族自治州|地区|省|市|区|县";
		String code = null;
		String str1 = null;
		Map<String, String> map1 = new HashMap<String, String>();
		if (ValidatorUtil.isNotEmptyIgnoreBlank(district)) {

			if (null == code) {
				
				for (TelAreaCodeEnum e : TelAreaCodeEnum.values()) {
					
					str1 = e.getDistrict();
					if (ValidatorUtil.isNotEmpty(str1)) {
						
						map1.put(str1.replaceAll(REGEX, ""),e.getCode());
					}
				}
				
				district = district.replaceAll(REGEX, "");
				code = matchCode(district, map1);
				if (null == code) {
					
					district = district.replaceAll("(?s)(.)(?=.*\\1)", "");
					code = matchCode(district, map1);
				}
			}
		}
		return code;
	}
	private static String matchCode(String name, Map<String, String> map) {
		
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.equals(entry.getKey())) {
				
				return entry.getValue();
			}
		}
		for (Map.Entry<String, String> entry : map.entrySet()) {
			
			if (name.startsWith(entry.getKey())) {
				
				return entry.getValue();
			}
		}
		return null;
	}
	public static void main(String[] args){
		System.out.println(TelAreaCodeEnum.matchCode("深圳市"));
	}
}
